;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                        Unix v4.4.1 *
;* Date/Time created: Thu Feb  6 12:56:22 2025                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("./mp3_encode.c")

	.dwattr $C$DW$1290, DW_AT_TI_call
        CALL #_verify_output ; |2608| 
                                        ; call occurs [#_verify_output] ; |2608| 
	.dwpsn	file "./mp3_encode.c",line 2609,column 17,is_stmt
        MOV dbl(*SP(#12)), AC0 ; |2609| 
        ADD dbl(*SP(#18)), AC0, AC0 ; |2609| 
        MOV AC0, dbl(*SP(#18)) ; |2609| 
$C$L265:    
	.dwpsn	file "./mp3_encode.c",line 2613,column 9,is_stmt
        MOV dbl(*SP(#22)), XAR0
        AMAR *SP(#12), XAR1
$C$DW$1291	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$1291, DW_AT_low_pc(0x00)
	.dwattr $C$DW$1291, DW_AT_name("_shine_flush")
	.dwattr $C$DW$1291, DW_AT_TI_call
        CALL #_shine_flush ; |2613| 
                                        ; call occurs [#_shine_flush] ; |2613| 
        MOV XAR0, dbl(*SP(#14))
	.dwpsn	file "./mp3_encode.c",line 2614,column 9,is_stmt
        AMAR *SP(#20), XAR1
        MOV dbl(*SP(#12)), AC0 ; |2614| 
$C$DW$1292	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$1292, DW_AT_low_pc(0x00)
	.dwattr $C$DW$1292, DW_AT_name("_verify_output")
	.dwattr $C$DW$1292, DW_AT_TI_call
        CALL #_verify_output ; |2614| 
                                        ; call occurs [#_verify_output] ; |2614| 
	.dwpsn	file "./mp3_encode.c",line 2615,column 9,is_stmt
        MOV dbl(*SP(#12)), AC0 ; |2615| 
        ADD dbl(*SP(#18)), AC0, AC0 ; |2615| 
        MOV AC0, dbl(*SP(#18)) ; |2615| 
	.dwpsn	file "./mp3_encode.c",line 2618,column 9,is_stmt
        MOV dbl(*SP(#22)), XAR0
$C$DW$1293	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$1293, DW_AT_low_pc(0x00)
	.dwattr $C$DW$1293, DW_AT_name("_shine_close")
	.dwattr $C$DW$1293, DW_AT_TI_call
        CALL #_shine_close ; |2618| 
                                        ; call occurs [#_shine_close] ; |2618| 
	.dwpsn	file "./mp3_encode.c",line 2619,column 2,is_stmt
        MOV dbl(*SP(#16)), XAR3
        MOV XAR3, AC0
        BCC $C$L266,AC0 == #0 ; |2619| 
                                        ; branchcc occurs ; |2619| 
	.dwpsn	file "./mp3_encode.c",line 2620,column 3,is_stmt
        MOV dbl(*SP(#16)), XAR0
$C$DW$1294	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$1294, DW_AT_low_pc(0x00)
	.dwattr $C$DW$1294, DW_AT_name("_free")
	.dwattr $C$DW$1294, DW_AT_TI_call
        CALL #_free ; |2620| 
                                        ; call occurs [#_free] ; |2620| 
$C$L266:    
	.dwpsn	file "./mp3_encode.c",line 2622,column 9,is_stmt
        MOV #0, AC0 ; |2622| 
	.dwpsn	file "./mp3_encode.c",line 2623,column 1,is_stmt
        AADD #33, SP
	.dwcfi	cfa_offset, 1
$C$DW$1295	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$1295, DW_AT_low_pc(0x00)
	.dwattr $C$DW$1295, DW_AT_TI_return
        RET
                                        ; return occurs

$C$DW$1296	.dwtag  DW_TAG_TI_loop
	.dwattr $C$DW$1296, DW_AT_name("/home/santiago/Research/dspfuzz/on_board/test_programs/mp3_encode/mp3_encode.asm:$C$L263:1:1738864582")
	.dwattr $C$DW$1296, DW_AT_TI_begin_file("./mp3_encode.c")
	.dwattr $C$DW$1296, DW_AT_TI_begin_line(0xa21)
	.dwattr $C$DW$1296, DW_AT_TI_end_line(0xa27)
$C$DW$1297	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$1297, DW_AT_low_pc($C$DW$L$_mp3_encode$2$B)
	.dwattr $C$DW$1297, DW_AT_high_pc($C$DW$L$_mp3_encode$2$E)
	.dwendtag $C$DW$1296

	.dwattr $C$DW$1261, DW_AT_TI_end_file("./mp3_encode.c")
	.dwattr $C$DW$1261, DW_AT_TI_end_line(0xa3f)
	.dwattr $C$DW$1261, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$1261

;*******************************************************************************
;* FLOATING-POINT CONSTANTS                                                    *
;*******************************************************************************
	.sect	".const"
	.align	2
$C$FL1:	.xlong	0x44100000
	.align	2
$C$FL2:	.xlong	0x45fa0000
	.align	2
$C$FL3:	.xlong	0x447a0000
	.align	2
$C$FL4:	.xlong	0x00000000
	.align	2
$C$FL5:	.xlong	0x3f800000
	.align	2
$C$FL6:	.xlong	0x40000000
	.align	2
$C$FL7:	.xlong	0x40800000
	.align	2
$C$FL8:	.xlong	0x4f000000
	.align	2
$C$FL9:	.xlong	0x3f000000
	.align	2
$C$FL10:	.xlong	0x3dc1bda5
	.align	2
$C$FL11:	.xlong	0x30000000
	.align	2
$C$FL12:	.xlong	0x3db2b8c2
	.align	2
$C$FL13:	.xlong	0x3d32b8c3
	.align	2
$C$FL14:	.xlong	0x3fae147b
	.align	2
$C$FL15:	.xlong	0xbf19999a
	.align	2
$C$FL16:	.xlong	0x3fa4a306
	.align	2
$C$FL17:	.xlong	0xbf08f5c3
	.align	2
$C$FL18:	.xlong	0x3f8df070
	.align	2
$C$FL19:	.xlong	0xbea8f5c3
	.align	2
$C$FL20:	.xlong	0x3f84617c
	.align	2
$C$FL21:	.xlong	0xbe3d70a4
	.align	2
$C$FL22:	.xlong	0x3f8127bb
	.align	2
$C$FL23:	.xlong	0xbdc28f5c
	.align	2
$C$FL24:	.xlong	0x3f803715
	.align	2
$C$FL25:	.xlong	0xbd27ef9e
	.align	2
$C$FL26:	.xlong	0x3f80069b
	.align	2
$C$FL27:	.xlong	0xbc68a71e
	.align	2
$C$FL28:	.xlong	0x3f800073
	.align	2
$C$FL29:	.xlong	0xbb727bb3
	.align	2
$C$FL30:	.xlong	0x3d490fdb
	.align	2
$C$FL31:	.xlong	0x4e6e6b28
	.align	2
$C$FL32:	.xlong	0x4009705f
	.align	2
$C$FL33:	.xlong	0x40466666
;******************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                              *
;******************************************************************************
	.global	_malloc
	.global	_free
	.global	_exit
	.global	_memset
	.global	_sqrt
	.global	_pow
	.global	_sin
	.global	_cos
	.global	_modf
	.global	__divd
	.global	__fltid
	.global	__mpyd
	.global	__fixdli
	.global	__subd
	.global	__negd
	.global	__cmpd
	.global	__addd
	.global	__divli
	.global	__remi
	.global	__remli
	.global	__mpyli
	.global	__fltlid
	.global	__mpylli
	.global	__divul
	.global	__remul
	.global	_memcpy

;*******************************************************************************
;* TYPE INFORMATION                                                            *
;*******************************************************************************

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x06)
$C$DW$1298	.dwtag  DW_TAG_member
	.dwattr $C$DW$1298, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1298, DW_AT_name("mode")
	.dwattr $C$DW$1298, DW_AT_TI_symbol_name("_mode")
	.dwattr $C$DW$1298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1298, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1299	.dwtag  DW_TAG_member
	.dwattr $C$DW$1299, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1299, DW_AT_name("bitr")
	.dwattr $C$DW$1299, DW_AT_TI_symbol_name("_bitr")
	.dwattr $C$DW$1299, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1299, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1300	.dwtag  DW_TAG_member
	.dwattr $C$DW$1300, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1300, DW_AT_name("emph")
	.dwattr $C$DW$1300, DW_AT_TI_symbol_name("_emph")
	.dwattr $C$DW$1300, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1300, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$22

$C$DW$T$61	.dwtag  DW_TAG_typedef, DW_AT_name("shine_mpeg_t")
	.dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
$C$DW$T$91	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$T$91, DW_AT_address_class(0x17)

$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x294)
$C$DW$1301	.dwtag  DW_TAG_member
	.dwattr $C$DW$1301, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1301, DW_AT_name("xr")
	.dwattr $C$DW$1301, DW_AT_TI_symbol_name("_xr")
	.dwattr $C$DW$1301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1301, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1302	.dwtag  DW_TAG_member
	.dwattr $C$DW$1302, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1302, DW_AT_name("xrmax")
	.dwattr $C$DW$1302, DW_AT_TI_symbol_name("_xrmax")
	.dwattr $C$DW$1302, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1302, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1303	.dwtag  DW_TAG_member
	.dwattr $C$DW$1303, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$1303, DW_AT_name("steptabi")
	.dwattr $C$DW$1303, DW_AT_TI_symbol_name("_steptabi")
	.dwattr $C$DW$1303, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1303, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1304	.dwtag  DW_TAG_member
	.dwattr $C$DW$1304, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$1304, DW_AT_name("int2idx")
	.dwattr $C$DW$1304, DW_AT_TI_symbol_name("_int2idx")
	.dwattr $C$DW$1304, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
	.dwattr $C$DW$1304, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$26

$C$DW$T$73	.dwtag  DW_TAG_typedef, DW_AT_name("l3loop_t")
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)

$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x2a)
$C$DW$1305	.dwtag  DW_TAG_member
	.dwattr $C$DW$1305, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1305, DW_AT_name("l")
	.dwattr $C$DW$1305, DW_AT_TI_symbol_name("_l")
	.dwattr $C$DW$1305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1305, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$30

$C$DW$T$76	.dwtag  DW_TAG_typedef, DW_AT_name("shine_psy_ratio_t")
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
$C$DW$T$92	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$92, DW_AT_address_class(0x17)

$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x12)
$C$DW$1306	.dwtag  DW_TAG_member
	.dwattr $C$DW$1306, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$1306, DW_AT_name("frac_slots_per_frame")
	.dwattr $C$DW$1306, DW_AT_TI_symbol_name("_frac_slots_per_frame")
	.dwattr $C$DW$1306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1306, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1307	.dwtag  DW_TAG_member
	.dwattr $C$DW$1307, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$1307, DW_AT_name("slot_lag")
	.dwattr $C$DW$1307, DW_AT_TI_symbol_name("_slot_lag")
	.dwattr $C$DW$1307, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1307, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1308	.dwtag  DW_TAG_member
	.dwattr $C$DW$1308, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1308, DW_AT_name("bitr")
	.dwattr $C$DW$1308, DW_AT_TI_symbol_name("_bitr")
	.dwattr $C$DW$1308, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1308, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1309	.dwtag  DW_TAG_member
	.dwattr $C$DW$1309, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1309, DW_AT_name("emph")
	.dwattr $C$DW$1309, DW_AT_TI_symbol_name("_emph")
	.dwattr $C$DW$1309, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$1309, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1310	.dwtag  DW_TAG_member
	.dwattr $C$DW$1310, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1310, DW_AT_name("padding")
	.dwattr $C$DW$1310, DW_AT_TI_symbol_name("_padding")
	.dwattr $C$DW$1310, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1310, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1311	.dwtag  DW_TAG_member
	.dwattr $C$DW$1311, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1311, DW_AT_name("bits_per_frame")
	.dwattr $C$DW$1311, DW_AT_TI_symbol_name("_bits_per_frame")
	.dwattr $C$DW$1311, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$1311, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1312	.dwtag  DW_TAG_member
	.dwattr $C$DW$1312, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1312, DW_AT_name("bits_per_slot")
	.dwattr $C$DW$1312, DW_AT_TI_symbol_name("_bits_per_slot")
	.dwattr $C$DW$1312, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1312, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1313	.dwtag  DW_TAG_member
	.dwattr $C$DW$1313, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1313, DW_AT_name("whole_slots_per_frame")
	.dwattr $C$DW$1313, DW_AT_TI_symbol_name("_whole_slots_per_frame")
	.dwattr $C$DW$1313, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$1313, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1314	.dwtag  DW_TAG_member
	.dwattr $C$DW$1314, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1314, DW_AT_name("crc")
	.dwattr $C$DW$1314, DW_AT_TI_symbol_name("_crc")
	.dwattr $C$DW$1314, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1314, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1315	.dwtag  DW_TAG_member
	.dwattr $C$DW$1315, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1315, DW_AT_name("ext")
	.dwattr $C$DW$1315, DW_AT_TI_symbol_name("_ext")
	.dwattr $C$DW$1315, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$1315, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1316	.dwtag  DW_TAG_member
	.dwattr $C$DW$1316, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1316, DW_AT_name("bitrate_index")
	.dwattr $C$DW$1316, DW_AT_TI_symbol_name("_bitrate_index")
	.dwattr $C$DW$1316, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1316, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1317	.dwtag  DW_TAG_member
	.dwattr $C$DW$1317, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1317, DW_AT_name("samplerate_index")
	.dwattr $C$DW$1317, DW_AT_TI_symbol_name("_samplerate_index")
	.dwattr $C$DW$1317, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$1317, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1318	.dwtag  DW_TAG_member
	.dwattr $C$DW$1318, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1318, DW_AT_name("version")
	.dwattr $C$DW$1318, DW_AT_TI_symbol_name("_version")
	.dwattr $C$DW$1318, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$1318, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1319	.dwtag  DW_TAG_member
	.dwattr $C$DW$1319, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1319, DW_AT_name("layer")
	.dwattr $C$DW$1319, DW_AT_TI_symbol_name("_layer")
	.dwattr $C$DW$1319, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$1319, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1320	.dwtag  DW_TAG_member
	.dwattr $C$DW$1320, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1320, DW_AT_name("granules_per_frame")
	.dwattr $C$DW$1320, DW_AT_TI_symbol_name("_granules_per_frame")
	.dwattr $C$DW$1320, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1320, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1321	.dwtag  DW_TAG_member
	.dwattr $C$DW$1321, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1321, DW_AT_name("mode")
	.dwattr $C$DW$1321, DW_AT_TI_symbol_name("_mode")
	.dwattr $C$DW$1321, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$1321, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$32

$C$DW$T$77	.dwtag  DW_TAG_typedef, DW_AT_name("priv_shine_mpeg_t")
	.dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)

$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x7a)
$C$DW$1322	.dwtag  DW_TAG_member
	.dwattr $C$DW$1322, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1322, DW_AT_name("l")
	.dwattr $C$DW$1322, DW_AT_TI_symbol_name("_l")
	.dwattr $C$DW$1322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1322, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1323	.dwtag  DW_TAG_member
	.dwattr $C$DW$1323, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$1323, DW_AT_name("s")
	.dwattr $C$DW$1323, DW_AT_TI_symbol_name("_s")
	.dwattr $C$DW$1323, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1323, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$40

$C$DW$T$79	.dwtag  DW_TAG_typedef, DW_AT_name("shine_scalefac_t")
	.dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)

$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x510)
$C$DW$1324	.dwtag  DW_TAG_member
	.dwattr $C$DW$1324, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$1324, DW_AT_name("cos_l")
	.dwattr $C$DW$1324, DW_AT_TI_symbol_name("_cos_l")
	.dwattr $C$DW$1324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1324, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$43

$C$DW$T$80	.dwtag  DW_TAG_typedef, DW_AT_name("mdct_t")
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)

$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x1402)
$C$DW$1325	.dwtag  DW_TAG_member
	.dwattr $C$DW$1325, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$1325, DW_AT_name("off")
	.dwattr $C$DW$1325, DW_AT_TI_symbol_name("_off")
	.dwattr $C$DW$1325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1325, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1326	.dwtag  DW_TAG_member
	.dwattr $C$DW$1326, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$1326, DW_AT_name("fl")
	.dwattr $C$DW$1326, DW_AT_TI_symbol_name("_fl")
	.dwattr $C$DW$1326, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1326, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1327	.dwtag  DW_TAG_member
	.dwattr $C$DW$1327, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$1327, DW_AT_name("x")
	.dwattr $C$DW$1327, DW_AT_TI_symbol_name("_x")
	.dwattr $C$DW$1327, DW_AT_data_member_location[DW_OP_plus_uconst 0x1002]
	.dwattr $C$DW$1327, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$49

$C$DW$T$81	.dwtag  DW_TAG_typedef, DW_AT_name("subband_t")
	.dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)

$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x17)
$C$DW$1328	.dwtag  DW_TAG_member
	.dwattr $C$DW$1328, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1328, DW_AT_name("part2_3_length")
	.dwattr $C$DW$1328, DW_AT_TI_symbol_name("_part2_3_length")
	.dwattr $C$DW$1328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1328, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1329	.dwtag  DW_TAG_member
	.dwattr $C$DW$1329, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1329, DW_AT_name("big_values")
	.dwattr $C$DW$1329, DW_AT_TI_symbol_name("_big_values")
	.dwattr $C$DW$1329, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1329, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1330	.dwtag  DW_TAG_member
	.dwattr $C$DW$1330, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1330, DW_AT_name("count1")
	.dwattr $C$DW$1330, DW_AT_TI_symbol_name("_count1")
	.dwattr $C$DW$1330, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1330, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1331	.dwtag  DW_TAG_member
	.dwattr $C$DW$1331, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1331, DW_AT_name("global_gain")
	.dwattr $C$DW$1331, DW_AT_TI_symbol_name("_global_gain")
	.dwattr $C$DW$1331, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1331, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1332	.dwtag  DW_TAG_member
	.dwattr $C$DW$1332, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1332, DW_AT_name("scalefac_compress")
	.dwattr $C$DW$1332, DW_AT_TI_symbol_name("_scalefac_compress")
	.dwattr $C$DW$1332, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1332, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1333	.dwtag  DW_TAG_member
	.dwattr $C$DW$1333, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$1333, DW_AT_name("table_select")
	.dwattr $C$DW$1333, DW_AT_TI_symbol_name("_table_select")
	.dwattr $C$DW$1333, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$1333, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1334	.dwtag  DW_TAG_member
	.dwattr $C$DW$1334, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1334, DW_AT_name("region0_count")
	.dwattr $C$DW$1334, DW_AT_TI_symbol_name("_region0_count")
	.dwattr $C$DW$1334, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1334, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1335	.dwtag  DW_TAG_member
	.dwattr $C$DW$1335, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1335, DW_AT_name("region1_count")
	.dwattr $C$DW$1335, DW_AT_TI_symbol_name("_region1_count")
	.dwattr $C$DW$1335, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$1335, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1336	.dwtag  DW_TAG_member
	.dwattr $C$DW$1336, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1336, DW_AT_name("preflag")
	.dwattr $C$DW$1336, DW_AT_TI_symbol_name("_preflag")
	.dwattr $C$DW$1336, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1336, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1337	.dwtag  DW_TAG_member
	.dwattr $C$DW$1337, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1337, DW_AT_name("scalefac_scale")
	.dwattr $C$DW$1337, DW_AT_TI_symbol_name("_scalefac_scale")
	.dwattr $C$DW$1337, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$1337, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1338	.dwtag  DW_TAG_member
	.dwattr $C$DW$1338, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1338, DW_AT_name("count1table_select")
	.dwattr $C$DW$1338, DW_AT_TI_symbol_name("_count1table_select")
	.dwattr $C$DW$1338, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1338, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1339	.dwtag  DW_TAG_member
	.dwattr $C$DW$1339, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1339, DW_AT_name("part2_length")
	.dwattr $C$DW$1339, DW_AT_TI_symbol_name("_part2_length")
	.dwattr $C$DW$1339, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$1339, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1340	.dwtag  DW_TAG_member
	.dwattr $C$DW$1340, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1340, DW_AT_name("sfb_lmax")
	.dwattr $C$DW$1340, DW_AT_TI_symbol_name("_sfb_lmax")
	.dwattr $C$DW$1340, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$1340, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1341	.dwtag  DW_TAG_member
	.dwattr $C$DW$1341, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1341, DW_AT_name("address1")
	.dwattr $C$DW$1341, DW_AT_TI_symbol_name("_address1")
	.dwattr $C$DW$1341, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$1341, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1342	.dwtag  DW_TAG_member
	.dwattr $C$DW$1342, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1342, DW_AT_name("address2")
	.dwattr $C$DW$1342, DW_AT_TI_symbol_name("_address2")
	.dwattr $C$DW$1342, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1342, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1343	.dwtag  DW_TAG_member
	.dwattr $C$DW$1343, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1343, DW_AT_name("address3")
	.dwattr $C$DW$1343, DW_AT_TI_symbol_name("_address3")
	.dwattr $C$DW$1343, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$1343, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1344	.dwtag  DW_TAG_member
	.dwattr $C$DW$1344, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$1344, DW_AT_name("slen")
	.dwattr $C$DW$1344, DW_AT_TI_symbol_name("_slen")
	.dwattr $C$DW$1344, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$1344, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1345	.dwtag  DW_TAG_member
	.dwattr $C$DW$1345, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1345, DW_AT_name("quantizerStepSize")
	.dwattr $C$DW$1345, DW_AT_TI_symbol_name("_quantizerStepSize")
	.dwattr $C$DW$1345, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$1345, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$53

$C$DW$T$54	.dwtag  DW_TAG_typedef, DW_AT_name("gr_info")
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
$C$DW$T$93	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$T$93, DW_AT_address_class(0x17)

$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x17)
$C$DW$1346	.dwtag  DW_TAG_member
	.dwattr $C$DW$1346, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$1346, DW_AT_name("tt")
	.dwattr $C$DW$1346, DW_AT_TI_symbol_name("_tt")
	.dwattr $C$DW$1346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1346, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$55


$C$DW$T$56	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x17)
$C$DW$1347	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1347, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$56


$C$DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x17)
$C$DW$1348	.dwtag  DW_TAG_member
	.dwattr $C$DW$1348, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$1348, DW_AT_name("ch")
	.dwattr $C$DW$1348, DW_AT_TI_symbol_name("_ch")
	.dwattr $C$DW$1348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1348, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$57


$C$DW$T$59	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x17)
$C$DW$1349	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1349, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$59


$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x1d)
$C$DW$1350	.dwtag  DW_TAG_member
	.dwattr $C$DW$1350, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1350, DW_AT_name("private_bits")
	.dwattr $C$DW$1350, DW_AT_TI_symbol_name("_private_bits")
	.dwattr $C$DW$1350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1350, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1351	.dwtag  DW_TAG_member
	.dwattr $C$DW$1351, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1351, DW_AT_name("resvDrain")
	.dwattr $C$DW$1351, DW_AT_TI_symbol_name("_resvDrain")
	.dwattr $C$DW$1351, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1351, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1352	.dwtag  DW_TAG_member
	.dwattr $C$DW$1352, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$1352, DW_AT_name("scfsi")
	.dwattr $C$DW$1352, DW_AT_TI_symbol_name("_scfsi")
	.dwattr $C$DW$1352, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1352, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1353	.dwtag  DW_TAG_member
	.dwattr $C$DW$1353, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$1353, DW_AT_name("gr")
	.dwattr $C$DW$1353, DW_AT_TI_symbol_name("_gr")
	.dwattr $C$DW$1353, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1353, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$60

$C$DW$T$89	.dwtag  DW_TAG_typedef, DW_AT_name("shine_side_info_t")
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
$C$DW$T$98	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$T$98, DW_AT_address_class(0x17)

$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x06)
$C$DW$1354	.dwtag  DW_TAG_member
	.dwattr $C$DW$1354, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$1354, DW_AT_name("mpeg")
	.dwattr $C$DW$1354, DW_AT_TI_symbol_name("_mpeg")
	.dwattr $C$DW$1354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1354, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$62

$C$DW$T$99	.dwtag  DW_TAG_typedef, DW_AT_name("shine_config_t")
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
$C$DW$T$100	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
	.dwattr $C$DW$T$100, DW_AT_address_class(0x17)

$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x2a)
$C$DW$1355	.dwtag  DW_TAG_member
	.dwattr $C$DW$1355, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1355, DW_AT_name("l")
	.dwattr $C$DW$1355, DW_AT_TI_symbol_name("_l")
	.dwattr $C$DW$1355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1355, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$63

$C$DW$T$101	.dwtag  DW_TAG_typedef, DW_AT_name("shine_psy_xmin_t")
	.dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
$C$DW$T$102	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$T$102, DW_AT_address_class(0x17)

$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
$C$DW$1356	.dwtag  DW_TAG_member
	.dwattr $C$DW$1356, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$1356, DW_AT_name("region0_count")
	.dwattr $C$DW$1356, DW_AT_TI_symbol_name("_region0_count")
	.dwattr $C$DW$1356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1356, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1357	.dwtag  DW_TAG_member
	.dwattr $C$DW$1357, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$1357, DW_AT_name("region1_count")
	.dwattr $C$DW$1357, DW_AT_TI_symbol_name("_region1_count")
	.dwattr $C$DW$1357, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1357, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$65

$C$DW$1358	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1358, DW_AT_type(*$C$DW$T$65)
$C$DW$T$103	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$103, DW_AT_type(*$C$DW$1358)

$C$DW$T$104	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$104, DW_AT_byte_size(0x5c)
$C$DW$1359	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1359, DW_AT_upper_bound(0x16)
	.dwendtag $C$DW$T$104

$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_address_class(0x17)
$C$DW$1360	.dwtag  DW_TAG_TI_far_type
$C$DW$T$106	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$106, DW_AT_type(*$C$DW$1360)
$C$DW$T$107	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
	.dwattr $C$DW$T$107, DW_AT_address_class(0x17)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
$C$DW$T$31	.dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
$C$DW$T$71	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$71, DW_AT_address_class(0x17)

$C$DW$T$72	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$72, DW_AT_byte_size(0x02)
$C$DW$1361	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1361, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$72

$C$DW$T$152	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$152, DW_AT_address_class(0x17)
$C$DW$1362	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1362, DW_AT_type(*$C$DW$T$31)
$C$DW$T$166	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$166, DW_AT_type(*$C$DW$1362)

$C$DW$T$167	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$167, DW_AT_byte_size(0x04)
$C$DW$1363	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1363, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$167


$C$DW$T$168	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$168, DW_AT_byte_size(0x40)
$C$DW$1364	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1364, DW_AT_upper_bound(0x0f)
$C$DW$1365	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1365, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$168

$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
$C$DW$T$108	.dwtag  DW_TAG_typedef, DW_AT_name("size_t")
	.dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
$C$DW$T$50	.dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
	.dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)

$C$DW$T$51	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x03)
$C$DW$1366	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1366, DW_AT_upper_bound(0x02)
	.dwendtag $C$DW$T$51


$C$DW$T$52	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x04)
$C$DW$1367	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1367, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$52


$C$DW$T$58	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x04)
$C$DW$1368	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1368, DW_AT_upper_bound(0x00)
$C$DW$1369	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1369, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$58

$C$DW$T$66	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$66, DW_AT_address_class(0x17)

$C$DW$T$181	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$181, DW_AT_byte_size(0x5d98)
$C$DW$1370	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1370, DW_AT_upper_bound(0x5d97)
	.dwendtag $C$DW$T$181


$C$DW$T$182	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$182, DW_AT_byte_size(0x200)
$C$DW$1371	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1371, DW_AT_upper_bound(0x1ff)
	.dwendtag $C$DW$T$182

$C$DW$1372	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1372, DW_AT_type(*$C$DW$T$50)
$C$DW$T$68	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$1372)
$C$DW$T$69	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$69, DW_AT_address_class(0x17)

$C$DW$T$184	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$184, DW_AT_byte_size(0x04)
$C$DW$1373	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1373, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$184


$C$DW$T$185	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$185, DW_AT_byte_size(0x09)
$C$DW$1374	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1374, DW_AT_upper_bound(0x08)
	.dwendtag $C$DW$T$185


$C$DW$T$186	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$186, DW_AT_byte_size(0x10)
$C$DW$1375	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1375, DW_AT_upper_bound(0x0f)
	.dwendtag $C$DW$T$186


$C$DW$T$187	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$187, DW_AT_byte_size(0x24)
$C$DW$1376	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1376, DW_AT_upper_bound(0x23)
	.dwendtag $C$DW$T$187


$C$DW$T$188	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$188, DW_AT_byte_size(0x40)
$C$DW$1377	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1377, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$188


$C$DW$T$189	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$189, DW_AT_byte_size(0x100)
$C$DW$1378	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1378, DW_AT_upper_bound(0xff)
	.dwendtag $C$DW$T$189

$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
$C$DW$T$20	.dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
$C$DW$T$23	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$23, DW_AT_address_class(0x17)

$C$DW$T$24	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x100)
$C$DW$1379	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1379, DW_AT_upper_bound(0x7f)
	.dwendtag $C$DW$T$24


$C$DW$T$25	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x190)
$C$DW$1380	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1380, DW_AT_upper_bound(0xc7)
	.dwendtag $C$DW$T$25


$C$DW$T$33	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x2c)
$C$DW$1381	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1381, DW_AT_upper_bound(0x15)
	.dwendtag $C$DW$T$33


$C$DW$T$34	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x2c)
$C$DW$1382	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1382, DW_AT_upper_bound(0x00)
$C$DW$1383	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1383, DW_AT_upper_bound(0x15)
	.dwendtag $C$DW$T$34


$C$DW$T$35	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x2c)
$C$DW$1384	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1384, DW_AT_upper_bound(0x00)
$C$DW$1385	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1385, DW_AT_upper_bound(0x00)
$C$DW$1386	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1386, DW_AT_upper_bound(0x15)
	.dwendtag $C$DW$T$35


$C$DW$T$36	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
$C$DW$1387	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1387, DW_AT_upper_bound(0x02)
	.dwendtag $C$DW$T$36


$C$DW$T$37	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x4e)
$C$DW$1388	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1388, DW_AT_upper_bound(0x0c)
$C$DW$1389	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1389, DW_AT_upper_bound(0x02)
	.dwendtag $C$DW$T$37


$C$DW$T$38	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x4e)
$C$DW$1390	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1390, DW_AT_upper_bound(0x00)
$C$DW$1391	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1391, DW_AT_upper_bound(0x0c)
$C$DW$1392	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1392, DW_AT_upper_bound(0x02)
	.dwendtag $C$DW$T$38


$C$DW$T$39	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x4e)
$C$DW$1393	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1393, DW_AT_upper_bound(0x00)
$C$DW$1394	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1394, DW_AT_upper_bound(0x00)
$C$DW$1395	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1395, DW_AT_upper_bound(0x0c)
$C$DW$1396	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1396, DW_AT_upper_bound(0x02)
	.dwendtag $C$DW$T$39


$C$DW$T$41	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x48)
$C$DW$1397	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1397, DW_AT_upper_bound(0x23)
	.dwendtag $C$DW$T$41


$C$DW$T$42	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x510)
$C$DW$1398	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1398, DW_AT_upper_bound(0x11)
$C$DW$1399	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1399, DW_AT_upper_bound(0x23)
	.dwendtag $C$DW$T$42


$C$DW$T$44	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
$C$DW$1400	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1400, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$44


$C$DW$T$45	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x80)
$C$DW$1401	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1401, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$45


$C$DW$T$46	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x1000)
$C$DW$1402	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1402, DW_AT_upper_bound(0x1f)
$C$DW$1403	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1403, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$46


$C$DW$T$47	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x400)
$C$DW$1404	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1404, DW_AT_upper_bound(0x1ff)
	.dwendtag $C$DW$T$47


$C$DW$T$48	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x400)
$C$DW$1405	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1405, DW_AT_upper_bound(0x00)
$C$DW$1406	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1406, DW_AT_upper_bound(0x1ff)
	.dwendtag $C$DW$T$48


$C$DW$T$82	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x480)
$C$DW$1407	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1407, DW_AT_upper_bound(0x23f)
	.dwendtag $C$DW$T$82


$C$DW$T$83	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$83, DW_AT_byte_size(0x480)
$C$DW$1408	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1408, DW_AT_upper_bound(0x00)
$C$DW$1409	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1409, DW_AT_upper_bound(0x23f)
	.dwendtag $C$DW$T$83


$C$DW$T$84	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$84, DW_AT_byte_size(0x480)
$C$DW$1410	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1410, DW_AT_upper_bound(0x00)
$C$DW$1411	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1411, DW_AT_upper_bound(0x00)
$C$DW$1412	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1412, DW_AT_upper_bound(0x23f)
	.dwendtag $C$DW$T$84


$C$DW$T$85	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$85, DW_AT_byte_size(0x40)
$C$DW$1413	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1413, DW_AT_upper_bound(0x1f)
	.dwendtag $C$DW$T$85


$C$DW$T$86	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$86, DW_AT_byte_size(0x480)
$C$DW$1414	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1414, DW_AT_upper_bound(0x11)
$C$DW$1415	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1415, DW_AT_upper_bound(0x1f)
	.dwendtag $C$DW$T$86


$C$DW$T$87	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$87, DW_AT_byte_size(0x900)
$C$DW$1416	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1416, DW_AT_upper_bound(0x01)
$C$DW$1417	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1417, DW_AT_upper_bound(0x11)
$C$DW$1418	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1418, DW_AT_upper_bound(0x1f)
	.dwendtag $C$DW$T$87


$C$DW$T$88	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$88, DW_AT_byte_size(0x900)
$C$DW$1419	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1419, DW_AT_upper_bound(0x00)
$C$DW$1420	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1420, DW_AT_upper_bound(0x01)
$C$DW$1421	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1421, DW_AT_upper_bound(0x11)
$C$DW$1422	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1422, DW_AT_upper_bound(0x1f)
	.dwendtag $C$DW$T$88


$C$DW$T$243	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$243, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$243, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$243, DW_AT_byte_size(0x08)
$C$DW$1423	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1423, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$243


$C$DW$T$244	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$244, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$244, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$244, DW_AT_byte_size(0x04)
$C$DW$1424	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1424, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$244


$C$DW$T$246	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$246, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$246, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$246, DW_AT_byte_size(0x24)
$C$DW$1425	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1425, DW_AT_upper_bound(0x11)
	.dwendtag $C$DW$T$246

$C$DW$T$247	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$247, DW_AT_type(*$C$DW$T$246)
	.dwattr $C$DW$T$247, DW_AT_address_class(0x17)
$C$DW$1426	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1426, DW_AT_type(*$C$DW$T$20)
$C$DW$T$158	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$158, DW_AT_type(*$C$DW$1426)

$C$DW$T$248	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$T$248, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$248, DW_AT_byte_size(0x20)
$C$DW$1427	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1427, DW_AT_upper_bound(0x0f)
	.dwendtag $C$DW$T$248


$C$DW$T$249	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$T$249, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$249, DW_AT_byte_size(0x12)
$C$DW$1428	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1428, DW_AT_upper_bound(0x08)
	.dwendtag $C$DW$T$249


$C$DW$T$250	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$250, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$T$250, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$250, DW_AT_byte_size(0x2e)
$C$DW$1429	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1429, DW_AT_upper_bound(0x16)
	.dwendtag $C$DW$T$250


$C$DW$T$251	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$251, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$T$251, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$251, DW_AT_byte_size(0x19e)
$C$DW$1430	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1430, DW_AT_upper_bound(0x08)
$C$DW$1431	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1431, DW_AT_upper_bound(0x16)
	.dwendtag $C$DW$T$251


$C$DW$T$253	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$253, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$T$253, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$253, DW_AT_byte_size(0x400)
$C$DW$1432	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1432, DW_AT_upper_bound(0x1ff)
	.dwendtag $C$DW$T$253

$C$DW$T$254	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$254, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$T$254, DW_AT_address_class(0x17)
$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
$C$DW$T$64	.dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
$C$DW$T$155	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$T$155, DW_AT_address_class(0x17)
$C$DW$1433	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1433, DW_AT_type(*$C$DW$T$64)
$C$DW$T$255	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$255, DW_AT_type(*$C$DW$1433)
$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
	.dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
	.dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
	.dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
	.dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x02)

$C$DW$T$27	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x2a)
$C$DW$1434	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1434, DW_AT_upper_bound(0x14)
	.dwendtag $C$DW$T$27


$C$DW$T$28	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x2a)
$C$DW$1435	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1435, DW_AT_upper_bound(0x00)
$C$DW$1436	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1436, DW_AT_upper_bound(0x14)
	.dwendtag $C$DW$T$28


$C$DW$T$29	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x2a)
$C$DW$1437	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1437, DW_AT_upper_bound(0x00)
$C$DW$1438	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1438, DW_AT_upper_bound(0x00)
$C$DW$1439	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1439, DW_AT_upper_bound(0x14)
	.dwendtag $C$DW$T$29


$C$DW$T$74	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$74, DW_AT_byte_size(0x02)
$C$DW$1440	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1440, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$74


$C$DW$T$75	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x02)
$C$DW$1441	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1441, DW_AT_upper_bound(0x00)
$C$DW$1442	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1442, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$75

$C$DW$T$239	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$239, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$T$239, DW_AT_address_class(0x17)
$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
$C$DW$T$267	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$267, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$267, DW_AT_name("signed char")
	.dwattr $C$DW$T$267, DW_AT_byte_size(0x01)

$C$DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$67, DW_AT_name("bit_stream_struc")
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x08)
$C$DW$1443	.dwtag  DW_TAG_member
	.dwattr $C$DW$1443, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1443, DW_AT_name("data")
	.dwattr $C$DW$1443, DW_AT_TI_symbol_name("_data")
	.dwattr $C$DW$1443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1443, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1444	.dwtag  DW_TAG_member
	.dwattr $C$DW$1444, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$1444, DW_AT_name("cache")
	.dwattr $C$DW$1444, DW_AT_TI_symbol_name("_cache")
	.dwattr $C$DW$1444, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1444, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1445	.dwtag  DW_TAG_member
	.dwattr $C$DW$1445, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1445, DW_AT_name("cache_bits")
	.dwattr $C$DW$1445, DW_AT_TI_symbol_name("_cache_bits")
	.dwattr $C$DW$1445, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1445, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1446	.dwtag  DW_TAG_member
	.dwattr $C$DW$1446, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1446, DW_AT_name("data_size")
	.dwattr $C$DW$1446, DW_AT_TI_symbol_name("_data_size")
	.dwattr $C$DW$1446, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1446, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1447	.dwtag  DW_TAG_member
	.dwattr $C$DW$1447, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1447, DW_AT_name("data_position")
	.dwattr $C$DW$1447, DW_AT_TI_symbol_name("_data_position")
	.dwattr $C$DW$1447, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$1447, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$67

$C$DW$T$78	.dwtag  DW_TAG_typedef, DW_AT_name("bitstream_t")
	.dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
$C$DW$T$128	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$128, DW_AT_address_class(0x17)

$C$DW$T$21	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$21, DW_AT_name("emph")
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
$C$DW$1448	.dwtag  DW_TAG_enumerator, DW_AT_name("NONE"), DW_AT_const_value(0x00)
$C$DW$1449	.dwtag  DW_TAG_enumerator, DW_AT_name("MU50_15"), DW_AT_const_value(0x01)
$C$DW$1450	.dwtag  DW_TAG_enumerator, DW_AT_name("CITT"), DW_AT_const_value(0x03)
	.dwendtag $C$DW$T$21


$C$DW$T$70	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$70, DW_AT_name("huffcodetab")
	.dwattr $C$DW$T$70, DW_AT_byte_size(0x0c)
$C$DW$1451	.dwtag  DW_TAG_member
	.dwattr $C$DW$1451, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$1451, DW_AT_name("xlen")
	.dwattr $C$DW$1451, DW_AT_TI_symbol_name("_xlen")
	.dwattr $C$DW$1451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1451, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1452	.dwtag  DW_TAG_member
	.dwattr $C$DW$1452, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$1452, DW_AT_name("ylen")
	.dwattr $C$DW$1452, DW_AT_TI_symbol_name("_ylen")
	.dwattr $C$DW$1452, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1452, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1453	.dwtag  DW_TAG_member
	.dwattr $C$DW$1453, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$1453, DW_AT_name("linbits")
	.dwattr $C$DW$1453, DW_AT_TI_symbol_name("_linbits")
	.dwattr $C$DW$1453, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1453, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1454	.dwtag  DW_TAG_member
	.dwattr $C$DW$1454, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$1454, DW_AT_name("linmax")
	.dwattr $C$DW$1454, DW_AT_TI_symbol_name("_linmax")
	.dwattr $C$DW$1454, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1454, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1455	.dwtag  DW_TAG_member
	.dwattr $C$DW$1455, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$1455, DW_AT_name("table")
	.dwattr $C$DW$1455, DW_AT_TI_symbol_name("_table")
	.dwattr $C$DW$1455, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1455, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1456	.dwtag  DW_TAG_member
	.dwattr $C$DW$1456, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$1456, DW_AT_name("hlen")
	.dwattr $C$DW$1456, DW_AT_TI_symbol_name("_hlen")
	.dwattr $C$DW$1456, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1456, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$70

$C$DW$1457	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1457, DW_AT_type(*$C$DW$T$70)
$C$DW$T$136	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$136, DW_AT_type(*$C$DW$1457)
$C$DW$T$137	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$T$137, DW_AT_address_class(0x17)

$C$DW$T$269	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$269, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$T$269, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$269, DW_AT_byte_size(0x198)
$C$DW$1458	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1458, DW_AT_upper_bound(0x21)
	.dwendtag $C$DW$T$269


$C$DW$T$19	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$19, DW_AT_name("modes")
	.dwattr $C$DW$T$19, DW_AT_byte_size(0x01)
$C$DW$1459	.dwtag  DW_TAG_enumerator, DW_AT_name("STEREO"), DW_AT_const_value(0x00)
$C$DW$1460	.dwtag  DW_TAG_enumerator, DW_AT_name("JOINT_STEREO"), DW_AT_const_value(0x01)
$C$DW$1461	.dwtag  DW_TAG_enumerator, DW_AT_name("DUAL_CHANNEL"), DW_AT_const_value(0x02)
$C$DW$1462	.dwtag  DW_TAG_enumerator, DW_AT_name("MONO"), DW_AT_const_value(0x03)
	.dwendtag $C$DW$T$19


$C$DW$T$90	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$90, DW_AT_name("shine_global_flags")
	.dwattr $C$DW$T$90, DW_AT_byte_size(0x2e8e)
$C$DW$1463	.dwtag  DW_TAG_member
	.dwattr $C$DW$1463, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$1463, DW_AT_name("buffer")
	.dwattr $C$DW$1463, DW_AT_TI_symbol_name("_buffer")
	.dwattr $C$DW$1463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1463, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1464	.dwtag  DW_TAG_member
	.dwattr $C$DW$1464, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1464, DW_AT_name("l3loop")
	.dwattr $C$DW$1464, DW_AT_TI_symbol_name("_l3loop")
	.dwattr $C$DW$1464, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1464, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1465	.dwtag  DW_TAG_member
	.dwattr $C$DW$1465, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$1465, DW_AT_name("pe")
	.dwattr $C$DW$1465, DW_AT_TI_symbol_name("_pe")
	.dwattr $C$DW$1465, DW_AT_data_member_location[DW_OP_plus_uconst 0x296]
	.dwattr $C$DW$1465, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1466	.dwtag  DW_TAG_member
	.dwattr $C$DW$1466, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$1466, DW_AT_name("ratio")
	.dwattr $C$DW$1466, DW_AT_TI_symbol_name("_ratio")
	.dwattr $C$DW$1466, DW_AT_data_member_location[DW_OP_plus_uconst 0x298]
	.dwattr $C$DW$1466, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1467	.dwtag  DW_TAG_member
	.dwattr $C$DW$1467, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1467, DW_AT_name("mpeg")
	.dwattr $C$DW$1467, DW_AT_TI_symbol_name("_mpeg")
	.dwattr $C$DW$1467, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c2]
	.dwattr $C$DW$1467, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1468	.dwtag  DW_TAG_member
	.dwattr $C$DW$1468, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$1468, DW_AT_name("bs")
	.dwattr $C$DW$1468, DW_AT_TI_symbol_name("_bs")
	.dwattr $C$DW$1468, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d4]
	.dwattr $C$DW$1468, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1469	.dwtag  DW_TAG_member
	.dwattr $C$DW$1469, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$1469, DW_AT_name("scalefactor")
	.dwattr $C$DW$1469, DW_AT_TI_symbol_name("_scalefactor")
	.dwattr $C$DW$1469, DW_AT_data_member_location[DW_OP_plus_uconst 0x2dc]
	.dwattr $C$DW$1469, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1470	.dwtag  DW_TAG_member
	.dwattr $C$DW$1470, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1470, DW_AT_name("mdct")
	.dwattr $C$DW$1470, DW_AT_TI_symbol_name("_mdct")
	.dwattr $C$DW$1470, DW_AT_data_member_location[DW_OP_plus_uconst 0x356]
	.dwattr $C$DW$1470, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1471	.dwtag  DW_TAG_member
	.dwattr $C$DW$1471, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$1471, DW_AT_name("subband")
	.dwattr $C$DW$1471, DW_AT_TI_symbol_name("_subband")
	.dwattr $C$DW$1471, DW_AT_data_member_location[DW_OP_plus_uconst 0x866]
	.dwattr $C$DW$1471, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1472	.dwtag  DW_TAG_member
	.dwattr $C$DW$1472, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$1472, DW_AT_name("l3_enc")
	.dwattr $C$DW$1472, DW_AT_TI_symbol_name("_l3_enc")
	.dwattr $C$DW$1472, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c68]
	.dwattr $C$DW$1472, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1473	.dwtag  DW_TAG_member
	.dwattr $C$DW$1473, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$1473, DW_AT_name("l3_sb_sample")
	.dwattr $C$DW$1473, DW_AT_TI_symbol_name("_l3_sb_sample")
	.dwattr $C$DW$1473, DW_AT_data_member_location[DW_OP_plus_uconst 0x20e8]
	.dwattr $C$DW$1473, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1474	.dwtag  DW_TAG_member
	.dwattr $C$DW$1474, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$1474, DW_AT_name("mdct_freq")
	.dwattr $C$DW$1474, DW_AT_TI_symbol_name("_mdct_freq")
	.dwattr $C$DW$1474, DW_AT_data_member_location[DW_OP_plus_uconst 0x29e8]
	.dwattr $C$DW$1474, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1475	.dwtag  DW_TAG_member
	.dwattr $C$DW$1475, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1475, DW_AT_name("sideinfo_len")
	.dwattr $C$DW$1475, DW_AT_TI_symbol_name("_sideinfo_len")
	.dwattr $C$DW$1475, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e68]
	.dwattr $C$DW$1475, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1476	.dwtag  DW_TAG_member
	.dwattr $C$DW$1476, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1476, DW_AT_name("mean_bits")
	.dwattr $C$DW$1476, DW_AT_TI_symbol_name("_mean_bits")
	.dwattr $C$DW$1476, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e6a]
	.dwattr $C$DW$1476, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1477	.dwtag  DW_TAG_member
	.dwattr $C$DW$1477, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1477, DW_AT_name("ResvSize")
	.dwattr $C$DW$1477, DW_AT_TI_symbol_name("_ResvSize")
	.dwattr $C$DW$1477, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e6c]
	.dwattr $C$DW$1477, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1478	.dwtag  DW_TAG_member
	.dwattr $C$DW$1478, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1478, DW_AT_name("ResvMax")
	.dwattr $C$DW$1478, DW_AT_TI_symbol_name("_ResvMax")
	.dwattr $C$DW$1478, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e6e]
	.dwattr $C$DW$1478, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1479	.dwtag  DW_TAG_member
	.dwattr $C$DW$1479, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$1479, DW_AT_name("side_info")
	.dwattr $C$DW$1479, DW_AT_TI_symbol_name("_side_info")
	.dwattr $C$DW$1479, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e70]
	.dwattr $C$DW$1479, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$90

$C$DW$T$120	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$T$120, DW_AT_address_class(0x17)
$C$DW$T$121	.dwtag  DW_TAG_typedef, DW_AT_name("shine_t")
	.dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
	.dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
$C$DW$T$124	.dwtag  DW_TAG_typedef, DW_AT_name("shine_global_config")
	.dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
$C$DW$T$125	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
	.dwattr $C$DW$T$125, DW_AT_address_class(0x17)
	.dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

$C$DW$CIE	.dwcie 91
	.dwcfi	cfa_register, 36
	.dwcfi	cfa_offset, 0
	.dwcfi	undefined, 0
	.dwcfi	undefined, 1
	.dwcfi	undefined, 2
	.dwcfi	undefined, 3
	.dwcfi	undefined, 4
	.dwcfi	undefined, 5
	.dwcfi	undefined, 6
	.dwcfi	undefined, 7
	.dwcfi	undefined, 8
	.dwcfi	undefined, 9
	.dwcfi	undefined, 10
	.dwcfi	undefined, 11
	.dwcfi	undefined, 12
	.dwcfi	undefined, 13
	.dwcfi	same_value, 14
	.dwcfi	same_value, 15
	.dwcfi	undefined, 16
	.dwcfi	undefined, 17
	.dwcfi	undefined, 18
	.dwcfi	undefined, 19
	.dwcfi	undefined, 20
	.dwcfi	undefined, 21
	.dwcfi	undefined, 22
	.dwcfi	undefined, 23
	.dwcfi	undefined, 24
	.dwcfi	undefined, 25
	.dwcfi	same_value, 26
	.dwcfi	same_value, 27
	.dwcfi	same_value, 28
	.dwcfi	same_value, 29
	.dwcfi	same_value, 30
	.dwcfi	same_value, 31
	.dwcfi	undefined, 32
	.dwcfi	undefined, 33
	.dwcfi	undefined, 34
	.dwcfi	undefined, 35
	.dwcfi	undefined, 36
	.dwcfi	undefined, 37
	.dwcfi	undefined, 38
	.dwcfi	undefined, 39
	.dwcfi	undefined, 40
	.dwcfi	undefined, 41
	.dwcfi	undefined, 42
	.dwcfi	undefined, 43
	.dwcfi	undefined, 44
	.dwcfi	undefined, 45
	.dwcfi	undefined, 46
	.dwcfi	undefined, 47
	.dwcfi	undefined, 48
	.dwcfi	undefined, 49
	.dwcfi	undefined, 50
	.dwcfi	undefined, 51
	.dwcfi	undefined, 52
	.dwcfi	undefined, 53
	.dwcfi	undefined, 54
	.dwcfi	undefined, 55
	.dwcfi	undefined, 56
	.dwcfi	undefined, 57
	.dwcfi	undefined, 58
	.dwcfi	undefined, 59
	.dwcfi	undefined, 60
	.dwcfi	undefined, 61
	.dwcfi	undefined, 62
	.dwcfi	undefined, 63
	.dwcfi	undefined, 64
	.dwcfi	undefined, 65
	.dwcfi	undefined, 66
	.dwcfi	undefined, 67
	.dwcfi	undefined, 68
	.dwcfi	undefined, 69
	.dwcfi	undefined, 70
	.dwcfi	undefined, 71
	.dwcfi	undefined, 72
	.dwcfi	undefined, 73
	.dwcfi	undefined, 74
	.dwcfi	undefined, 75
	.dwcfi	undefined, 76
	.dwcfi	undefined, 77
	.dwcfi	undefined, 78
	.dwcfi	undefined, 79
	.dwcfi	undefined, 80
	.dwcfi	undefined, 81
	.dwcfi	undefined, 82
	.dwcfi	undefined, 83
	.dwcfi	undefined, 84
	.dwcfi	undefined, 85
	.dwcfi	undefined, 86
	.dwcfi	undefined, 87
	.dwcfi	undefined, 88
	.dwcfi	undefined, 89
	.dwcfi	undefined, 90
	.dwcfi	undefined, 91
	.dwendentry

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

$C$DW$1480	.dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC0")
	.dwattr $C$DW$1480, DW_AT_location[DW_OP_reg0]
$C$DW$1481	.dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC0")
	.dwattr $C$DW$1481, DW_AT_location[DW_OP_reg1]
$C$DW$1482	.dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC0_G")
	.dwattr $C$DW$1482, DW_AT_location[DW_OP_reg2]
$C$DW$1483	.dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC1")
	.dwattr $C$DW$1483, DW_AT_location[DW_OP_reg3]
$C$DW$1484	.dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC1")
	.dwattr $C$DW$1484, DW_AT_location[DW_OP_reg4]
$C$DW$1485	.dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC1_G")
	.dwattr $C$DW$1485, DW_AT_location[DW_OP_reg5]
