;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
;* Date/Time created: Fri Jul 05 14:11:14 2013                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_2_1 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.model call=c55_std
	.model mem=large
	.noremark 5503  ; code avoids SE CPU_84 MMR write
	.noremark 5505  ; code avoids SE CPU_84 MMR read
	.noremark 5673  ; code avoids SE CPU_89
	.noremark 5684  ; code avoids SE CPU_116 indirect write
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Optimized TI Debug Information                       *

	.dwattr $C$DW$450, DW_AT_high_pc($C$DW$L$_main$42$E)
$C$DW$451	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$451, DW_AT_low_pc($C$DW$L$_main$44$B)
	.dwattr $C$DW$451, DW_AT_high_pc($C$DW$L$_main$44$E)
$C$DW$452	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$452, DW_AT_low_pc($C$DW$L$_main$46$B)
	.dwattr $C$DW$452, DW_AT_high_pc($C$DW$L$_main$46$E)

$C$DW$453	.dwtag  DW_TAG_TI_loop
	.dwattr $C$DW$453, DW_AT_name("M:\TI_MAS_VOLIB_2_1_0_1_bldforge\dsps_gtmas\ti\mas\cid\test\ccsProjects\test_rel_c5510_C55L_COFF\Debug\cidsim.asm:$C$L77:2:1373047874")
	.dwattr $C$DW$453, DW_AT_TI_begin_file("M:/TI_MAS_VOLIB_2_1_0_1_bldforge/dsps_gtmas/ti/mas/cid/test/src/cidsim.c")
	.dwattr $C$DW$453, DW_AT_TI_begin_line(0x44b)
	.dwattr $C$DW$453, DW_AT_TI_end_line(0x44d)
$C$DW$454	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$454, DW_AT_low_pc($C$DW$L$_main$43$B)
	.dwattr $C$DW$454, DW_AT_high_pc($C$DW$L$_main$43$E)
	.dwendtag $C$DW$453


$C$DW$455	.dwtag  DW_TAG_TI_loop
	.dwattr $C$DW$455, DW_AT_name("M:\TI_MAS_VOLIB_2_1_0_1_bldforge\dsps_gtmas\ti\mas\cid\test\ccsProjects\test_rel_c5510_C55L_COFF\Debug\cidsim.asm:$C$L79:2:1373047874")
	.dwattr $C$DW$455, DW_AT_TI_begin_file("M:/TI_MAS_VOLIB_2_1_0_1_bldforge/dsps_gtmas/ti/mas/cid/test/src/cidsim.c")
	.dwattr $C$DW$455, DW_AT_TI_begin_line(0x45c)
	.dwattr $C$DW$455, DW_AT_TI_end_line(0x45e)
$C$DW$456	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$456, DW_AT_low_pc($C$DW$L$_main$45$B)
	.dwattr $C$DW$456, DW_AT_high_pc($C$DW$L$_main$45$E)
	.dwendtag $C$DW$455

	.dwendtag $C$DW$416


$C$DW$457	.dwtag  DW_TAG_TI_loop
	.dwattr $C$DW$457, DW_AT_name("M:\TI_MAS_VOLIB_2_1_0_1_bldforge\dsps_gtmas\ti\mas\cid\test\ccsProjects\test_rel_c5510_C55L_COFF\Debug\cidsim.asm:$C$L56:1:1373047874")
	.dwattr $C$DW$457, DW_AT_TI_begin_file("M:/TI_MAS_VOLIB_2_1_0_1_bldforge/dsps_gtmas/ti/mas/cid/test/src/cidsim.c")
	.dwattr $C$DW$457, DW_AT_TI_begin_line(0x3d5)
	.dwattr $C$DW$457, DW_AT_TI_end_line(0x3d8)
$C$DW$458	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$458, DW_AT_low_pc($C$DW$L$_main$8$B)
	.dwattr $C$DW$458, DW_AT_high_pc($C$DW$L$_main$8$E)
	.dwendtag $C$DW$457

	.dwattr $C$DW$365, DW_AT_TI_end_file("M:/TI_MAS_VOLIB_2_1_0_1_bldforge/dsps_gtmas/ti/mas/cid/test/src/cidsim.c")
	.dwattr $C$DW$365, DW_AT_TI_end_line(0x469)
	.dwattr $C$DW$365, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$365

;*******************************************************************************
;* FLOATING-POINT CONSTANTS                                                    *
;*******************************************************************************
	.sect	".const"
	.align	2
$C$FL1:	.xlong	0x45fa0000
	.align	2
$C$FL2:	.xlong	0x49742400
;*******************************************************************************
;* FAR STRINGS                                                                 *
;*******************************************************************************
	.sect	".const:.string"
	.align	2
$C$FSL1:	.string	"ID=%d %s",10,0
	.align	2
$C$FSL2:	.string	"w",0
	.align	2
$C$FSL3:	.string	"profile.txt",0
	.align	2
$C$FSL4:	.string	"Unable to open profiling file",0
	.align	2
$C$FSL5:	.string	"  %6.2f",0
	.align	2
$C$FSL6:	.string	"  %6.2f",10,0
	.align	2
$C$FSL7:	.string	"siuCidRptIn(): ID=%d rcode=%d length=%d word length=%d",10,0
	.align	2
$C$FSL8:	.string	"msg[%d]=0x%x",10,0
	.align	2
$C$FSL9:	.string	"Error in GetSizes",0
	.align	2
$C$FSL10:	.string	"No memory",0
	.align	2
$C$FSL11:	.string	"Errors in cidNew",0
	.align	2
$C$FSL12:	.string	"Error in cidOpen",0
	.align	2
$C$FSL13:	.string	"Error in sgnCreate",0
	.align	2
$C$FSL14:	.string	"START TEST",10,0
	.align	2
$C$FSL15:	.string	"Can not allocate memory for frame",0
	.align	2
$C$FSL16:	.string	"Error in cidCreate",0
	.align	2
$C$FSL17:	.string	"Error in cidBind",0
	.align	2
$C$FSL18:	.string	"Channel 1 closed and deleted",10,0
	.align	2
$C$FSL19:	.string	"CID Standard: US",10,0
	.align	2
$C$FSL20:	.string	"CID Standard: Japan",10,0
	.align	2
$C$FSL21:	.string	"CID Standard: Europe",10,0
	.align	2
$C$FSL22:	.string	"CID Standard: China",10,0
	.align	2
$C$FSL23:	.string	"CID Standard: UK",10,0
	.align	2
$C$FSL24:	.string	"CID Standard: Australia",10,0
	.align	2
$C$FSL25:	.string	"Send CID control message %d to channel 1",10,0
	.align	2
$C$FSL26:	.string	"Channel 2 closed and deleted",10,0
	.align	2
$C$FSL27:	.string	"Send CID control message %d to channel 2",10,0
;******************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                              *
;******************************************************************************
	.global	_fclose
	.global	_fopen
	.global	_fflush
	.global	_fprintf
	.global	_printf
	.global	_malloc
	.global	_free
	.global	_exit
	.global	_cidCreate
	.global	_cidGetSizes
	.global	_cidNew
	.global	_cidClose
	.global	_cidDelete
	.global	_cidBind
	.global	_cidOpen
	.global	_cidControl
	.global	_cidReceiveIn
	.global	_cidSendIn
	.global	_cidModulator
	.global	_cidModCtrl
	.global	_cidDetect
	.global	_cidDemodCtrl
	.global	_cidDtctFsmNtt
	.global	_cidGnrtFsmNtt
	.global	_cidDtctFsmUsEtsi
	.global	_cidGnrtFsmUsEtsi
	.global	_wngInit
	.global	_wngGenNoiseSample
	.global	_sgnGetSizes
	.global	_sgnControl
	.global	_sgnGenerateFrame
	.global	_sgnInit
	.global	__ftable
	.global	__divd
	.global	__fltlid
	.global	__mpyd
	.global	__fltid

;*******************************************************************************
;* TYPE INFORMATION                                                            *
;*******************************************************************************

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x0c)
$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$459, DW_AT_name("fd")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("_fd")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$460, DW_AT_name("buf")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("_buf")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$461, DW_AT_name("pos")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("_pos")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$462, DW_AT_name("bufend")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("_bufend")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$463, DW_AT_name("buff_stop")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("_buff_stop")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$464, DW_AT_name("flags")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("_flags")
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$20

$C$DW$T$87	.dwtag  DW_TAG_typedef, DW_AT_name("FILE")
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
$C$DW$T$88	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$T$88, DW_AT_address_class(0x17)

$C$DW$T$102	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$102, DW_AT_byte_size(0x78)
$C$DW$465	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$465, DW_AT_upper_bound(0x09)
	.dwendtag $C$DW$T$102


$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
$C$DW$466	.dwtag  DW_TAG_member
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$466, DW_AT_name("debugInfo")
	.dwattr $C$DW$466, DW_AT_TI_symbol_name("_debugInfo")
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$467, DW_AT_name("reportOutFcn")
	.dwattr $C$DW$467, DW_AT_TI_symbol_name("_reportOutFcn")
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$468, DW_AT_name("maxSamplesPerFrame")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("_maxSamplesPerFrame")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$469, DW_AT_name("maxFragmentSize")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("_maxFragmentSize")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$33

$C$DW$T$103	.dwtag  DW_TAG_typedef, DW_AT_name("cidCreateConfig_t")
	.dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
$C$DW$T$104	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$T$104, DW_AT_address_class(0x17)

$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$470, DW_AT_name("mclass")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("_mclass")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$471	.dwtag  DW_TAG_member
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$471, DW_AT_name("log2align")
	.dwattr $C$DW$471, DW_AT_TI_symbol_name("_log2align")
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$472, DW_AT_name("size")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("_size")
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$473, DW_AT_name("volat")
	.dwattr $C$DW$473, DW_AT_TI_symbol_name("_volat")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$474, DW_AT_name("base")
	.dwattr $C$DW$474, DW_AT_TI_symbol_name("_base")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$38

$C$DW$T$84	.dwtag  DW_TAG_typedef, DW_AT_name("ecomemBuffer_t")
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
$C$DW$T$85	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$T$85, DW_AT_address_class(0x17)
$C$DW$475	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$84)
$C$DW$T$105	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$105, DW_AT_type(*$C$DW$475)
$C$DW$T$106	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$T$106, DW_AT_address_class(0x17)
$C$DW$T$107	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
	.dwattr $C$DW$T$107, DW_AT_address_class(0x17)

$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
$C$DW$476	.dwtag  DW_TAG_member
	.dwattr $C$DW$476, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$476, DW_AT_name("ID")
	.dwattr $C$DW$476, DW_AT_TI_symbol_name("_ID")
	.dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$39

$C$DW$T$108	.dwtag  DW_TAG_typedef, DW_AT_name("cidNewConfig_t")
	.dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
$C$DW$T$109	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$T$109, DW_AT_address_class(0x17)

$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x06)
$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$477, DW_AT_name("marks_gain")
	.dwattr $C$DW$477, DW_AT_TI_symbol_name("_marks_gain")
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$478, DW_AT_name("msg_type")
	.dwattr $C$DW$478, DW_AT_TI_symbol_name("_msg_type")
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$479, DW_AT_name("msg_length")
	.dwattr $C$DW$479, DW_AT_TI_symbol_name("_msg_length")
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$480	.dwtag  DW_TAG_member
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$480, DW_AT_name("msg")
	.dwattr $C$DW$480, DW_AT_TI_symbol_name("_msg")
	.dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$40


$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$481, DW_AT_name("fragment_offset")
	.dwattr $C$DW$481, DW_AT_TI_symbol_name("_fragment_offset")
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$482	.dwtag  DW_TAG_member
	.dwattr $C$DW$482, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$482, DW_AT_name("fragment_size")
	.dwattr $C$DW$482, DW_AT_TI_symbol_name("_fragment_size")
	.dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$483	.dwtag  DW_TAG_member
	.dwattr $C$DW$483, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$483, DW_AT_name("msg")
	.dwattr $C$DW$483, DW_AT_TI_symbol_name("_msg")
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$41


$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x03)
$C$DW$484	.dwtag  DW_TAG_member
	.dwattr $C$DW$484, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$484, DW_AT_name("timeout")
	.dwattr $C$DW$484, DW_AT_TI_symbol_name("_timeout")
	.dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$485	.dwtag  DW_TAG_member
	.dwattr $C$DW$485, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$485, DW_AT_name("direction")
	.dwattr $C$DW$485, DW_AT_TI_symbol_name("_direction")
	.dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$486	.dwtag  DW_TAG_member
	.dwattr $C$DW$486, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$486, DW_AT_name("leading_marks")
	.dwattr $C$DW$486, DW_AT_TI_symbol_name("_leading_marks")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$42


$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
$C$DW$487	.dwtag  DW_TAG_member
	.dwattr $C$DW$487, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$487, DW_AT_name("ctlCode")
	.dwattr $C$DW$487, DW_AT_TI_symbol_name("_ctlCode")
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$488	.dwtag  DW_TAG_member
	.dwattr $C$DW$488, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$488, DW_AT_name("call_waiting")
	.dwattr $C$DW$488, DW_AT_TI_symbol_name("_call_waiting")
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$489	.dwtag  DW_TAG_member
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$489, DW_AT_name("u")
	.dwattr $C$DW$489, DW_AT_TI_symbol_name("_u")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$43

$C$DW$T$53	.dwtag  DW_TAG_typedef, DW_AT_name("cidCtlMsg_t")
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
$C$DW$T$54	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$54, DW_AT_address_class(0x17)

$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x06)
$C$DW$490	.dwtag  DW_TAG_member
	.dwattr $C$DW$490, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$490, DW_AT_name("standard")
	.dwattr $C$DW$490, DW_AT_TI_symbol_name("_standard")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$491, DW_AT_name("gnrt_fsm")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("_gnrt_fsm")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$492, DW_AT_name("dtct_fsm")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("_dtct_fsm")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$48

$C$DW$T$57	.dwtag  DW_TAG_typedef, DW_AT_name("cidBindStandard_t")
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)

$C$DW$T$58	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x24)
$C$DW$493	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$493, DW_AT_upper_bound(0x05)
	.dwendtag $C$DW$T$58


$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x2c)
$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$494, DW_AT_name("mod")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("_mod")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$495	.dwtag  DW_TAG_member
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$495, DW_AT_name("modCtrl")
	.dwattr $C$DW$495, DW_AT_TI_symbol_name("_modCtrl")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$496, DW_AT_name("demod")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("_demod")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$497, DW_AT_name("demodCtrl")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("_demodCtrl")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$498, DW_AT_name("cidBindStandard")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("_cidBindStandard")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$59

$C$DW$T$110	.dwtag  DW_TAG_typedef, DW_AT_name("cidBindConfig_t")
	.dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
$C$DW$T$111	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$T$111, DW_AT_address_class(0x17)

$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x01)
$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$499, DW_AT_name("samples_per_frame")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("_samples_per_frame")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$60

$C$DW$T$112	.dwtag  DW_TAG_typedef, DW_AT_name("cidOpenConfig_t")
	.dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
$C$DW$T$113	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
	.dwattr $C$DW$T$113, DW_AT_address_class(0x17)

$C$DW$T$61	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$500, DW_AT_name("f1")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("_f1")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$501, DW_AT_name("f2")
	.dwattr $C$DW$501, DW_AT_TI_symbol_name("_f2")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$502, DW_AT_name("amp1")
	.dwattr $C$DW$502, DW_AT_TI_symbol_name("_amp1")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$503, DW_AT_name("amp2")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("_amp2")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$61


$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x06)
$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$504, DW_AT_name("duration")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("_duration")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$505, DW_AT_name("dataptr")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("_dataptr")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$506, DW_AT_name("numword")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("_numword")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$66


$C$DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x08)
$C$DW$507	.dwtag  DW_TAG_member
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$507, DW_AT_name("code")
	.dwattr $C$DW$507, DW_AT_TI_symbol_name("_code")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$508, DW_AT_name("Fs")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("_Fs")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$509	.dwtag  DW_TAG_member
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$509, DW_AT_name("u")
	.dwattr $C$DW$509, DW_AT_TI_symbol_name("_u")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$67

$C$DW$T$114	.dwtag  DW_TAG_typedef, DW_AT_name("sgnControl_t")
	.dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
$C$DW$T$115	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
	.dwattr $C$DW$T$115, DW_AT_address_class(0x17)

$C$DW$T$68	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$68, DW_AT_byte_size(0x04)
$C$DW$510	.dwtag  DW_TAG_member
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$510, DW_AT_name("frame")
	.dwattr $C$DW$510, DW_AT_TI_symbol_name("_frame")
	.dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$511	.dwtag  DW_TAG_member
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$511, DW_AT_name("cnt")
	.dwattr $C$DW$511, DW_AT_TI_symbol_name("_cnt")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$68

$C$DW$T$69	.dwtag  DW_TAG_typedef, DW_AT_name("sgnFileIo_t")
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
$C$DW$T$70	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$70, DW_AT_address_class(0x17)

$C$DW$T$71	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
$C$DW$512	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$70)
	.dwendtag $C$DW$T$71

$C$DW$T$72	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$72, DW_AT_address_class(0x20)

$C$DW$T$82	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x20)
$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$513, DW_AT_name("delay")
	.dwattr $C$DW$513, DW_AT_TI_symbol_name("_delay")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$514, DW_AT_name("dc_offset")
	.dwattr $C$DW$514, DW_AT_TI_symbol_name("_dc_offset")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$515, DW_AT_name("wf_type")
	.dwattr $C$DW$515, DW_AT_TI_symbol_name("_wf_type")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$516, DW_AT_name("f1")
	.dwattr $C$DW$516, DW_AT_TI_symbol_name("_f1")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$517, DW_AT_name("f2")
	.dwattr $C$DW$517, DW_AT_TI_symbol_name("_f2")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$518, DW_AT_name("Fs")
	.dwattr $C$DW$518, DW_AT_TI_symbol_name("_Fs")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$519, DW_AT_name("t_amp1")
	.dwattr $C$DW$519, DW_AT_TI_symbol_name("_t_amp1")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$520	.dwtag  DW_TAG_member
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$520, DW_AT_name("t_amp2")
	.dwattr $C$DW$520, DW_AT_TI_symbol_name("_t_amp2")
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$521	.dwtag  DW_TAG_member
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$521, DW_AT_name("pr_period")
	.dwattr $C$DW$521, DW_AT_TI_symbol_name("_pr_period")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$522, DW_AT_name("pr_enable")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("_pr_enable")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$523, DW_AT_name("fsk_duration")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("_fsk_duration")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$524, DW_AT_name("fsk_dataptr")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("_fsk_dataptr")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$525, DW_AT_name("fsk_numword")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("_fsk_numword")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$526, DW_AT_name("noise_level")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("_noise_level")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$527, DW_AT_name("noise_seed")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("_noise_seed")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$528, DW_AT_name("noise_type")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("_noise_type")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$529, DW_AT_name("power_level")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("_power_level")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$530, DW_AT_name("hoth_wng_seed")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("_hoth_wng_seed")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$531, DW_AT_name("file_io_fcn")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("_file_io_fcn")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$532, DW_AT_name("addr")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("_addr")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$533, DW_AT_name("count")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("_count")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$534, DW_AT_name("pcmtbl")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("_pcmtbl")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$535, DW_AT_name("exception")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("_exception")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$536, DW_AT_name("debug")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("_debug")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$82

$C$DW$T$116	.dwtag  DW_TAG_typedef, DW_AT_name("sgnConfig_t")
	.dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
$C$DW$T$117	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
	.dwattr $C$DW$T$117, DW_AT_address_class(0x17)

$C$DW$T$83	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$83, DW_AT_byte_size(0x0c)
$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$537, DW_AT_name("state")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("_state")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$538, DW_AT_name("dcoffset")
	.dwattr $C$DW$538, DW_AT_TI_symbol_name("_dcoffset")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$539, DW_AT_name("wftype")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("_wftype")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$540, DW_AT_name("f1")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("_f1")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$541, DW_AT_name("f2")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("_f2")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$542, DW_AT_name("amp1")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("_amp1")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$543, DW_AT_name("amp2")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("_amp2")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$544, DW_AT_name("nlevel")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("_nlevel")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$545, DW_AT_name("nseed")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("_nseed")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$546, DW_AT_name("ntype")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("_ntype")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$547, DW_AT_name("pow_level")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("_pow_level")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$548, DW_AT_name("hoth_seed")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("_hoth_seed")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$83

$C$DW$T$94	.dwtag  DW_TAG_typedef, DW_AT_name("siuSGNPars_t")
	.dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
$C$DW$T$118	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$T$118, DW_AT_address_class(0x17)

$C$DW$T$86	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$86, DW_AT_byte_size(0x0a)
$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$549, DW_AT_name("cidBufs")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("_cidBufs")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$550, DW_AT_name("ID")
	.dwattr $C$DW$550, DW_AT_TI_symbol_name("_ID")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$551, DW_AT_name("cidInst")
	.dwattr $C$DW$551, DW_AT_TI_symbol_name("_cidInst")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$552, DW_AT_name("cidNbufs")
	.dwattr $C$DW$552, DW_AT_TI_symbol_name("_cidNbufs")
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$553, DW_AT_name("cid_heap_size")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("_cid_heap_size")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$554, DW_AT_name("aux_heap_size")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("_aux_heap_size")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$86

$C$DW$T$119	.dwtag  DW_TAG_typedef, DW_AT_name("siuInst_t")
	.dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)

$C$DW$T$120	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
	.dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$120, DW_AT_byte_size(0x14)
$C$DW$555	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$555, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$120

$C$DW$T$121	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$119)
	.dwattr $C$DW$T$121, DW_AT_address_class(0x17)

$C$DW$T$90	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$90, DW_AT_byte_size(0x12)
$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$556, DW_AT_name("fptr")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("_fptr")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$557, DW_AT_name("use_cache")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("_use_cache")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$558, DW_AT_name("enabled")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("_enabled")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$559, DW_AT_name("profile_ovrhd")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("_profile_ovrhd")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$560, DW_AT_name("profile_start")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("_profile_start")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$561, DW_AT_name("profile_cycles")
	.dwattr $C$DW$561, DW_AT_TI_symbol_name("_profile_cycles")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$562	.dwtag  DW_TAG_member
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$562, DW_AT_name("ignore_ovrhd")
	.dwattr $C$DW$562, DW_AT_TI_symbol_name("_ignore_ovrhd")
	.dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$563	.dwtag  DW_TAG_member
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$563, DW_AT_name("ignore_start")
	.dwattr $C$DW$563, DW_AT_TI_symbol_name("_ignore_start")
	.dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$564, DW_AT_name("ignore_cycles")
	.dwattr $C$DW$564, DW_AT_TI_symbol_name("_ignore_cycles")
	.dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$90

$C$DW$T$122	.dwtag  DW_TAG_typedef, DW_AT_name("cidProfile_t")
	.dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)

$C$DW$T$91	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$91, DW_AT_byte_size(0x02)
$C$DW$565	.dwtag  DW_TAG_member
	.dwattr $C$DW$565, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$565, DW_AT_name("nscale")
	.dwattr $C$DW$565, DW_AT_TI_symbol_name("_nscale")
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$566	.dwtag  DW_TAG_member
	.dwattr $C$DW$566, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$566, DW_AT_name("rng_state")
	.dwattr $C$DW$566, DW_AT_TI_symbol_name("_rng_state")
	.dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$91


$C$DW$T$92	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$92, DW_AT_byte_size(0x03)
$C$DW$567	.dwtag  DW_TAG_member
	.dwattr $C$DW$567, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$567, DW_AT_name("chnl_sim_on")
	.dwattr $C$DW$567, DW_AT_TI_symbol_name("_chnl_sim_on")
	.dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$568	.dwtag  DW_TAG_member
	.dwattr $C$DW$568, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$568, DW_AT_name("nlevel")
	.dwattr $C$DW$568, DW_AT_TI_symbol_name("_nlevel")
	.dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$569	.dwtag  DW_TAG_member
	.dwattr $C$DW$569, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$569, DW_AT_name("nseed")
	.dwattr $C$DW$569, DW_AT_TI_symbol_name("_nseed")
	.dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$92

$C$DW$T$93	.dwtag  DW_TAG_typedef, DW_AT_name("siuCHSMPars_t")
	.dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)

$C$DW$T$95	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$95, DW_AT_byte_size(0x28)
$C$DW$570	.dwtag  DW_TAG_member
	.dwattr $C$DW$570, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$570, DW_AT_name("pcm_bits")
	.dwattr $C$DW$570, DW_AT_TI_symbol_name("_pcm_bits")
	.dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$571	.dwtag  DW_TAG_member
	.dwattr $C$DW$571, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$571, DW_AT_name("frame_size")
	.dwattr $C$DW$571, DW_AT_TI_symbol_name("_frame_size")
	.dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$572	.dwtag  DW_TAG_member
	.dwattr $C$DW$572, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$572, DW_AT_name("tog_cid1")
	.dwattr $C$DW$572, DW_AT_TI_symbol_name("_tog_cid1")
	.dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$573	.dwtag  DW_TAG_member
	.dwattr $C$DW$573, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$573, DW_AT_name("cid_ctlMsg1")
	.dwattr $C$DW$573, DW_AT_TI_symbol_name("_cid_ctlMsg1")
	.dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$574	.dwtag  DW_TAG_member
	.dwattr $C$DW$574, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$574, DW_AT_name("tog_cid2")
	.dwattr $C$DW$574, DW_AT_TI_symbol_name("_tog_cid2")
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$575	.dwtag  DW_TAG_member
	.dwattr $C$DW$575, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$575, DW_AT_name("cid_ctlMsg2")
	.dwattr $C$DW$575, DW_AT_TI_symbol_name("_cid_ctlMsg2")
	.dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$576	.dwtag  DW_TAG_member
	.dwattr $C$DW$576, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$576, DW_AT_name("tog_chnl_sim")
	.dwattr $C$DW$576, DW_AT_TI_symbol_name("_tog_chnl_sim")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$577	.dwtag  DW_TAG_member
	.dwattr $C$DW$577, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$577, DW_AT_name("chSim")
	.dwattr $C$DW$577, DW_AT_TI_symbol_name("_chSim")
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$578	.dwtag  DW_TAG_member
	.dwattr $C$DW$578, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$578, DW_AT_name("tog_rx_SGN")
	.dwattr $C$DW$578, DW_AT_TI_symbol_name("_tog_rx_SGN")
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$579	.dwtag  DW_TAG_member
	.dwattr $C$DW$579, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$579, DW_AT_name("rxSGN")
	.dwattr $C$DW$579, DW_AT_TI_symbol_name("_rxSGN")
	.dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$95

$C$DW$T$123	.dwtag  DW_TAG_typedef, DW_AT_name("siuSetup_t")
	.dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)

$C$DW$T$96	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$96, DW_AT_byte_size(0x06)
$C$DW$580	.dwtag  DW_TAG_member
	.dwattr $C$DW$580, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$580, DW_AT_name("gnrt")
	.dwattr $C$DW$580, DW_AT_TI_symbol_name("_gnrt")
	.dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$581	.dwtag  DW_TAG_member
	.dwattr $C$DW$581, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$581, DW_AT_name("mgnrt")
	.dwattr $C$DW$581, DW_AT_TI_symbol_name("_mgnrt")
	.dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$582	.dwtag  DW_TAG_member
	.dwattr $C$DW$582, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$582, DW_AT_name("dtct")
	.dwattr $C$DW$582, DW_AT_TI_symbol_name("_dtct")
	.dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$96


$C$DW$T$97	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$97, DW_AT_byte_size(0x06)
$C$DW$583	.dwtag  DW_TAG_member
	.dwattr $C$DW$583, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$583, DW_AT_name("dc_offset")
	.dwattr $C$DW$583, DW_AT_TI_symbol_name("_dc_offset")
	.dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$584	.dwtag  DW_TAG_member
	.dwattr $C$DW$584, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$584, DW_AT_name("pr_period")
	.dwattr $C$DW$584, DW_AT_TI_symbol_name("_pr_period")
	.dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$585	.dwtag  DW_TAG_member
	.dwattr $C$DW$585, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$585, DW_AT_name("t")
	.dwattr $C$DW$585, DW_AT_TI_symbol_name("_t")
	.dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$586	.dwtag  DW_TAG_member
	.dwattr $C$DW$586, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$586, DW_AT_name("noise_level")
	.dwattr $C$DW$586, DW_AT_TI_symbol_name("_noise_level")
	.dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$587	.dwtag  DW_TAG_member
	.dwattr $C$DW$587, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$587, DW_AT_name("fsk")
	.dwattr $C$DW$587, DW_AT_TI_symbol_name("_fsk")
	.dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$588	.dwtag  DW_TAG_member
	.dwattr $C$DW$588, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$588, DW_AT_name("power_level")
	.dwattr $C$DW$588, DW_AT_TI_symbol_name("_power_level")
	.dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$97

$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_address_class(0x17)
$C$DW$T$127	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$127, DW_AT_address_class(0x17)

$C$DW$T$25	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
$C$DW$589	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$589, DW_AT_type(*$C$DW$T$3)
$C$DW$590	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$590, DW_AT_type(*$C$DW$T$23)
$C$DW$591	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$591, DW_AT_type(*$C$DW$T$23)
$C$DW$592	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$23)
$C$DW$593	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$24)
	.dwendtag $C$DW$T$25

$C$DW$T$26	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$26, DW_AT_address_class(0x20)
$C$DW$T$27	.dwtag  DW_TAG_typedef, DW_AT_name("dbgInfo_t")
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)

$C$DW$T$31	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
$C$DW$594	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$23)
$C$DW$595	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$30)
$C$DW$596	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$30)
$C$DW$597	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$597, DW_AT_type(*$C$DW$T$30)
$C$DW$598	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$30)
$C$DW$599	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$599, DW_AT_type(*$C$DW$T$30)
$C$DW$600	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$600, DW_AT_type(*$C$DW$T$30)
$C$DW$601	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$601, DW_AT_type(*$C$DW$T$24)
$C$DW$602	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$602, DW_AT_type(*$C$DW$T$30)
	.dwendtag $C$DW$T$31

$C$DW$T$32	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$32, DW_AT_address_class(0x20)

$C$DW$T$46	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
$C$DW$603	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$603, DW_AT_type(*$C$DW$T$3)
$C$DW$604	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$604, DW_AT_type(*$C$DW$T$30)
	.dwendtag $C$DW$T$46

$C$DW$T$47	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$47, DW_AT_address_class(0x20)

$C$DW$T$51	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
$C$DW$605	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$605, DW_AT_type(*$C$DW$T$3)
$C$DW$606	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$606, DW_AT_type(*$C$DW$T$50)
	.dwendtag $C$DW$T$51

$C$DW$T$52	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$52, DW_AT_address_class(0x20)

$C$DW$T$80	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
$C$DW$607	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$607, DW_AT_type(*$C$DW$T$23)
$C$DW$608	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$608, DW_AT_type(*$C$DW$T$79)
	.dwendtag $C$DW$T$80

$C$DW$T$81	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$T$81, DW_AT_address_class(0x20)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
