;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                        Unix v4.4.1 *
;* Date/Time created: Thu May  2 04:43:49 2024                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("src/csl_audioClass.c")

$C$DW$357	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OPMODE_DMA"), DW_AT_const_value(0x01)
$C$DW$358	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OPMODE_DMA_TXONLY"), DW_AT_const_value(0x02)
	.dwendtag $C$DW$T$81

$C$DW$T$82	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbOpMode")
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)

$C$DW$T$97	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$97, DW_AT_byte_size(0x01)
$C$DW$359	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_FALSE"), DW_AT_const_value(0x00)
$C$DW$360	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_TRUE"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$97

$C$DW$T$98	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbBoolean")
	.dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)

$C$DW$T$99	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$99, DW_AT_byte_size(0x01)
$C$DW$361	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BS_UNKNOWN_SPEED"), DW_AT_const_value(0x00)
$C$DW$362	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BS_FULL_SPEED"), DW_AT_const_value(0x02)
$C$DW$363	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BS_HIGH_SPEED"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$99

$C$DW$T$100	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbBusSpeed")
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
	.dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)

$C$DW$T$101	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$101, DW_AT_byte_size(0x01)
$C$DW$364	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_IDLE"), DW_AT_const_value(0x00)
$C$DW$365	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_STATUS_IN"), DW_AT_const_value(0x01)
$C$DW$366	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_TX"), DW_AT_const_value(0x02)
$C$DW$367	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_RX"), DW_AT_const_value(0x03)
	.dwendtag $C$DW$T$101

$C$DW$T$102	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEp0State")
	.dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)

$C$DW$T$105	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$105, DW_AT_byte_size(0x01)
$C$DW$368	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_DETACH"), DW_AT_const_value(0x00)
$C$DW$369	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_ATTACH"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$105

$C$DW$T$106	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDeviceEvent")
	.dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)

$C$DW$T$112	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$112, DW_AT_byte_size(0x01)
$C$DW$370	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP0"), DW_AT_const_value(0x00)
$C$DW$371	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP1"), DW_AT_const_value(0x01)
$C$DW$372	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP2"), DW_AT_const_value(0x02)
$C$DW$373	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP3"), DW_AT_const_value(0x03)
$C$DW$374	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP4"), DW_AT_const_value(0x04)
$C$DW$375	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP5"), DW_AT_const_value(0x05)
$C$DW$376	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP6"), DW_AT_const_value(0x06)
$C$DW$377	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP7"), DW_AT_const_value(0x07)
$C$DW$378	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP0"), DW_AT_const_value(0x08)
$C$DW$379	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP1"), DW_AT_const_value(0x09)
$C$DW$380	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP2"), DW_AT_const_value(0x0a)
$C$DW$381	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP3"), DW_AT_const_value(0x0b)
$C$DW$382	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP4"), DW_AT_const_value(0x0c)
$C$DW$383	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
$C$DW$384	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
$C$DW$385	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
	.dwendtag $C$DW$T$112

$C$DW$T$113	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
	.dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
	.dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)

$C$DW$T$114	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$114, DW_AT_byte_size(0x01)
$C$DW$386	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
$C$DW$387	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
$C$DW$388	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
$C$DW$389	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
$C$DW$390	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$114

$C$DW$T$115	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
	.dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
	.dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)

$C$DW$T$129	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$129, DW_AT_byte_size(0x01)
$C$DW$391	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_DEVICE_DESCR"), DW_AT_const_value(0x00)
$C$DW$392	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_DEVICE_QUAL_DESCR"), DW_AT_const_value(0x01)
$C$DW$393	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_CONFIG_DESCR"), DW_AT_const_value(0x02)
$C$DW$394	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_INTERFACE_DESCR"), DW_AT_const_value(0x03)
$C$DW$395	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_STRING_LANGID_DESC"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$129

$C$DW$T$130	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcDescrId")
	.dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_name("CSL_AcClassStruct")
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x2b0)
$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$396, DW_AT_name("usbDevHandle")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("_usbDevHandle")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$397, DW_AT_name("ctrlHandle")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("_ctrlHandle")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$398, DW_AT_name("acHandle")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("_acHandle")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x168]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$24

$C$DW$T$131	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcClassStruct")
	.dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
$C$DW$T$132	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
	.dwattr $C$DW$T$132, DW_AT_address_class(0x17)
$C$DW$T$133	.dwtag  DW_TAG_typedef, DW_AT_name("pAcClassHandle")
	.dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)

$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_name("CSL_AcCtrlObject")
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x166)
$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$399, DW_AT_name("ctrlInEpHandle")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("_ctrlInEpHandle")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$400, DW_AT_name("devNum")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("_devNum")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$401, DW_AT_name("ctrlOutEpHandle")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("_ctrlOutEpHandle")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$402, DW_AT_name("suspendFlag")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("_suspendFlag")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$403, DW_AT_name("hEpHandleArray")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("_hEpHandleArray")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$404, DW_AT_name("usbSetup")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("_usbSetup")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$405, DW_AT_name("leftVolBuf")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("_leftVolBuf")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$406, DW_AT_name("rightVolBuf")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("_rightVolBuf")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$407, DW_AT_name("leftRightVolBuf")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("_leftRightVolBuf")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$408, DW_AT_name("muteCtrlBuf")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("_muteCtrlBuf")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$409, DW_AT_name("getMinBuffer")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("_getMinBuffer")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$410, DW_AT_name("getMaxBuffer")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("_getMaxBuffer")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$411, DW_AT_name("getResBuffer")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("_getResBuffer")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$412, DW_AT_name("dummydesc")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("_dummydesc")
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$413, DW_AT_name("deviceQualifierDescr")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("_deviceQualifierDescr")
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x81]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$414, DW_AT_name("deviceDescr")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("_deviceDescr")
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x8d]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$415, DW_AT_name("confDescr")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("_confDescr")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xa1]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$416, DW_AT_name("audioClassIntDescr")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("_audioClassIntDescr")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x11d]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$417, DW_AT_name("audioClassIsoOutEndptDescr")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("_audioClassIsoOutEndptDescr")
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x129]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$418, DW_AT_name("audioClassInterfcLnk")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("_audioClassInterfcLnk")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x12e]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$419, DW_AT_name("audioClassIsoInEndptDescr")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("_audioClassIsoInEndptDescr")
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$420, DW_AT_name("audioClassIsoOutEndptLnk")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("_audioClassIsoOutEndptLnk")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x13a]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$421, DW_AT_name("stringDescrLangid")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("_stringDescrLangid")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$422, DW_AT_name("curConfigStat")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("_curConfigStat")
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$423, DW_AT_name("audioClassIsoInEndptLnk")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("_audioClassIsoInEndptLnk")
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x14e]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$424, DW_AT_name("ctrlBuffer")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("_ctrlBuffer")
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x154]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$425, DW_AT_name("configDescrLnk")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("_configDescrLnk")
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x15a]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$426, DW_AT_name("strDescr")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("_strDescr")
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x160]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$427, DW_AT_name("acReqTable")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("_acReqTable")
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x162]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$428, DW_AT_name("fpRequestHandler")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("_fpRequestHandler")
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$51

$C$DW$T$22	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcCtrlObject")
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
$C$DW$T$134	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$134, DW_AT_address_class(0x17)

$C$DW$T$70	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$70, DW_AT_name("CSL_AcInitStructApp")
	.dwattr $C$DW$T$70, DW_AT_byte_size(0x22)
$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$429, DW_AT_name("pAcObj")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("_pAcObj")
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$430, DW_AT_name("pId")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("_pId")
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$431, DW_AT_name("vId")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("_vId")
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$432, DW_AT_name("numLun")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("_numLun")
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$433, DW_AT_name("txPktSize")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("_txPktSize")
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$434, DW_AT_name("rxPktSize")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("_rxPktSize")
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$435, DW_AT_name("strDescrApp")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("_strDescrApp")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$436, DW_AT_name("lbaBufferApp")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("_lbaBufferApp")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$437, DW_AT_name("acReqTableApp")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("_acReqTableApp")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$438, DW_AT_name("isoHandler")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("_isoHandler")
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$439, DW_AT_name("ctrlHandler")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("_ctrlHandler")
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$440, DW_AT_name("playAudioApp")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("_playAudioApp")
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$441, DW_AT_name("stopAudioApp")
	.dwattr $C$DW$441, DW_AT_TI_symbol_name("_stopAudioApp")
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$442, DW_AT_name("recordAudioApp")
	.dwattr $C$DW$442, DW_AT_TI_symbol_name("_recordAudioApp")
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$443, DW_AT_name("mediaGetPresentStateApp")
	.dwattr $C$DW$443, DW_AT_TI_symbol_name("_mediaGetPresentStateApp")
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$444, DW_AT_name("mediaInitApp")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("_mediaInitApp")
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$445, DW_AT_name("mediaEjectApp")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("_mediaEjectApp")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$446, DW_AT_name("mediaLockUnitApp")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("_mediaLockUnitApp")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$447, DW_AT_name("getMediaSizeApp")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("_getMediaSizeApp")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$70

$C$DW$T$135	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcInitStructApp")
	.dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
$C$DW$T$136	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$T$136, DW_AT_address_class(0x17)
$C$DW$T$137	.dwtag  DW_TAG_typedef, DW_AT_name("pAcAppClassHandle")
	.dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)

$C$DW$T$72	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$72, DW_AT_name("CSL_AcLogicalUnit")
	.dwattr $C$DW$T$72, DW_AT_byte_size(0x3e)
$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$448, DW_AT_name("scsiInquiryData")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("_scsiInquiryData")
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$449, DW_AT_name("mediaSize")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("_mediaSize")
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$450, DW_AT_name("currLba")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("_currLba")
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$451, DW_AT_name("lbaSize")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("_lbaSize")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$452, DW_AT_name("removeable")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("_removeable")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$453, DW_AT_name("mediaState")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("_mediaState")
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$454, DW_AT_name("readwrite")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("_readwrite")
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$455, DW_AT_name("lbaCnt")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("_lbaCnt")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$456, DW_AT_name("verifyFlag")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("_verifyFlag")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$72

$C$DW$T$73	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcLogicalUnit")
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)

$C$DW$T$74	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$74, DW_AT_byte_size(0xf8)
$C$DW$457	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$457, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$74


$C$DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$78, DW_AT_name("CSL_AcObject")
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x148)
$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$458, DW_AT_name("recordAudio")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("_recordAudio")
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$459, DW_AT_name("playAudio")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("_playAudio")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$460, DW_AT_name("stopAudio")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("_stopAudio")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$461, DW_AT_name("mediaGetPresentState")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("_mediaGetPresentState")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$462, DW_AT_name("mediaInit")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("_mediaInit")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$463, DW_AT_name("mediaEject")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("_mediaEject")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$464, DW_AT_name("mediaLockUnit")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("_mediaLockUnit")
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$465	.dwtag  DW_TAG_member
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$465, DW_AT_name("getMediaSize")
	.dwattr $C$DW$465, DW_AT_TI_symbol_name("_getMediaSize")
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$466	.dwtag  DW_TAG_member
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$466, DW_AT_name("lbaBuffer")
	.dwattr $C$DW$466, DW_AT_TI_symbol_name("_lbaBuffer")
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$467, DW_AT_name("cbwDataTransferLength")
	.dwattr $C$DW$467, DW_AT_TI_symbol_name("_cbwDataTransferLength")
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$468, DW_AT_name("lun")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("_lun")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$469, DW_AT_name("senseData")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("_senseData")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$470, DW_AT_name("activityPresentFlag")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("_activityPresentFlag")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x11b]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$471	.dwtag  DW_TAG_member
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$471, DW_AT_name("csw")
	.dwattr $C$DW$471, DW_AT_TI_symbol_name("_csw")
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$472, DW_AT_name("readCapacity")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("_readCapacity")
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$473, DW_AT_name("cbw")
	.dwattr $C$DW$473, DW_AT_TI_symbol_name("_cbw")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x12a]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$474, DW_AT_name("isoInEpHandle")
	.dwattr $C$DW$474, DW_AT_TI_symbol_name("_isoInEpHandle")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$475	.dwtag  DW_TAG_member
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$475, DW_AT_name("isoOutEpHandle")
	.dwattr $C$DW$475, DW_AT_TI_symbol_name("_isoOutEpHandle")
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x13e]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$476	.dwtag  DW_TAG_member
	.dwattr $C$DW$476, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$476, DW_AT_name("noOfLun")
	.dwattr $C$DW$476, DW_AT_TI_symbol_name("_noOfLun")
	.dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$477, DW_AT_name("mediaState")
	.dwattr $C$DW$477, DW_AT_TI_symbol_name("_mediaState")
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x141]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$478, DW_AT_name("playBackActive")
	.dwattr $C$DW$478, DW_AT_TI_symbol_name("_playBackActive")
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x142]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$479, DW_AT_name("mediaInitDone")
	.dwattr $C$DW$479, DW_AT_TI_symbol_name("_mediaInitDone")
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x143]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$480	.dwtag  DW_TAG_member
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$480, DW_AT_name("tempBuffer")
	.dwattr $C$DW$480, DW_AT_TI_symbol_name("_tempBuffer")
	.dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$78

$C$DW$T$23	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcObject")
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
$C$DW$T$138	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$138, DW_AT_address_class(0x17)

$C$DW$T$80	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$80, DW_AT_name("CSL_AcRequestStruct")
	.dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$481, DW_AT_name("request")
	.dwattr $C$DW$481, DW_AT_TI_symbol_name("_request")
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$482	.dwtag  DW_TAG_member
	.dwattr $C$DW$482, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$482, DW_AT_name("fpRequestHandler")
	.dwattr $C$DW$482, DW_AT_TI_symbol_name("_fpRequestHandler")
	.dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$80

$C$DW$T$44	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcRequestStruct")
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
$C$DW$T$45	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$45, DW_AT_address_class(0x17)

$C$DW$T$93	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$93, DW_AT_name("CSL_UsbConfig")
	.dwattr $C$DW$T$93, DW_AT_byte_size(0x16)
$C$DW$483	.dwtag  DW_TAG_member
	.dwattr $C$DW$483, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$483, DW_AT_name("maxCurrent")
	.dwattr $C$DW$483, DW_AT_TI_symbol_name("_maxCurrent")
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$484	.dwtag  DW_TAG_member
	.dwattr $C$DW$484, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$484, DW_AT_name("opMode")
	.dwattr $C$DW$484, DW_AT_TI_symbol_name("_opMode")
	.dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$485	.dwtag  DW_TAG_member
	.dwattr $C$DW$485, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$485, DW_AT_name("appSuspendCallBack")
	.dwattr $C$DW$485, DW_AT_TI_symbol_name("_appSuspendCallBack")
	.dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$486	.dwtag  DW_TAG_member
	.dwattr $C$DW$486, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$486, DW_AT_name("appWakeupCallBack")
	.dwattr $C$DW$486, DW_AT_TI_symbol_name("_appWakeupCallBack")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$487	.dwtag  DW_TAG_member
	.dwattr $C$DW$487, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$487, DW_AT_name("deviceDescPtr")
	.dwattr $C$DW$487, DW_AT_TI_symbol_name("_deviceDescPtr")
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$488	.dwtag  DW_TAG_member
	.dwattr $C$DW$488, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$488, DW_AT_name("deviceQualDescPtr")
	.dwattr $C$DW$488, DW_AT_TI_symbol_name("_deviceQualDescPtr")
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$489	.dwtag  DW_TAG_member
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$489, DW_AT_name("cfgDescPtr")
	.dwattr $C$DW$489, DW_AT_TI_symbol_name("_cfgDescPtr")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$490	.dwtag  DW_TAG_member
	.dwattr $C$DW$490, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$490, DW_AT_name("cfgDescFSPtr")
	.dwattr $C$DW$490, DW_AT_TI_symbol_name("_cfgDescFSPtr")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$491, DW_AT_name("strDescPtr")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("_strDescPtr")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$492, DW_AT_name("usbSpeedCfg")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("_usbSpeedCfg")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$493, DW_AT_name("startTransferCallback")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("_startTransferCallback")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$494, DW_AT_name("completeTransferCallback")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("_completeTransferCallback")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$93

$C$DW$T$139	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbConfig")
	.dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
$C$DW$T$140	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$139)
	.dwattr $C$DW$T$140, DW_AT_address_class(0x17)

$C$DW$T$109	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$109, DW_AT_name("CSL_UsbContext")
	.dwattr $C$DW$T$109, DW_AT_byte_size(0xda)
$C$DW$495	.dwtag  DW_TAG_member
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$495, DW_AT_name("devNum")
	.dwattr $C$DW$495, DW_AT_TI_symbol_name("_devNum")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$496, DW_AT_name("opMode")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("_opMode")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$497, DW_AT_name("maxCurrent")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("_maxCurrent")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$498, DW_AT_name("fInitialized")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("_fInitialized")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$499, DW_AT_name("fSetupPktCmd")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("_fSetupPktCmd")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$500, DW_AT_name("fOutPhaseCmd")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("_fOutPhaseCmd")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$501, DW_AT_name("fWaitingOnFlagA")
	.dwattr $C$DW$501, DW_AT_TI_symbol_name("_fWaitingOnFlagA")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$502, DW_AT_name("fWaitingOnFlagB")
	.dwattr $C$DW$502, DW_AT_TI_symbol_name("_fWaitingOnFlagB")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$503, DW_AT_name("fWaitingOnEP0BUFAvail")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("_fWaitingOnEP0BUFAvail")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$504, DW_AT_name("fWaitingOnEP1InBUFAvail")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("_fWaitingOnEP1InBUFAvail")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$505, DW_AT_name("pFIFOBaseAddress")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("_pFIFOBaseAddress")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$506, DW_AT_name("pInterruptAddr")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("_pInterruptAddr")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$507	.dwtag  DW_TAG_member
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$507, DW_AT_name("fSendHandshake")
	.dwattr $C$DW$507, DW_AT_TI_symbol_name("_fSendHandshake")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$508, DW_AT_name("fMUSBIsReady")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("_fMUSBIsReady")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$509	.dwtag  DW_TAG_member
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$509, DW_AT_name("cbOutEP0Buf")
	.dwattr $C$DW$509, DW_AT_TI_symbol_name("_cbOutEP0Buf")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$510	.dwtag  DW_TAG_member
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$510, DW_AT_name("cbOutEP0DataReceived")
	.dwattr $C$DW$510, DW_AT_TI_symbol_name("_cbOutEP0DataReceived")
	.dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$511	.dwtag  DW_TAG_member
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$511, DW_AT_name("dwOutEP0Buf")
	.dwattr $C$DW$511, DW_AT_TI_symbol_name("_dwOutEP0Buf")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$512	.dwtag  DW_TAG_member
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$512, DW_AT_name("fEP0BUFAvailable")
	.dwattr $C$DW$512, DW_AT_TI_symbol_name("_fEP0BUFAvailable")
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$513, DW_AT_name("fEP1InBUFAvailable")
	.dwattr $C$DW$513, DW_AT_TI_symbol_name("_fEP1InBUFAvailable")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x53]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$514, DW_AT_name("dwIntSourceL")
	.dwattr $C$DW$514, DW_AT_TI_symbol_name("_dwIntSourceL")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$515, DW_AT_name("dwIntSourceH")
	.dwattr $C$DW$515, DW_AT_TI_symbol_name("_dwIntSourceH")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x55]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$516, DW_AT_name("remoteWkpStat")
	.dwattr $C$DW$516, DW_AT_TI_symbol_name("_remoteWkpStat")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$517, DW_AT_name("busSpeed")
	.dwattr $C$DW$517, DW_AT_TI_symbol_name("_busSpeed")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x57]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$518, DW_AT_name("ep0State")
	.dwattr $C$DW$518, DW_AT_TI_symbol_name("_ep0State")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$519, DW_AT_name("pEpStatus")
	.dwattr $C$DW$519, DW_AT_TI_symbol_name("_pEpStatus")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$520	.dwtag  DW_TAG_member
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$106)
	.dwattr $C$DW$520, DW_AT_name("cableState")
	.dwattr $C$DW$520, DW_AT_TI_symbol_name("_cableState")
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$521	.dwtag  DW_TAG_member
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$521, DW_AT_name("usbSetup")
	.dwattr $C$DW$521, DW_AT_TI_symbol_name("_usbSetup")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$522, DW_AT_name("suspendCallBackFxn")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("_suspendCallBackFxn")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$523, DW_AT_name("wakeupCallBackFxn")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("_wakeupCallBackFxn")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$524, DW_AT_name("startTransferCallback")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("_startTransferCallback")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$525, DW_AT_name("completeTransferCallback")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("_completeTransferCallback")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$526, DW_AT_name("dwFIFOStartAddr")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("_dwFIFOStartAddr")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$527, DW_AT_name("deviceDescPtr")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("_deviceDescPtr")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$528, DW_AT_name("deviceQualDescPtr")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("_deviceQualDescPtr")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$529, DW_AT_name("cfgDescPtr")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("_cfgDescPtr")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$530, DW_AT_name("cfgDescFSPtr")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("_cfgDescFSPtr")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$531, DW_AT_name("strDescPtr")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("_strDescPtr")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$532, DW_AT_name("devAddr")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("_devAddr")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$533, DW_AT_name("ctrlOutEpObj")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("_ctrlOutEpObj")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$534, DW_AT_name("ctrlInEpObj")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("_ctrlInEpObj")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$535, DW_AT_name("hEpHandleArray")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("_hEpHandleArray")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$536, DW_AT_name("curConfigStat")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("_curConfigStat")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$537, DW_AT_name("usbSpeedCfg")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("_usbSpeedCfg")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0xd9]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$109

$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbContext")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
$C$DW$T$20	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$20, DW_AT_address_class(0x17)
$C$DW$T$21	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDevHandle")
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)

$C$DW$T$111	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$111, DW_AT_name("CSL_UsbDataStruct")
	.dwattr $C$DW$T$111, DW_AT_byte_size(0x06)
$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$538, DW_AT_name("bytes")
	.dwattr $C$DW$538, DW_AT_TI_symbol_name("_bytes")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$539, DW_AT_name("pBuffer")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("_pBuffer")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$540, DW_AT_name("pNextBuffer")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("_pNextBuffer")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$111

$C$DW$T$40	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDataStruct")
	.dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$111)
	.dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
$C$DW$T$110	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$111)
	.dwattr $C$DW$T$110, DW_AT_address_class(0x17)

$C$DW$T$117	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$117, DW_AT_name("CSL_UsbEpConfig")
	.dwattr $C$DW$T$117, DW_AT_byte_size(0x0a)
$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$541, DW_AT_name("opMode")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("_opMode")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$113)
	.dwattr $C$DW$542, DW_AT_name("epNum")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("_epNum")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$115)
	.dwattr $C$DW$543, DW_AT_name("xferType")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("_xferType")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$544, DW_AT_name("maxPktSize")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("_maxPktSize")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$545, DW_AT_name("eventMask")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("_eventMask")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$546, DW_AT_name("dblPktBuf")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("_dblPktBuf")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$547, DW_AT_name("asyncTxfer")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("_asyncTxfer")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$116)
	.dwattr $C$DW$548, DW_AT_name("fxn")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("_fxn")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$117

$C$DW$T$143	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpConfig")
	.dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$117)
	.dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
$C$DW$T$144	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$143)
	.dwattr $C$DW$T$144, DW_AT_address_class(0x17)

$C$DW$T$120	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$120, DW_AT_name("CSL_UsbEpObj")
	.dwattr $C$DW$T$120, DW_AT_byte_size(0x22)
$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$113)
	.dwattr $C$DW$549, DW_AT_name("epNum")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("_epNum")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$550, DW_AT_name("dwEndpoint")
	.dwattr $C$DW$550, DW_AT_TI_symbol_name("_dwEndpoint")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$115)
	.dwattr $C$DW$551, DW_AT_name("xferType")
	.dwattr $C$DW$551, DW_AT_TI_symbol_name("_xferType")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$552, DW_AT_name("maxPktSize")
	.dwattr $C$DW$552, DW_AT_TI_symbol_name("_maxPktSize")
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$553, DW_AT_name("eventMask")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("_eventMask")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$116)
	.dwattr $C$DW$554, DW_AT_name("fxn")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("_fxn")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$555	.dwtag  DW_TAG_member
	.dwattr $C$DW$555, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$555, DW_AT_name("dwPacketSizeAssigned")
	.dwattr $C$DW$555, DW_AT_TI_symbol_name("_dwPacketSizeAssigned")
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$556, DW_AT_name("fInitialized")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("_fInitialized")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$557, DW_AT_name("pFifoAddr")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("_pFifoAddr")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$558, DW_AT_name("wUSBEvents")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("_wUSBEvents")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$559, DW_AT_name("dataReadFromFifo")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("_dataReadFromFifo")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$116)
	.dwattr $C$DW$560, DW_AT_name("hEventHandler")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("_hEventHandler")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$561, DW_AT_name("fStalled")
	.dwattr $C$DW$561, DW_AT_TI_symbol_name("_fStalled")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$562	.dwtag  DW_TAG_member
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$118)
	.dwattr $C$DW$562, DW_AT_name("pvBuffer")
	.dwattr $C$DW$562, DW_AT_TI_symbol_name("_pvBuffer")
	.dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$563	.dwtag  DW_TAG_member
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$563, DW_AT_name("cbBuffer")
	.dwattr $C$DW$563, DW_AT_TI_symbol_name("_cbBuffer")
	.dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$564, DW_AT_name("cbTransferred")
	.dwattr $C$DW$564, DW_AT_TI_symbol_name("_cbTransferred")
	.dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$565	.dwtag  DW_TAG_member
	.dwattr $C$DW$565, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$565, DW_AT_name("prevTxferLen")
	.dwattr $C$DW$565, DW_AT_TI_symbol_name("_prevTxferLen")
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$566	.dwtag  DW_TAG_member
	.dwattr $C$DW$566, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$566, DW_AT_name("fComplete")
	.dwattr $C$DW$566, DW_AT_TI_symbol_name("_fComplete")
	.dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$567	.dwtag  DW_TAG_member
	.dwattr $C$DW$567, DW_AT_type(*$C$DW$T$119)
	.dwattr $C$DW$567, DW_AT_name("ioFlags")
	.dwattr $C$DW$567, DW_AT_TI_symbol_name("_ioFlags")
	.dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$568	.dwtag  DW_TAG_member
	.dwattr $C$DW$568, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$568, DW_AT_name("hUsbDev")
	.dwattr $C$DW$568, DW_AT_TI_symbol_name("_hUsbDev")
	.dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$120

$C$DW$T$25	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpObj")
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$120)
	.dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
$C$DW$T$26	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$26, DW_AT_address_class(0x17)
$C$DW$T$27	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpHandle")
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)

$C$DW$T$31	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
$C$DW$569	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$569, DW_AT_upper_bound(0x04)
	.dwendtag $C$DW$T$31


$C$DW$T$108	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$108, DW_AT_byte_size(0x14)
$C$DW$570	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$570, DW_AT_upper_bound(0x09)
	.dwendtag $C$DW$T$108

$C$DW$T$148	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$148, DW_AT_address_class(0x17)

$C$DW$T$123	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$123, DW_AT_name("CSL_UsbEpStatus")
	.dwattr $C$DW$T$123, DW_AT_byte_size(0x12)
$C$DW$571	.dwtag  DW_TAG_member
	.dwattr $C$DW$571, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$571, DW_AT_name("dwEndpoint")
	.dwattr $C$DW$571, DW_AT_TI_symbol_name("_dwEndpoint")
	.dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$572	.dwtag  DW_TAG_member
	.dwattr $C$DW$572, DW_AT_type(*$C$DW$T$115)
	.dwattr $C$DW$572, DW_AT_name("xferType")
	.dwattr $C$DW$572, DW_AT_TI_symbol_name("_xferType")
	.dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$573	.dwtag  DW_TAG_member
	.dwattr $C$DW$573, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$573, DW_AT_name("dwPacketSizeAssigned")
	.dwattr $C$DW$573, DW_AT_TI_symbol_name("_dwPacketSizeAssigned")
	.dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$574	.dwtag  DW_TAG_member
	.dwattr $C$DW$574, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$574, DW_AT_name("fInitialized")
	.dwattr $C$DW$574, DW_AT_TI_symbol_name("_fInitialized")
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$575	.dwtag  DW_TAG_member
	.dwattr $C$DW$575, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$575, DW_AT_name("pFifoAddr")
	.dwattr $C$DW$575, DW_AT_TI_symbol_name("_pFifoAddr")
	.dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$576	.dwtag  DW_TAG_member
	.dwattr $C$DW$576, DW_AT_type(*$C$DW$T$122)
	.dwattr $C$DW$576, DW_AT_name("pTransfer")
	.dwattr $C$DW$576, DW_AT_TI_symbol_name("_pTransfer")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$577	.dwtag  DW_TAG_member
	.dwattr $C$DW$577, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$577, DW_AT_name("wUSBEvents")
	.dwattr $C$DW$577, DW_AT_TI_symbol_name("_wUSBEvents")
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$578	.dwtag  DW_TAG_member
	.dwattr $C$DW$578, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$578, DW_AT_name("dataReadFromFifo")
	.dwattr $C$DW$578, DW_AT_TI_symbol_name("_dataReadFromFifo")
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$579	.dwtag  DW_TAG_member
	.dwattr $C$DW$579, DW_AT_type(*$C$DW$T$116)
	.dwattr $C$DW$579, DW_AT_name("hEventHandler")
	.dwattr $C$DW$579, DW_AT_TI_symbol_name("_hEventHandler")
	.dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$580	.dwtag  DW_TAG_member
	.dwattr $C$DW$580, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$580, DW_AT_name("fStalled")
	.dwattr $C$DW$580, DW_AT_TI_symbol_name("_fStalled")
	.dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$581	.dwtag  DW_TAG_member
	.dwattr $C$DW$581, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$581, DW_AT_name("fSelected")
	.dwattr $C$DW$581, DW_AT_TI_symbol_name("_fSelected")
	.dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$123

$C$DW$T$103	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpStatus")
	.dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$123)
	.dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
$C$DW$T$104	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$T$104, DW_AT_address_class(0x17)

$C$DW$T$124	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$124, DW_AT_name("CSL_UsbSetupStruct")
	.dwattr $C$DW$T$124, DW_AT_byte_size(0x06)
$C$DW$582	.dwtag  DW_TAG_member
	.dwattr $C$DW$582, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$582, DW_AT_name("newPacket")
	.dwattr $C$DW$582, DW_AT_TI_symbol_name("_newPacket")
	.dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$583	.dwtag  DW_TAG_member
	.dwattr $C$DW$583, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$583, DW_AT_name("bmRequestType")
	.dwattr $C$DW$583, DW_AT_TI_symbol_name("_bmRequestType")
	.dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$584	.dwtag  DW_TAG_member
	.dwattr $C$DW$584, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$584, DW_AT_name("bRequest")
	.dwattr $C$DW$584, DW_AT_TI_symbol_name("_bRequest")
	.dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$585	.dwtag  DW_TAG_member
	.dwattr $C$DW$585, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$585, DW_AT_name("wValue")
	.dwattr $C$DW$585, DW_AT_TI_symbol_name("_wValue")
	.dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$586	.dwtag  DW_TAG_member
	.dwattr $C$DW$586, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$586, DW_AT_name("wIndex")
	.dwattr $C$DW$586, DW_AT_TI_symbol_name("_wIndex")
	.dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$587	.dwtag  DW_TAG_member
	.dwattr $C$DW$587, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$587, DW_AT_name("wLength")
	.dwattr $C$DW$587, DW_AT_TI_symbol_name("_wLength")
	.dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$124

$C$DW$T$32	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbSetupStruct")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$124)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
$C$DW$T$48	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$48, DW_AT_address_class(0x17)

$C$DW$T$125	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$125, DW_AT_name("CSL_UsbTransfer")
	.dwattr $C$DW$T$125, DW_AT_byte_size(0x0e)
$C$DW$588	.dwtag  DW_TAG_member
	.dwattr $C$DW$588, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$588, DW_AT_name("dwFlags")
	.dwattr $C$DW$588, DW_AT_TI_symbol_name("_dwFlags")
	.dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$589	.dwtag  DW_TAG_member
	.dwattr $C$DW$589, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$589, DW_AT_name("dwEndpoint")
	.dwattr $C$DW$589, DW_AT_TI_symbol_name("_dwEndpoint")
	.dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$590	.dwtag  DW_TAG_member
	.dwattr $C$DW$590, DW_AT_type(*$C$DW$T$118)
	.dwattr $C$DW$590, DW_AT_name("pvBuffer")
	.dwattr $C$DW$590, DW_AT_TI_symbol_name("_pvBuffer")
	.dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$591	.dwtag  DW_TAG_member
	.dwattr $C$DW$591, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$591, DW_AT_name("cbBuffer")
	.dwattr $C$DW$591, DW_AT_TI_symbol_name("_cbBuffer")
	.dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$592	.dwtag  DW_TAG_member
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$592, DW_AT_name("cbTransferred")
	.dwattr $C$DW$592, DW_AT_TI_symbol_name("_cbTransferred")
	.dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$593	.dwtag  DW_TAG_member
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$593, DW_AT_name("prevTxferLen")
	.dwattr $C$DW$593, DW_AT_TI_symbol_name("_prevTxferLen")
	.dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$594	.dwtag  DW_TAG_member
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$594, DW_AT_name("fComplete")
	.dwattr $C$DW$594, DW_AT_TI_symbol_name("_fComplete")
	.dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$595	.dwtag  DW_TAG_member
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$119)
	.dwattr $C$DW$595, DW_AT_name("ioFlags")
	.dwattr $C$DW$595, DW_AT_TI_symbol_name("_ioFlags")
	.dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$125

$C$DW$T$121	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbTransfer")
	.dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
$C$DW$T$122	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
	.dwattr $C$DW$T$122, DW_AT_address_class(0x17)
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_address_class(0x17)
$C$DW$T$118	.dwtag  DW_TAG_typedef, DW_AT_name("PVOID")
	.dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)

$C$DW$T$53	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
$C$DW$T$54	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$54, DW_AT_address_class(0x20)
$C$DW$T$116	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_USB_EVENT_ISR")
	.dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)

$C$DW$T$83	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
$C$DW$596	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$30)
	.dwendtag $C$DW$T$83

$C$DW$T$84	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$T$84, DW_AT_address_class(0x20)
$C$DW$T$85	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_USB_APP_CALLBACK")
	.dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
$C$DW$597	.dwtag  DW_TAG_TI_far_type
$C$DW$T$150	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$150, DW_AT_type(*$C$DW$597)
$C$DW$T$151	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$T$151, DW_AT_address_class(0x17)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
$C$DW$T$88	.dwtag  DW_TAG_typedef, DW_AT_name("Int16")
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
$C$DW$T$89	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)

$C$DW$T$90	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
$C$DW$598	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$3)
$C$DW$599	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$599, DW_AT_type(*$C$DW$T$3)
	.dwendtag $C$DW$T$90

$C$DW$T$91	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$T$91, DW_AT_address_class(0x20)
$C$DW$T$92	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_USB_APP_TRANSFER_CALLBACK")
	.dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
$C$DW$T$145	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$T$145, DW_AT_address_class(0x17)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
$C$DW$T$87	.dwtag  DW_TAG_typedef, DW_AT_name("Bool")
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$9)
