;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                        Unix v4.4.1 *
;* Date/Time created: Thu May  2 04:44:09 2024                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("src/csl_pll.c")

;*******************************************************************************
_getSysClk:
	.dwcfi	cfa_offset, 1
	.dwcfi	save_reg_to_mem, 91, -1
        AADD #-7, SP
	.dwcfi	cfa_offset, 8
$C$DW$37	.dwtag  DW_TAG_variable, DW_AT_name("pllRDBypass")
	.dwattr $C$DW$37, DW_AT_TI_symbol_name("_pllRDBypass")
	.dwattr $C$DW$37, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$37, DW_AT_location[DW_OP_bregx 0x24 0]
$C$DW$38	.dwtag  DW_TAG_variable, DW_AT_name("pllOutDiv")
	.dwattr $C$DW$38, DW_AT_TI_symbol_name("_pllOutDiv")
	.dwattr $C$DW$38, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$38, DW_AT_location[DW_OP_bregx 0x24 1]
$C$DW$39	.dwtag  DW_TAG_variable, DW_AT_name("sysClk")
	.dwattr $C$DW$39, DW_AT_TI_symbol_name("_sysClk")
	.dwattr $C$DW$39, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$39, DW_AT_location[DW_OP_bregx 0x24 2]
$C$DW$40	.dwtag  DW_TAG_variable, DW_AT_name("pllM")
	.dwattr $C$DW$40, DW_AT_TI_symbol_name("_pllM")
	.dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$40, DW_AT_location[DW_OP_bregx 0x24 4]
$C$DW$41	.dwtag  DW_TAG_variable, DW_AT_name("pllRD")
	.dwattr $C$DW$41, DW_AT_TI_symbol_name("_pllRD")
	.dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$41, DW_AT_location[DW_OP_bregx 0x24 5]
$C$DW$42	.dwtag  DW_TAG_variable, DW_AT_name("pllOD")
	.dwattr $C$DW$42, DW_AT_TI_symbol_name("_pllOD")
	.dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$42, DW_AT_location[DW_OP_bregx 0x24 6]
	.dwpsn	file "src/csl_pll.c",line 507,column 2,is_stmt
        MOV *port(#7200), AR1 ; |507| 
        AND #0x0fff, AR1, AC0 ; |507| 
        MOV AC0, *SP(#4) ; |507| 
	.dwpsn	file "src/csl_pll.c",line 509,column 2,is_stmt
        MOV *port(#7201), AR1 ; |509| 
        AND #0x0fff, AR1, AC0 ; |509| 
        MOV AC0, *SP(#5) ; |509| 
	.dwpsn	file "src/csl_pll.c",line 510,column 2,is_stmt
        MOV uns(low_byte(*port(#7203))), AR1 ; |510| 
        MOV AR1, *SP(#6) ; |510| 
	.dwpsn	file "src/csl_pll.c",line 512,column 2,is_stmt
        MOV *port(#7201), AR1 ; |512| 
        AND #0x8000, AR1, AC0 ; |512| 
        SFTS AC0, #-15, AC0 ; |512| 
        MOV AC0, *SP(#0) ; |512| 
	.dwpsn	file "src/csl_pll.c",line 513,column 2,is_stmt
        MOV *port(#7203), AR1 ; |513| 
        AND #0x0200, AR1, AC0 ; |513| 
        SFTS AC0, #-9, AC0 ; |513| 
        MOV AC0, *SP(#1) ; |513| 
	.dwpsn	file "src/csl_pll.c",line 515,column 2,is_stmt
        MOV #0, AC0 ; |515| 
        OR #0x8000, AC0, AC0 ; |515| 
        MOV AC0, dbl(*SP(#2)) ; |515| 
	.dwpsn	file "src/csl_pll.c",line 517,column 2,is_stmt

        MOV *SP(#0), AR1 ; |517| 
||      MOV #0, AR2

        CMPU AR2 != AR1, TC1 ; |517| 
        BCC $C$L21,TC1 ; |517| 
                                        ; branchcc occurs ; |517| 
	.dwpsn	file "src/csl_pll.c",line 519,column 3,is_stmt
        MOV *SP(#5), AR1 ; |519| 

        ADD #4, AR1 ; |519| 
||      MOV dbl(*SP(#2)), AC0 ; |519| 

        AND #0xffff, AR1, AC1 ; |519| 
$C$DW$43	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$43, DW_AT_low_pc(0x00)
	.dwattr $C$DW$43, DW_AT_name("__divul")
	.dwattr $C$DW$43, DW_AT_TI_call
        CALL #__divul ; |519| 
                                        ; call occurs [#__divul] ; |519| 
        MOV AC0, dbl(*SP(#2)) ; |519| 
$C$L21:    
	.dwpsn	file "src/csl_pll.c",line 522,column 2,is_stmt
        MOV *SP(#4), AR1 ; |522| 

        ADD #4, AR1 ; |522| 
||      MOV dbl(*SP(#2)), AC0 ; |522| 

        AND #0xffff, AR1, AC1 ; |522| 
$C$DW$44	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$44, DW_AT_low_pc(0x00)
	.dwattr $C$DW$44, DW_AT_name("__mpyli")
	.dwattr $C$DW$44, DW_AT_TI_call
        CALL #__mpyli ; |522| 
                                        ; call occurs [#__mpyli] ; |522| 
        MOV AC0, dbl(*SP(#2)) ; |522| 
	.dwpsn	file "src/csl_pll.c",line 524,column 2,is_stmt

        MOV *SP(#1), AR1 ; |524| 
||      MOV #1, AR2

        CMPU AR2 != AR1, TC1 ; |524| 
        BCC $C$L22,TC1 ; |524| 
                                        ; branchcc occurs ; |524| 
	.dwpsn	file "src/csl_pll.c",line 526,column 3,is_stmt
        MOV *SP(#6), AR1 ; |526| 

        ADD #1, AR1 ; |526| 
||      MOV dbl(*SP(#2)), AC0 ; |526| 

        AND #0xffff, AR1, AC1 ; |526| 
$C$DW$45	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$45, DW_AT_low_pc(0x00)
	.dwattr $C$DW$45, DW_AT_name("__divul")
	.dwattr $C$DW$45, DW_AT_TI_call
        CALL #__divul ; |526| 
                                        ; call occurs [#__divul] ; |526| 
        MOV AC0, dbl(*SP(#2)) ; |526| 
$C$L22:    
	.dwpsn	file "src/csl_pll.c",line 530,column 2,is_stmt
        MOV dbl(*SP(#2)), AC0 ; |530| 
        MOV #1000, AC1 ; |530| 
$C$DW$46	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$46, DW_AT_low_pc(0x00)
	.dwattr $C$DW$46, DW_AT_name("__divul")
	.dwattr $C$DW$46, DW_AT_TI_call
        CALL #__divul ; |530| 
                                        ; call occurs [#__divul] ; |530| 
	.dwpsn	file "src/csl_pll.c",line 531,column 1,is_stmt
        AADD #7, SP
	.dwcfi	cfa_offset, 1
$C$DW$47	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$47, DW_AT_low_pc(0x00)
	.dwattr $C$DW$47, DW_AT_TI_return
        RET
                                        ; return occurs
	.dwattr $C$DW$36, DW_AT_TI_end_file("src/csl_pll.c")
	.dwattr $C$DW$36, DW_AT_TI_end_line(0x213)
	.dwattr $C$DW$36, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$36

;******************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                              *
;******************************************************************************
	.global	__divul
	.global	__mpyli

;*******************************************************************************
;* TYPE INFORMATION                                                            *
;*******************************************************************************

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
$C$DW$48	.dwtag  DW_TAG_member
	.dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$48, DW_AT_name("PLLCNTL1")
	.dwattr $C$DW$48, DW_AT_TI_symbol_name("_PLLCNTL1")
	.dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$49	.dwtag  DW_TAG_member
	.dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$49, DW_AT_name("PLLINCNTL")
	.dwattr $C$DW$49, DW_AT_TI_symbol_name("_PLLINCNTL")
	.dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$50	.dwtag  DW_TAG_member
	.dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$50, DW_AT_name("PLLCNTL2")
	.dwattr $C$DW$50, DW_AT_TI_symbol_name("_PLLCNTL2")
	.dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$51	.dwtag  DW_TAG_member
	.dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$51, DW_AT_name("PLLOUTCNTL")
	.dwattr $C$DW$51, DW_AT_TI_symbol_name("_PLLOUTCNTL")
	.dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$20

$C$DW$T$26	.dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
$C$DW$T$27	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$27, DW_AT_address_class(0x17)

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x48)
$C$DW$52	.dwtag  DW_TAG_member
	.dwattr $C$DW$52, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$52, DW_AT_name("EBSR")
	.dwattr $C$DW$52, DW_AT_TI_symbol_name("_EBSR")
	.dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$53	.dwtag  DW_TAG_member
	.dwattr $C$DW$53, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$53, DW_AT_name("RSVD0")
	.dwattr $C$DW$53, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$54	.dwtag  DW_TAG_member
	.dwattr $C$DW$54, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$54, DW_AT_name("PCGCR1")
	.dwattr $C$DW$54, DW_AT_TI_symbol_name("_PCGCR1")
	.dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$55	.dwtag  DW_TAG_member
	.dwattr $C$DW$55, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$55, DW_AT_name("PCGCR2")
	.dwattr $C$DW$55, DW_AT_TI_symbol_name("_PCGCR2")
	.dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$56	.dwtag  DW_TAG_member
	.dwattr $C$DW$56, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$56, DW_AT_name("PSRCR")
	.dwattr $C$DW$56, DW_AT_TI_symbol_name("_PSRCR")
	.dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$57	.dwtag  DW_TAG_member
	.dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$57, DW_AT_name("PRCR")
	.dwattr $C$DW$57, DW_AT_TI_symbol_name("_PRCR")
	.dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$58	.dwtag  DW_TAG_member
	.dwattr $C$DW$58, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$58, DW_AT_name("RSVD1")
	.dwattr $C$DW$58, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$59	.dwtag  DW_TAG_member
	.dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$59, DW_AT_name("TIAFR")
	.dwattr $C$DW$59, DW_AT_TI_symbol_name("_TIAFR")
	.dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$60	.dwtag  DW_TAG_member
	.dwattr $C$DW$60, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$60, DW_AT_name("RSVD2")
	.dwattr $C$DW$60, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$61	.dwtag  DW_TAG_member
	.dwattr $C$DW$61, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$61, DW_AT_name("ODSCR")
	.dwattr $C$DW$61, DW_AT_TI_symbol_name("_ODSCR")
	.dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$62	.dwtag  DW_TAG_member
	.dwattr $C$DW$62, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$62, DW_AT_name("PDINHIBR1")
	.dwattr $C$DW$62, DW_AT_TI_symbol_name("_PDINHIBR1")
	.dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$63	.dwtag  DW_TAG_member
	.dwattr $C$DW$63, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$63, DW_AT_name("PDINHIBR2")
	.dwattr $C$DW$63, DW_AT_TI_symbol_name("_PDINHIBR2")
	.dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$64	.dwtag  DW_TAG_member
	.dwattr $C$DW$64, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$64, DW_AT_name("PDINHIBR3")
	.dwattr $C$DW$64, DW_AT_TI_symbol_name("_PDINHIBR3")
	.dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$65	.dwtag  DW_TAG_member
	.dwattr $C$DW$65, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$65, DW_AT_name("DMA0CESR1")
	.dwattr $C$DW$65, DW_AT_TI_symbol_name("_DMA0CESR1")
	.dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$66	.dwtag  DW_TAG_member
	.dwattr $C$DW$66, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$66, DW_AT_name("DMA0CESR2")
	.dwattr $C$DW$66, DW_AT_TI_symbol_name("_DMA0CESR2")
	.dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$67	.dwtag  DW_TAG_member
	.dwattr $C$DW$67, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$67, DW_AT_name("DMA1CESR1")
	.dwattr $C$DW$67, DW_AT_TI_symbol_name("_DMA1CESR1")
	.dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$68	.dwtag  DW_TAG_member
	.dwattr $C$DW$68, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$68, DW_AT_name("DMA1CESR2")
	.dwattr $C$DW$68, DW_AT_TI_symbol_name("_DMA1CESR2")
	.dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$69	.dwtag  DW_TAG_member
	.dwattr $C$DW$69, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$69, DW_AT_name("CCR1")
	.dwattr $C$DW$69, DW_AT_TI_symbol_name("_CCR1")
	.dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$70	.dwtag  DW_TAG_member
	.dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$70, DW_AT_name("CCR2")
	.dwattr $C$DW$70, DW_AT_TI_symbol_name("_CCR2")
	.dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$71	.dwtag  DW_TAG_member
	.dwattr $C$DW$71, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$71, DW_AT_name("CGCR1")
	.dwattr $C$DW$71, DW_AT_TI_symbol_name("_CGCR1")
	.dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$72	.dwtag  DW_TAG_member
	.dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$72, DW_AT_name("CGCR2")
	.dwattr $C$DW$72, DW_AT_TI_symbol_name("_CGCR2")
	.dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$73	.dwtag  DW_TAG_member
	.dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$73, DW_AT_name("CGCR3")
	.dwattr $C$DW$73, DW_AT_TI_symbol_name("_CGCR3")
	.dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$74	.dwtag  DW_TAG_member
	.dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$74, DW_AT_name("CGCR4")
	.dwattr $C$DW$74, DW_AT_TI_symbol_name("_CGCR4")
	.dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$75	.dwtag  DW_TAG_member
	.dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$75, DW_AT_name("CCSSR")
	.dwattr $C$DW$75, DW_AT_TI_symbol_name("_CCSSR")
	.dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$76	.dwtag  DW_TAG_member
	.dwattr $C$DW$76, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$76, DW_AT_name("RSVD3")
	.dwattr $C$DW$76, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$77	.dwtag  DW_TAG_member
	.dwattr $C$DW$77, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$77, DW_AT_name("ECDR")
	.dwattr $C$DW$77, DW_AT_TI_symbol_name("_ECDR")
	.dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$78	.dwtag  DW_TAG_member
	.dwattr $C$DW$78, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$78, DW_AT_name("RSVD4")
	.dwattr $C$DW$78, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$79	.dwtag  DW_TAG_member
	.dwattr $C$DW$79, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$79, DW_AT_name("RAMSLPMDCNTLR1")
	.dwattr $C$DW$79, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
	.dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$80	.dwtag  DW_TAG_member
	.dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$80, DW_AT_name("RSVD5")
	.dwattr $C$DW$80, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$81	.dwtag  DW_TAG_member
	.dwattr $C$DW$81, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$81, DW_AT_name("RAMSLPMDCNTLR2")
	.dwattr $C$DW$81, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
	.dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$82	.dwtag  DW_TAG_member
	.dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$82, DW_AT_name("RAMSLPMDCNTLR3")
	.dwattr $C$DW$82, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
	.dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$83	.dwtag  DW_TAG_member
	.dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$83, DW_AT_name("RAMSLPMDCNTLR4")
	.dwattr $C$DW$83, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
	.dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$84	.dwtag  DW_TAG_member
	.dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$84, DW_AT_name("RAMSLPMDCNTLR5")
	.dwattr $C$DW$84, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
	.dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$85	.dwtag  DW_TAG_member
	.dwattr $C$DW$85, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$85, DW_AT_name("RSVD6")
	.dwattr $C$DW$85, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$86	.dwtag  DW_TAG_member
	.dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$86, DW_AT_name("DMAIFR")
	.dwattr $C$DW$86, DW_AT_TI_symbol_name("_DMAIFR")
	.dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$87	.dwtag  DW_TAG_member
	.dwattr $C$DW$87, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$87, DW_AT_name("DMAIER")
	.dwattr $C$DW$87, DW_AT_TI_symbol_name("_DMAIER")
	.dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$88	.dwtag  DW_TAG_member
	.dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$88, DW_AT_name("USBSCR")
	.dwattr $C$DW$88, DW_AT_TI_symbol_name("_USBSCR")
	.dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$89	.dwtag  DW_TAG_member
	.dwattr $C$DW$89, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$89, DW_AT_name("ESCR")
	.dwattr $C$DW$89, DW_AT_TI_symbol_name("_ESCR")
	.dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
	.dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$90	.dwtag  DW_TAG_member
	.dwattr $C$DW$90, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$90, DW_AT_name("RSVD7")
	.dwattr $C$DW$90, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$91	.dwtag  DW_TAG_member
	.dwattr $C$DW$91, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$91, DW_AT_name("DMA2CESR1")
	.dwattr $C$DW$91, DW_AT_TI_symbol_name("_DMA2CESR1")
	.dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$92	.dwtag  DW_TAG_member
	.dwattr $C$DW$92, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$92, DW_AT_name("DMA2CESR2")
	.dwattr $C$DW$92, DW_AT_TI_symbol_name("_DMA2CESR2")
	.dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
	.dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$93	.dwtag  DW_TAG_member
	.dwattr $C$DW$93, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$93, DW_AT_name("DMA3CESR1")
	.dwattr $C$DW$93, DW_AT_TI_symbol_name("_DMA3CESR1")
	.dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$94	.dwtag  DW_TAG_member
	.dwattr $C$DW$94, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$94, DW_AT_name("DMA3CESR2")
	.dwattr $C$DW$94, DW_AT_TI_symbol_name("_DMA3CESR2")
	.dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$95	.dwtag  DW_TAG_member
	.dwattr $C$DW$95, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$95, DW_AT_name("CLKSTOP")
	.dwattr $C$DW$95, DW_AT_TI_symbol_name("_CLKSTOP")
	.dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$96	.dwtag  DW_TAG_member
	.dwattr $C$DW$96, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$96, DW_AT_name("RSVD8")
	.dwattr $C$DW$96, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
	.dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$97	.dwtag  DW_TAG_member
	.dwattr $C$DW$97, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$97, DW_AT_name("DIEIDR0")
	.dwattr $C$DW$97, DW_AT_TI_symbol_name("_DIEIDR0")
	.dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$98	.dwtag  DW_TAG_member
	.dwattr $C$DW$98, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$98, DW_AT_name("DIEIDR1")
	.dwattr $C$DW$98, DW_AT_TI_symbol_name("_DIEIDR1")
	.dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$99	.dwtag  DW_TAG_member
	.dwattr $C$DW$99, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$99, DW_AT_name("DIEIDR2")
	.dwattr $C$DW$99, DW_AT_TI_symbol_name("_DIEIDR2")
	.dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$100	.dwtag  DW_TAG_member
	.dwattr $C$DW$100, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$100, DW_AT_name("DIEIDR3")
	.dwattr $C$DW$100, DW_AT_TI_symbol_name("_DIEIDR3")
	.dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$101	.dwtag  DW_TAG_member
	.dwattr $C$DW$101, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$101, DW_AT_name("DIEIDR4")
	.dwattr $C$DW$101, DW_AT_TI_symbol_name("_DIEIDR4")
	.dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$102	.dwtag  DW_TAG_member
	.dwattr $C$DW$102, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$102, DW_AT_name("DIEIDR5")
	.dwattr $C$DW$102, DW_AT_TI_symbol_name("_DIEIDR5")
	.dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$103	.dwtag  DW_TAG_member
	.dwattr $C$DW$103, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$103, DW_AT_name("DIEIDR6")
	.dwattr $C$DW$103, DW_AT_TI_symbol_name("_DIEIDR6")
	.dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$104	.dwtag  DW_TAG_member
	.dwattr $C$DW$104, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$104, DW_AT_name("DIEIDR7")
	.dwattr $C$DW$104, DW_AT_TI_symbol_name("_DIEIDR7")
	.dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
	.dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$25

$C$DW$T$29	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
$C$DW$105	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$105, DW_AT_type(*$C$DW$T$29)
$C$DW$106	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$106, DW_AT_type(*$C$DW$105)
$C$DW$T$30	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$106)
$C$DW$T$31	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$31, DW_AT_address_class(0x10)
$C$DW$T$32	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)

$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_name("PLL_Obj")
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
$C$DW$107	.dwtag  DW_TAG_member
	.dwattr $C$DW$107, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$107, DW_AT_name("pllConfig")
	.dwattr $C$DW$107, DW_AT_TI_symbol_name("_pllConfig")
	.dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$108	.dwtag  DW_TAG_member
	.dwattr $C$DW$108, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$108, DW_AT_name("instId")
	.dwattr $C$DW$108, DW_AT_TI_symbol_name("_instId")
	.dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$109	.dwtag  DW_TAG_member
	.dwattr $C$DW$109, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$109, DW_AT_name("sysAddr")
	.dwattr $C$DW$109, DW_AT_TI_symbol_name("_sysAddr")
	.dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$33

$C$DW$T$34	.dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
$C$DW$T$35	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$35, DW_AT_address_class(0x17)
$C$DW$T$36	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$36, DW_AT_address_class(0x17)
$C$DW$T$37	.dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
$C$DW$T$38	.dwtag  DW_TAG_typedef, DW_AT_name("Int16")
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
$C$DW$T$39	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
$C$DW$T$43	.dwtag  DW_TAG_typedef, DW_AT_name("Bool")
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
$C$DW$110	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
$C$DW$T$21	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$110)

$C$DW$T$22	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
$C$DW$111	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$111, DW_AT_upper_bound(0x0d)
	.dwendtag $C$DW$T$22


$C$DW$T$23	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
$C$DW$112	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$112, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$23


$C$DW$T$24	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x05)
$C$DW$113	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$113, DW_AT_upper_bound(0x04)
	.dwendtag $C$DW$T$24

$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
