;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                        Unix v4.4.1 *
;* Date/Time created: Thu May  2 04:43:54 2024                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("src/csl_emif.c")

	.dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
$C$DW$350	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EMIF_16BIT"), DW_AT_const_value(0x00)
$C$DW$351	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EMIF_8BIT_HIGH"), DW_AT_const_value(0x01)
$C$DW$352	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EMIF_8BIT_LOW"), DW_AT_const_value(0x02)
	.dwendtag $C$DW$T$31

$C$DW$T$32	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifAccess")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)

$C$DW$T$33	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
$C$DW$353	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EMIF_CS2"), DW_AT_const_value(0x00)
$C$DW$354	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EMIF_CS3"), DW_AT_const_value(0x01)
$C$DW$355	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EMIF_CS4"), DW_AT_const_value(0x02)
$C$DW$356	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EMIF_CS5"), DW_AT_const_value(0x03)
	.dwendtag $C$DW$T$33

$C$DW$T$34	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifChipSelect")
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)

$C$DW$T$41	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
$C$DW$357	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EMIF_WP_LOW"), DW_AT_const_value(0x00)
$C$DW$358	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EMIF_WP_HIGH"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$41

$C$DW$T$42	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifWaitPol")
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)

$C$DW$T$43	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
$C$DW$359	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EM_WAIT0"), DW_AT_const_value(0x00)
$C$DW$360	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EM_WAIT1"), DW_AT_const_value(0x01)
$C$DW$361	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EM_WAIT2"), DW_AT_const_value(0x02)
$C$DW$362	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EM_WAIT3"), DW_AT_const_value(0x03)
	.dwendtag $C$DW$T$43

$C$DW$T$44	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifWaitPin")
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)

$C$DW$T$54	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
$C$DW$363	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EMIF_8_BIT"), DW_AT_const_value(0x00)
$C$DW$364	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EMIF_16_BIT"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$54

$C$DW$T$55	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifWidth")
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)

$C$DW$T$57	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
$C$DW$365	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EMIF_OPMODE_POLLED"), DW_AT_const_value(0x00)
$C$DW$366	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EMIF_OPMODE_DMA"), DW_AT_const_value(0x01)
$C$DW$367	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_EMIF_OPMODE_INTRRUPT"), DW_AT_const_value(0x02)
	.dwendtag $C$DW$T$57

$C$DW$T$58	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifOpMode")
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)

$C$DW$T$61	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x01)
$C$DW$368	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_256"), DW_AT_const_value(0x00)
$C$DW$369	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_512"), DW_AT_const_value(0x01)
$C$DW$370	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_1024"), DW_AT_const_value(0x02)
$C$DW$371	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_2048"), DW_AT_const_value(0x03)
	.dwendtag $C$DW$T$61

$C$DW$T$62	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandPageSize")
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)

$C$DW$T$63	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x01)
$C$DW$372	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_NONE"), DW_AT_const_value(0x00)
$C$DW$373	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BIG_BLOCK"), DW_AT_const_value(0x01)
$C$DW$374	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_SMALL_BLOCK"), DW_AT_const_value(0x02)
$C$DW$375	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_INVALID"), DW_AT_const_value(0x03)
	.dwendtag $C$DW$T$63

$C$DW$T$64	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandType")
	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)

$C$DW$T$69	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x01)
$C$DW$376	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_0"), DW_AT_const_value(0x00)
$C$DW$377	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_1"), DW_AT_const_value(0x01)
$C$DW$378	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_2"), DW_AT_const_value(0x02)
$C$DW$379	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_3"), DW_AT_const_value(0x03)
$C$DW$380	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_MAX"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$69

$C$DW$T$70	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandBankNo")
	.dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)

$C$DW$T$74	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$74, DW_AT_byte_size(0x01)
$C$DW$381	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SYS_PG4"), DW_AT_const_value(0x00)
$C$DW$382	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SYS_PG3"), DW_AT_const_value(0x01)
$C$DW$383	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SYS_PG1"), DW_AT_const_value(0x02)
	.dwendtag $C$DW$T$74

$C$DW$T$75	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysPGFlags")
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)

$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0xde)
$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$384, DW_AT_name("REV")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("_REV")
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$385, DW_AT_name("STATUS")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("_STATUS")
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$386, DW_AT_name("RSVD0")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$387, DW_AT_name("AWCCR1")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("_AWCCR1")
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$388, DW_AT_name("AWCCR2")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("_AWCCR2")
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$389, DW_AT_name("RSVD1")
	.dwattr $C$DW$389, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$390, DW_AT_name("SDCR1")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("_SDCR1")
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$391, DW_AT_name("SDCR2")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("_SDCR2")
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$392, DW_AT_name("RSVD2")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$393, DW_AT_name("SDRCR")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("_SDRCR")
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$394, DW_AT_name("RSVD3")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$395, DW_AT_name("ACS2CR1")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("_ACS2CR1")
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$396, DW_AT_name("ACS2CR2")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("_ACS2CR2")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$397, DW_AT_name("RSVD4")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$398, DW_AT_name("ACS3CR1")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("_ACS3CR1")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$399, DW_AT_name("ACS3CR2")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("_ACS3CR2")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$400, DW_AT_name("RSVD5")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$401, DW_AT_name("ACS4CR1")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("_ACS4CR1")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$402, DW_AT_name("ACS4CR2")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("_ACS4CR2")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$403, DW_AT_name("RSVD6")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$404, DW_AT_name("ACS5CR1")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("_ACS5CR1")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$405, DW_AT_name("ACS5CR2")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("_ACS5CR2")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$406, DW_AT_name("RSVD7")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$407, DW_AT_name("SDTIMR1")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("_SDTIMR1")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$408, DW_AT_name("SDTIMR2")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("_SDTIMR2")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$409, DW_AT_name("RSVD8")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$410, DW_AT_name("SDSRETR")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("_SDSRETR")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$411, DW_AT_name("RSVD9")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("_RSVD9")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$412, DW_AT_name("EIRR")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("_EIRR")
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$413, DW_AT_name("RSVD10")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("_RSVD10")
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$414, DW_AT_name("EIMR")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("_EIMR")
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$415, DW_AT_name("RSVD11")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("_RSVD11")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$416, DW_AT_name("EIMSR")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("_EIMSR")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$417, DW_AT_name("RSVD12")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("_RSVD12")
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$418, DW_AT_name("EIMCR")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("_EIMCR")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$419, DW_AT_name("RSVD13")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("_RSVD13")
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$420, DW_AT_name("NANDFCR")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("_NANDFCR")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$421, DW_AT_name("RSVD14")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("_RSVD14")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$422, DW_AT_name("NANDFSR1")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("_NANDFSR1")
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$423, DW_AT_name("NANDFSR2")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("_NANDFSR2")
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$424, DW_AT_name("RSVD15")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("_RSVD15")
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$425, DW_AT_name("PAGEMODCTRL1")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("_PAGEMODCTRL1")
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$426, DW_AT_name("PAGEMODCTRL2")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("_PAGEMODCTRL2")
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$427, DW_AT_name("RSVD16")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("_RSVD16")
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$428, DW_AT_name("NCS2ECC1")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("_NCS2ECC1")
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$429, DW_AT_name("NCS2ECC2")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("_NCS2ECC2")
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$430, DW_AT_name("RSVD17")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("_RSVD17")
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$431, DW_AT_name("NCS3ECC1")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("_NCS3ECC1")
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$432, DW_AT_name("NCS3ECC2")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("_NCS3ECC2")
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x75]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$433, DW_AT_name("RSVD18")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("_RSVD18")
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$434, DW_AT_name("NCS4ECC1")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("_NCS4ECC1")
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$435, DW_AT_name("NCS4ECC2")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("_NCS4ECC2")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x79]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$436, DW_AT_name("RSVD19")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("_RSVD19")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$437, DW_AT_name("NCS5ECC1")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("_NCS5ECC1")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$438, DW_AT_name("NCS5ECC2")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("_NCS5ECC2")
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x7d]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$439, DW_AT_name("RSVD20")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("_RSVD20")
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$440, DW_AT_name("NAND4BITECCLOAD")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("_NAND4BITECCLOAD")
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$441, DW_AT_name("RSVD21")
	.dwattr $C$DW$441, DW_AT_TI_symbol_name("_RSVD21")
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xbd]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$442, DW_AT_name("NAND4BITECC1")
	.dwattr $C$DW$442, DW_AT_TI_symbol_name("_NAND4BITECC1")
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$443, DW_AT_name("NAND4BITECC2")
	.dwattr $C$DW$443, DW_AT_TI_symbol_name("_NAND4BITECC2")
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0xc1]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$444, DW_AT_name("RSVD22")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("_RSVD22")
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$445, DW_AT_name("NAND4BITECC3")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("_NAND4BITECC3")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$446, DW_AT_name("NAND4BITECC4")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("_NAND4BITECC4")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xc5]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$447, DW_AT_name("RSVD23")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("_RSVD23")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$448, DW_AT_name("NAND4BITECC5")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("_NAND4BITECC5")
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$449, DW_AT_name("NAND4BITECC6")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("_NAND4BITECC6")
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0xc9]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$450, DW_AT_name("RSVD24")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("_RSVD24")
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$451, DW_AT_name("NAND4BITECC7")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("_NAND4BITECC7")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$452, DW_AT_name("NAND4BITECC8")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("_NAND4BITECC8")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0xcd]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$453, DW_AT_name("RSVD25")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("_RSVD25")
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$454, DW_AT_name("NANDERRADD1")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("_NANDERRADD1")
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$455, DW_AT_name("NANDERRADD2")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("_NANDERRADD2")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xd1]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$456, DW_AT_name("RSVD26")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("_RSVD26")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$457, DW_AT_name("NANDERRADD3")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("_NANDERRADD3")
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$458, DW_AT_name("NANDERRADD4")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("_NANDERRADD4")
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0xd5]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$459, DW_AT_name("RSVD27")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("_RSVD27")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$460, DW_AT_name("NANDERRVAL1")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("_NANDERRVAL1")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$461, DW_AT_name("NANDERRVAL2")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("_NANDERRVAL2")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0xd9]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$462, DW_AT_name("RSVD28")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("_RSVD28")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$463, DW_AT_name("NANDERRVAL3")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("_NANDERRVAL3")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$464, DW_AT_name("NANDERRVAL4")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("_NANDERRVAL4")
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xdd]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$27

$C$DW$T$46	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifRegs")
	.dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
$C$DW$465	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$46)
$C$DW$466	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$465)
$C$DW$T$47	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$466)
$C$DW$T$48	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$48, DW_AT_address_class(0x10)
$C$DW$T$49	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifRegsOvly")
	.dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)

$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x48)
$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$467, DW_AT_name("EBSR")
	.dwattr $C$DW$467, DW_AT_TI_symbol_name("_EBSR")
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$468, DW_AT_name("RSVD0")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$469, DW_AT_name("PCGCR1")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("_PCGCR1")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$470, DW_AT_name("PCGCR2")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("_PCGCR2")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$471	.dwtag  DW_TAG_member
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$471, DW_AT_name("PSRCR")
	.dwattr $C$DW$471, DW_AT_TI_symbol_name("_PSRCR")
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$472, DW_AT_name("PRCR")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("_PRCR")
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$473, DW_AT_name("RSVD1")
	.dwattr $C$DW$473, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$474, DW_AT_name("TIAFR")
	.dwattr $C$DW$474, DW_AT_TI_symbol_name("_TIAFR")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$475	.dwtag  DW_TAG_member
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$475, DW_AT_name("RSVD2")
	.dwattr $C$DW$475, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$476	.dwtag  DW_TAG_member
	.dwattr $C$DW$476, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$476, DW_AT_name("ODSCR")
	.dwattr $C$DW$476, DW_AT_TI_symbol_name("_ODSCR")
	.dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$477, DW_AT_name("PDINHIBR1")
	.dwattr $C$DW$477, DW_AT_TI_symbol_name("_PDINHIBR1")
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$478, DW_AT_name("PDINHIBR2")
	.dwattr $C$DW$478, DW_AT_TI_symbol_name("_PDINHIBR2")
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$479, DW_AT_name("PDINHIBR3")
	.dwattr $C$DW$479, DW_AT_TI_symbol_name("_PDINHIBR3")
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$480	.dwtag  DW_TAG_member
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$480, DW_AT_name("DMA0CESR1")
	.dwattr $C$DW$480, DW_AT_TI_symbol_name("_DMA0CESR1")
	.dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$481, DW_AT_name("DMA0CESR2")
	.dwattr $C$DW$481, DW_AT_TI_symbol_name("_DMA0CESR2")
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$482	.dwtag  DW_TAG_member
	.dwattr $C$DW$482, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$482, DW_AT_name("DMA1CESR1")
	.dwattr $C$DW$482, DW_AT_TI_symbol_name("_DMA1CESR1")
	.dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$483	.dwtag  DW_TAG_member
	.dwattr $C$DW$483, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$483, DW_AT_name("DMA1CESR2")
	.dwattr $C$DW$483, DW_AT_TI_symbol_name("_DMA1CESR2")
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$484	.dwtag  DW_TAG_member
	.dwattr $C$DW$484, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$484, DW_AT_name("CCR1")
	.dwattr $C$DW$484, DW_AT_TI_symbol_name("_CCR1")
	.dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$485	.dwtag  DW_TAG_member
	.dwattr $C$DW$485, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$485, DW_AT_name("CCR2")
	.dwattr $C$DW$485, DW_AT_TI_symbol_name("_CCR2")
	.dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$486	.dwtag  DW_TAG_member
	.dwattr $C$DW$486, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$486, DW_AT_name("CGCR1")
	.dwattr $C$DW$486, DW_AT_TI_symbol_name("_CGCR1")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$487	.dwtag  DW_TAG_member
	.dwattr $C$DW$487, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$487, DW_AT_name("CGCR2")
	.dwattr $C$DW$487, DW_AT_TI_symbol_name("_CGCR2")
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$488	.dwtag  DW_TAG_member
	.dwattr $C$DW$488, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$488, DW_AT_name("CGCR3")
	.dwattr $C$DW$488, DW_AT_TI_symbol_name("_CGCR3")
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$489	.dwtag  DW_TAG_member
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$489, DW_AT_name("CGCR4")
	.dwattr $C$DW$489, DW_AT_TI_symbol_name("_CGCR4")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$490	.dwtag  DW_TAG_member
	.dwattr $C$DW$490, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$490, DW_AT_name("CCSSR")
	.dwattr $C$DW$490, DW_AT_TI_symbol_name("_CCSSR")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$491, DW_AT_name("RSVD3")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$492, DW_AT_name("ECDR")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("_ECDR")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$493, DW_AT_name("RSVD4")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$494, DW_AT_name("RAMSLPMDCNTLR1")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$495	.dwtag  DW_TAG_member
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$495, DW_AT_name("RSVD5")
	.dwattr $C$DW$495, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$496, DW_AT_name("RAMSLPMDCNTLR2")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$497, DW_AT_name("RAMSLPMDCNTLR3")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$498, DW_AT_name("RAMSLPMDCNTLR4")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$499, DW_AT_name("RAMSLPMDCNTLR5")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$500, DW_AT_name("RSVD6")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$501, DW_AT_name("DMAIFR")
	.dwattr $C$DW$501, DW_AT_TI_symbol_name("_DMAIFR")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$502, DW_AT_name("DMAIER")
	.dwattr $C$DW$502, DW_AT_TI_symbol_name("_DMAIER")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$503, DW_AT_name("USBSCR")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("_USBSCR")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$504, DW_AT_name("ESCR")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("_ESCR")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$505, DW_AT_name("RSVD7")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$506, DW_AT_name("DMA2CESR1")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("_DMA2CESR1")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$507	.dwtag  DW_TAG_member
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$507, DW_AT_name("DMA2CESR2")
	.dwattr $C$DW$507, DW_AT_TI_symbol_name("_DMA2CESR2")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$508, DW_AT_name("DMA3CESR1")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("_DMA3CESR1")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$509	.dwtag  DW_TAG_member
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$509, DW_AT_name("DMA3CESR2")
	.dwattr $C$DW$509, DW_AT_TI_symbol_name("_DMA3CESR2")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$510	.dwtag  DW_TAG_member
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$510, DW_AT_name("CLKSTOP")
	.dwattr $C$DW$510, DW_AT_TI_symbol_name("_CLKSTOP")
	.dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$511	.dwtag  DW_TAG_member
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$511, DW_AT_name("RSVD8")
	.dwattr $C$DW$511, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$512	.dwtag  DW_TAG_member
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$512, DW_AT_name("DIEIDR0")
	.dwattr $C$DW$512, DW_AT_TI_symbol_name("_DIEIDR0")
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$513, DW_AT_name("DIEIDR1")
	.dwattr $C$DW$513, DW_AT_TI_symbol_name("_DIEIDR1")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$514, DW_AT_name("DIEIDR2")
	.dwattr $C$DW$514, DW_AT_TI_symbol_name("_DIEIDR2")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$515, DW_AT_name("DIEIDR3")
	.dwattr $C$DW$515, DW_AT_TI_symbol_name("_DIEIDR3")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$516, DW_AT_name("DIEIDR4")
	.dwattr $C$DW$516, DW_AT_TI_symbol_name("_DIEIDR4")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$517, DW_AT_name("DIEIDR5")
	.dwattr $C$DW$517, DW_AT_TI_symbol_name("_DIEIDR5")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$518, DW_AT_name("DIEIDR6")
	.dwattr $C$DW$518, DW_AT_TI_symbol_name("_DIEIDR6")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$519, DW_AT_name("DIEIDR7")
	.dwattr $C$DW$519, DW_AT_TI_symbol_name("_DIEIDR7")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$30

$C$DW$T$50	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
	.dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
$C$DW$520	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$50)
$C$DW$521	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$520)
$C$DW$T$51	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$521)
$C$DW$T$52	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$52, DW_AT_address_class(0x10)
$C$DW$T$53	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)

$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_name("CSL_AsyncConfig")
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x06)
$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$522, DW_AT_name("emifAccess")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("_emifAccess")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$523, DW_AT_name("chipSelect")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("_chipSelect")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$524, DW_AT_name("asyncWaitCfg")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("_asyncWaitCfg")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$525, DW_AT_name("asyncCfg")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("_asyncCfg")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$39

$C$DW$T$76	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_AsyncConfig")
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
$C$DW$T$77	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$77, DW_AT_address_class(0x17)

$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_name("CSL_EmifAsyncCfg")
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$526, DW_AT_name("selectStrobe")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("_selectStrobe")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$527, DW_AT_name("ewMode")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("_ewMode")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$528, DW_AT_name("w_setup")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("_w_setup")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$529, DW_AT_name("w_strobe")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("_w_strobe")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$530, DW_AT_name("w_hold")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("_w_hold")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$531, DW_AT_name("r_setup")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("_r_setup")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$532, DW_AT_name("r_strobe")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("_r_strobe")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$533, DW_AT_name("r_hold")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("_r_hold")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$534, DW_AT_name("turnAround")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("_turnAround")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$535, DW_AT_name("aSize")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("_aSize")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$40

$C$DW$T$37	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifAsyncCfg")
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
$C$DW$T$38	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$38, DW_AT_address_class(0x17)

$C$DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$45, DW_AT_name("CSL_EmifAsyncWaitCfg")
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x03)
$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$536, DW_AT_name("waitPol")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("_waitPol")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$537, DW_AT_name("waitPin")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("_waitPin")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$538, DW_AT_name("waitCycles")
	.dwattr $C$DW$538, DW_AT_TI_symbol_name("_waitCycles")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$45

$C$DW$T$35	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifAsyncWaitCfg")
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
$C$DW$T$36	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$36, DW_AT_address_class(0x17)

$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_name("CSL_EmifObj")
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x14)
$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$539, DW_AT_name("regs")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("_regs")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$540, DW_AT_name("sysCtrlRegs")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("_sysCtrlRegs")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$541, DW_AT_name("emifWidth")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("_emifWidth")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$542, DW_AT_name("nandWidth")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("_nandWidth")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$543, DW_AT_name("intrNumEmif")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("_intrNumEmif")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$544, DW_AT_name("emifOpMode")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("_emifOpMode")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$545, DW_AT_name("chipSelect")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("_chipSelect")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$546, DW_AT_name("waitPin")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("_waitPin")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$547, DW_AT_name("bank")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("_bank")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$548, DW_AT_name("nandPageSize")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("_nandPageSize")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$549, DW_AT_name("addrCycles")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("_addrCycles")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$550, DW_AT_name("nandType")
	.dwattr $C$DW$550, DW_AT_TI_symbol_name("_nandType")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$65

$C$DW$T$78	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifObj")
	.dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
$C$DW$T$79	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$79, DW_AT_address_class(0x17)
$C$DW$T$80	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifHandle")
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)

$C$DW$T$68	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$68, DW_AT_name("CSL_NandAsyncBank")
	.dwattr $C$DW$T$68, DW_AT_byte_size(0x08)
$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$551, DW_AT_name("CExDATA")
	.dwattr $C$DW$551, DW_AT_TI_symbol_name("_CExDATA")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$552, DW_AT_name("CExALE")
	.dwattr $C$DW$552, DW_AT_TI_symbol_name("_CExALE")
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$553, DW_AT_name("CExCLE")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("_CExCLE")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$554, DW_AT_name("CExNUM")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("_CExNUM")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$68

$C$DW$T$60	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandAsyncBank")
	.dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
$C$DW$T$81	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$81, DW_AT_address_class(0x17)

$C$DW$T$71	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$71, DW_AT_name("CSL_NandConfig")
	.dwattr $C$DW$T$71, DW_AT_byte_size(0x05)
$C$DW$555	.dwtag  DW_TAG_member
	.dwattr $C$DW$555, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$555, DW_AT_name("nandWidth")
	.dwattr $C$DW$555, DW_AT_TI_symbol_name("_nandWidth")
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$556, DW_AT_name("nandPageSize")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("_nandPageSize")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$557, DW_AT_name("nandBankNo")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("_nandBankNo")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$558, DW_AT_name("emifOpMode")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("_emifOpMode")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$559, DW_AT_name("nandType")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("_nandType")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$71

$C$DW$T$82	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandConfig")
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
$C$DW$T$83	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$83, DW_AT_address_class(0x17)

$C$DW$T$72	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$72, DW_AT_name("CSL_SdramCfg")
	.dwattr $C$DW$T$72, DW_AT_byte_size(0x0e)
$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$560, DW_AT_name("selfRefresh")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("_selfRefresh")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$561, DW_AT_name("pdMode")
	.dwattr $C$DW$561, DW_AT_TI_symbol_name("_pdMode")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$562	.dwtag  DW_TAG_member
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$562, DW_AT_name("pdwr")
	.dwattr $C$DW$562, DW_AT_TI_symbol_name("_pdwr")
	.dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$563	.dwtag  DW_TAG_member
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$563, DW_AT_name("pasr")
	.dwattr $C$DW$563, DW_AT_TI_symbol_name("_pasr")
	.dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$564, DW_AT_name("rowSize")
	.dwattr $C$DW$564, DW_AT_TI_symbol_name("_rowSize")
	.dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$565	.dwtag  DW_TAG_member
	.dwattr $C$DW$565, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$565, DW_AT_name("ibankPos")
	.dwattr $C$DW$565, DW_AT_TI_symbol_name("_ibankPos")
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$566	.dwtag  DW_TAG_member
	.dwattr $C$DW$566, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$566, DW_AT_name("sdramDrive")
	.dwattr $C$DW$566, DW_AT_TI_symbol_name("_sdramDrive")
	.dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$567	.dwtag  DW_TAG_member
	.dwattr $C$DW$567, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$567, DW_AT_name("bit9to1Lock")
	.dwattr $C$DW$567, DW_AT_TI_symbol_name("_bit9to1Lock")
	.dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$568	.dwtag  DW_TAG_member
	.dwattr $C$DW$568, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$568, DW_AT_name("NM")
	.dwattr $C$DW$568, DW_AT_TI_symbol_name("_NM")
	.dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$569	.dwtag  DW_TAG_member
	.dwattr $C$DW$569, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$569, DW_AT_name("CasLatency")
	.dwattr $C$DW$569, DW_AT_TI_symbol_name("_CasLatency")
	.dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$570	.dwtag  DW_TAG_member
	.dwattr $C$DW$570, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$570, DW_AT_name("bit11to9Lock")
	.dwattr $C$DW$570, DW_AT_TI_symbol_name("_bit11to9Lock")
	.dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$571	.dwtag  DW_TAG_member
	.dwattr $C$DW$571, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$571, DW_AT_name("num_ibank")
	.dwattr $C$DW$571, DW_AT_TI_symbol_name("_num_ibank")
	.dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$572	.dwtag  DW_TAG_member
	.dwattr $C$DW$572, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$572, DW_AT_name("ebank")
	.dwattr $C$DW$572, DW_AT_TI_symbol_name("_ebank")
	.dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$573	.dwtag  DW_TAG_member
	.dwattr $C$DW$573, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$573, DW_AT_name("pageSize")
	.dwattr $C$DW$573, DW_AT_TI_symbol_name("_pageSize")
	.dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$72

$C$DW$T$84	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdramCfg")
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
$C$DW$T$85	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$T$85, DW_AT_address_class(0x17)

$C$DW$T$73	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$73, DW_AT_name("CSL_SdramTimr")
	.dwattr $C$DW$T$73, DW_AT_byte_size(0x09)
$C$DW$574	.dwtag  DW_TAG_member
	.dwattr $C$DW$574, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$574, DW_AT_name("tRAS")
	.dwattr $C$DW$574, DW_AT_TI_symbol_name("_tRAS")
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$575	.dwtag  DW_TAG_member
	.dwattr $C$DW$575, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$575, DW_AT_name("tRC")
	.dwattr $C$DW$575, DW_AT_TI_symbol_name("_tRC")
	.dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$576	.dwtag  DW_TAG_member
	.dwattr $C$DW$576, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$576, DW_AT_name("tRRD")
	.dwattr $C$DW$576, DW_AT_TI_symbol_name("_tRRD")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$577	.dwtag  DW_TAG_member
	.dwattr $C$DW$577, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$577, DW_AT_name("tRFC")
	.dwattr $C$DW$577, DW_AT_TI_symbol_name("_tRFC")
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$578	.dwtag  DW_TAG_member
	.dwattr $C$DW$578, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$578, DW_AT_name("tRP")
	.dwattr $C$DW$578, DW_AT_TI_symbol_name("_tRP")
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$579	.dwtag  DW_TAG_member
	.dwattr $C$DW$579, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$579, DW_AT_name("tRCD")
	.dwattr $C$DW$579, DW_AT_TI_symbol_name("_tRCD")
	.dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$580	.dwtag  DW_TAG_member
	.dwattr $C$DW$580, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$580, DW_AT_name("tWR")
	.dwattr $C$DW$580, DW_AT_TI_symbol_name("_tWR")
	.dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$581	.dwtag  DW_TAG_member
	.dwattr $C$DW$581, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$581, DW_AT_name("tXS")
	.dwattr $C$DW$581, DW_AT_TI_symbol_name("_tXS")
	.dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$582	.dwtag  DW_TAG_member
	.dwattr $C$DW$582, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$582, DW_AT_name("refRate")
	.dwattr $C$DW$582, DW_AT_TI_symbol_name("_refRate")
	.dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$73

$C$DW$T$86	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdramTimr")
	.dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
$C$DW$T$87	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$87, DW_AT_address_class(0x17)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$59	.dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
$C$DW$583	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$583, DW_AT_type(*$C$DW$T$6)
$C$DW$T$90	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$90, DW_AT_type(*$C$DW$583)
$C$DW$T$91	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_VUint8")
	.dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
$C$DW$T$93	.dwtag  DW_TAG_typedef, DW_AT_name("Int16")
	.dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
$C$DW$T$94	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
	.dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
$C$DW$T$115	.dwtag  DW_TAG_typedef, DW_AT_name("Bool")
	.dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
$C$DW$584	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$584, DW_AT_type(*$C$DW$T$19)
$C$DW$T$20	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$584)

$C$DW$T$21	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x02)
$C$DW$585	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$585, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$21


$C$DW$T$22	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x03)
$C$DW$586	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$586, DW_AT_upper_bound(0x02)
	.dwendtag $C$DW$T$22


$C$DW$T$23	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x1a)
$C$DW$587	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$587, DW_AT_upper_bound(0x19)
	.dwendtag $C$DW$T$23


$C$DW$T$24	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x13)
$C$DW$588	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$588, DW_AT_upper_bound(0x12)
	.dwendtag $C$DW$T$24


$C$DW$T$25	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x06)
