;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                        Unix v4.4.1 *
;* Date/Time created: Thu May  2 04:44:07 2024                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("src/csl_msc.c")

	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$64, DW_AT_address_class(0x20)

$C$DW$T$61	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x01)
$C$DW$682	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MSC_UNLOCK"), DW_AT_const_value(0x00)
$C$DW$683	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MSC_LOCK"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$61

$C$DW$T$62	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscMediaLockStatus")
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)

$C$DW$T$79	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$79, DW_AT_byte_size(0x01)
$C$DW$684	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OPMODE_POLLED"), DW_AT_const_value(0x00)
$C$DW$685	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OPMODE_DMA"), DW_AT_const_value(0x01)
$C$DW$686	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OPMODE_DMA_TXONLY"), DW_AT_const_value(0x02)
	.dwendtag $C$DW$T$79

$C$DW$T$80	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbOpMode")
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)

$C$DW$T$94	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$94, DW_AT_byte_size(0x01)
$C$DW$687	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_FALSE"), DW_AT_const_value(0x00)
$C$DW$688	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_TRUE"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$94

$C$DW$T$95	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbBoolean")
	.dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)

$C$DW$T$96	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$96, DW_AT_byte_size(0x01)
$C$DW$689	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BS_UNKNOWN_SPEED"), DW_AT_const_value(0x00)
$C$DW$690	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BS_FULL_SPEED"), DW_AT_const_value(0x02)
$C$DW$691	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BS_HIGH_SPEED"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$96

$C$DW$T$97	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbBusSpeed")
	.dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)

$C$DW$T$98	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$98, DW_AT_byte_size(0x01)
$C$DW$692	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_IDLE"), DW_AT_const_value(0x00)
$C$DW$693	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_STATUS_IN"), DW_AT_const_value(0x01)
$C$DW$694	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_TX"), DW_AT_const_value(0x02)
$C$DW$695	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_RX"), DW_AT_const_value(0x03)
	.dwendtag $C$DW$T$98

$C$DW$T$99	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEp0State")
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)

$C$DW$T$102	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$102, DW_AT_byte_size(0x01)
$C$DW$696	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_DETACH"), DW_AT_const_value(0x00)
$C$DW$697	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_ATTACH"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$102

$C$DW$T$103	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDeviceEvent")
	.dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)

$C$DW$T$109	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
$C$DW$698	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP0"), DW_AT_const_value(0x00)
$C$DW$699	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP1"), DW_AT_const_value(0x01)
$C$DW$700	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP2"), DW_AT_const_value(0x02)
$C$DW$701	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP3"), DW_AT_const_value(0x03)
$C$DW$702	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP4"), DW_AT_const_value(0x04)
$C$DW$703	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP5"), DW_AT_const_value(0x05)
$C$DW$704	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP6"), DW_AT_const_value(0x06)
$C$DW$705	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP7"), DW_AT_const_value(0x07)
$C$DW$706	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP0"), DW_AT_const_value(0x08)
$C$DW$707	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP1"), DW_AT_const_value(0x09)
$C$DW$708	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP2"), DW_AT_const_value(0x0a)
$C$DW$709	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP3"), DW_AT_const_value(0x0b)
$C$DW$710	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP4"), DW_AT_const_value(0x0c)
$C$DW$711	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
$C$DW$712	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
$C$DW$713	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
	.dwendtag $C$DW$T$109

$C$DW$T$110	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
	.dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)

$C$DW$T$111	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$111, DW_AT_byte_size(0x01)
$C$DW$714	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
$C$DW$715	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
$C$DW$716	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
$C$DW$717	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
$C$DW$718	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$111

$C$DW$T$112	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
	.dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$111)
	.dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_name("CSL_MscClassStruct")
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x1da)
$C$DW$719	.dwtag  DW_TAG_member
	.dwattr $C$DW$719, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$719, DW_AT_name("usbDevHandle")
	.dwattr $C$DW$719, DW_AT_TI_symbol_name("_usbDevHandle")
	.dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$720	.dwtag  DW_TAG_member
	.dwattr $C$DW$720, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$720, DW_AT_name("ctrlHandle")
	.dwattr $C$DW$720, DW_AT_TI_symbol_name("_ctrlHandle")
	.dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$721	.dwtag  DW_TAG_member
	.dwattr $C$DW$721, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$721, DW_AT_name("mscHandle")
	.dwattr $C$DW$721, DW_AT_TI_symbol_name("_mscHandle")
	.dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
	.dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$24

$C$DW$T$129	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscClassStruct")
	.dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
$C$DW$T$130	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$T$130, DW_AT_address_class(0x17)
$C$DW$T$131	.dwtag  DW_TAG_typedef, DW_AT_name("pMscClassHandle")
	.dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$130)
	.dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)

$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_name("CSL_MscCtrlObject")
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x92)
$C$DW$722	.dwtag  DW_TAG_member
	.dwattr $C$DW$722, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$722, DW_AT_name("ctrlInEpHandle")
	.dwattr $C$DW$722, DW_AT_TI_symbol_name("_ctrlInEpHandle")
	.dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$723	.dwtag  DW_TAG_member
	.dwattr $C$DW$723, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$723, DW_AT_name("devNum")
	.dwattr $C$DW$723, DW_AT_TI_symbol_name("_devNum")
	.dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$724	.dwtag  DW_TAG_member
	.dwattr $C$DW$724, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$724, DW_AT_name("ctrlOutEpHandle")
	.dwattr $C$DW$724, DW_AT_TI_symbol_name("_ctrlOutEpHandle")
	.dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$725	.dwtag  DW_TAG_member
	.dwattr $C$DW$725, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$725, DW_AT_name("suspendFlag")
	.dwattr $C$DW$725, DW_AT_TI_symbol_name("_suspendFlag")
	.dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$726	.dwtag  DW_TAG_member
	.dwattr $C$DW$726, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$726, DW_AT_name("hEpHandleArray")
	.dwattr $C$DW$726, DW_AT_TI_symbol_name("_hEpHandleArray")
	.dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$727	.dwtag  DW_TAG_member
	.dwattr $C$DW$727, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$727, DW_AT_name("usbSetup")
	.dwattr $C$DW$727, DW_AT_TI_symbol_name("_usbSetup")
	.dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$728	.dwtag  DW_TAG_member
	.dwattr $C$DW$728, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$728, DW_AT_name("highSpeedCfgDescr")
	.dwattr $C$DW$728, DW_AT_TI_symbol_name("_highSpeedCfgDescr")
	.dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$729	.dwtag  DW_TAG_member
	.dwattr $C$DW$729, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$729, DW_AT_name("fullSpeedCfgDescr")
	.dwattr $C$DW$729, DW_AT_TI_symbol_name("_fullSpeedCfgDescr")
	.dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$730	.dwtag  DW_TAG_member
	.dwattr $C$DW$730, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$730, DW_AT_name("deviceDescr")
	.dwattr $C$DW$730, DW_AT_TI_symbol_name("_deviceDescr")
	.dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$731	.dwtag  DW_TAG_member
	.dwattr $C$DW$731, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$731, DW_AT_name("deviceQualDescr")
	.dwattr $C$DW$731, DW_AT_TI_symbol_name("_deviceQualDescr")
	.dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$732	.dwtag  DW_TAG_member
	.dwattr $C$DW$732, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$732, DW_AT_name("confDescr")
	.dwattr $C$DW$732, DW_AT_TI_symbol_name("_confDescr")
	.dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$733	.dwtag  DW_TAG_member
	.dwattr $C$DW$733, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$733, DW_AT_name("massStorageIntDescr")
	.dwattr $C$DW$733, DW_AT_TI_symbol_name("_massStorageIntDescr")
	.dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$734	.dwtag  DW_TAG_member
	.dwattr $C$DW$734, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$734, DW_AT_name("massStorageBulkOutEndptDescr")
	.dwattr $C$DW$734, DW_AT_TI_symbol_name("_massStorageBulkOutEndptDescr")
	.dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
	.dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$735	.dwtag  DW_TAG_member
	.dwattr $C$DW$735, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$735, DW_AT_name("massStorageInterfcLnk")
	.dwattr $C$DW$735, DW_AT_TI_symbol_name("_massStorageInterfcLnk")
	.dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$736	.dwtag  DW_TAG_member
	.dwattr $C$DW$736, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$736, DW_AT_name("massStorageBulkInEndptDescr")
	.dwattr $C$DW$736, DW_AT_TI_symbol_name("_massStorageBulkInEndptDescr")
	.dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
	.dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$737	.dwtag  DW_TAG_member
	.dwattr $C$DW$737, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$737, DW_AT_name("massStorageBulkOutEndptLnk")
	.dwattr $C$DW$737, DW_AT_TI_symbol_name("_massStorageBulkOutEndptLnk")
	.dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$738	.dwtag  DW_TAG_member
	.dwattr $C$DW$738, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$738, DW_AT_name("stringDescrLangid")
	.dwattr $C$DW$738, DW_AT_TI_symbol_name("_stringDescrLangid")
	.dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
	.dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$739	.dwtag  DW_TAG_member
	.dwattr $C$DW$739, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$739, DW_AT_name("curConfigStat")
	.dwattr $C$DW$739, DW_AT_TI_symbol_name("_curConfigStat")
	.dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
	.dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$740	.dwtag  DW_TAG_member
	.dwattr $C$DW$740, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$740, DW_AT_name("massStorageBulkInEndptLnk")
	.dwattr $C$DW$740, DW_AT_TI_symbol_name("_massStorageBulkInEndptLnk")
	.dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$741	.dwtag  DW_TAG_member
	.dwattr $C$DW$741, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$741, DW_AT_name("ctrlBuffer")
	.dwattr $C$DW$741, DW_AT_TI_symbol_name("_ctrlBuffer")
	.dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
	.dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$742	.dwtag  DW_TAG_member
	.dwattr $C$DW$742, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$742, DW_AT_name("configDescrLnk")
	.dwattr $C$DW$742, DW_AT_TI_symbol_name("_configDescrLnk")
	.dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$743	.dwtag  DW_TAG_member
	.dwattr $C$DW$743, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$743, DW_AT_name("strDescr")
	.dwattr $C$DW$743, DW_AT_TI_symbol_name("_strDescr")
	.dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
	.dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$744	.dwtag  DW_TAG_member
	.dwattr $C$DW$744, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$744, DW_AT_name("mscReqTable")
	.dwattr $C$DW$744, DW_AT_TI_symbol_name("_mscReqTable")
	.dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$745	.dwtag  DW_TAG_member
	.dwattr $C$DW$745, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$745, DW_AT_name("fpRequestHandler")
	.dwattr $C$DW$745, DW_AT_TI_symbol_name("_fpRequestHandler")
	.dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$746	.dwtag  DW_TAG_member
	.dwattr $C$DW$746, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$746, DW_AT_name("usbSpeedCfg")
	.dwattr $C$DW$746, DW_AT_TI_symbol_name("_usbSpeedCfg")
	.dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$747	.dwtag  DW_TAG_member
	.dwattr $C$DW$747, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$747, DW_AT_name("pCfgDescr")
	.dwattr $C$DW$747, DW_AT_TI_symbol_name("_pCfgDescr")
	.dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
	.dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$748	.dwtag  DW_TAG_member
	.dwattr $C$DW$748, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$748, DW_AT_name("pOtherSpeedCfgDescr")
	.dwattr $C$DW$748, DW_AT_TI_symbol_name("_pOtherSpeedCfgDescr")
	.dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$51

$C$DW$T$22	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscCtrlObject")
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
$C$DW$T$132	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$132, DW_AT_address_class(0x17)

$C$DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$67, DW_AT_name("CSL_MscInitStructApp")
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x1e)
$C$DW$749	.dwtag  DW_TAG_member
	.dwattr $C$DW$749, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$749, DW_AT_name("pMscObj")
	.dwattr $C$DW$749, DW_AT_TI_symbol_name("_pMscObj")
	.dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$750	.dwtag  DW_TAG_member
	.dwattr $C$DW$750, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$750, DW_AT_name("pId")
	.dwattr $C$DW$750, DW_AT_TI_symbol_name("_pId")
	.dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$751	.dwtag  DW_TAG_member
	.dwattr $C$DW$751, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$751, DW_AT_name("vId")
	.dwattr $C$DW$751, DW_AT_TI_symbol_name("_vId")
	.dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$752	.dwtag  DW_TAG_member
	.dwattr $C$DW$752, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$752, DW_AT_name("numLun")
	.dwattr $C$DW$752, DW_AT_TI_symbol_name("_numLun")
	.dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$753	.dwtag  DW_TAG_member
	.dwattr $C$DW$753, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$753, DW_AT_name("strDescrApp")
	.dwattr $C$DW$753, DW_AT_TI_symbol_name("_strDescrApp")
	.dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$754	.dwtag  DW_TAG_member
	.dwattr $C$DW$754, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$754, DW_AT_name("lbaBufferApp")
	.dwattr $C$DW$754, DW_AT_TI_symbol_name("_lbaBufferApp")
	.dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$755	.dwtag  DW_TAG_member
	.dwattr $C$DW$755, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$755, DW_AT_name("mscReqTableApp")
	.dwattr $C$DW$755, DW_AT_TI_symbol_name("_mscReqTableApp")
	.dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$756	.dwtag  DW_TAG_member
	.dwattr $C$DW$756, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$756, DW_AT_name("bulkHandler")
	.dwattr $C$DW$756, DW_AT_TI_symbol_name("_bulkHandler")
	.dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$757	.dwtag  DW_TAG_member
	.dwattr $C$DW$757, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$757, DW_AT_name("ctrlHandler")
	.dwattr $C$DW$757, DW_AT_TI_symbol_name("_ctrlHandler")
	.dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$758	.dwtag  DW_TAG_member
	.dwattr $C$DW$758, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$758, DW_AT_name("readMediaApp")
	.dwattr $C$DW$758, DW_AT_TI_symbol_name("_readMediaApp")
	.dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$759	.dwtag  DW_TAG_member
	.dwattr $C$DW$759, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$759, DW_AT_name("writeMediaApp")
	.dwattr $C$DW$759, DW_AT_TI_symbol_name("_writeMediaApp")
	.dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$760	.dwtag  DW_TAG_member
	.dwattr $C$DW$760, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$760, DW_AT_name("mediaGetPresentStateApp")
	.dwattr $C$DW$760, DW_AT_TI_symbol_name("_mediaGetPresentStateApp")
	.dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$761	.dwtag  DW_TAG_member
	.dwattr $C$DW$761, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$761, DW_AT_name("mediaInitApp")
	.dwattr $C$DW$761, DW_AT_TI_symbol_name("_mediaInitApp")
	.dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$762	.dwtag  DW_TAG_member
	.dwattr $C$DW$762, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$762, DW_AT_name("mediaEjectApp")
	.dwattr $C$DW$762, DW_AT_TI_symbol_name("_mediaEjectApp")
	.dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$763	.dwtag  DW_TAG_member
	.dwattr $C$DW$763, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$763, DW_AT_name("mediaLockUnitApp")
	.dwattr $C$DW$763, DW_AT_TI_symbol_name("_mediaLockUnitApp")
	.dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$764	.dwtag  DW_TAG_member
	.dwattr $C$DW$764, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$764, DW_AT_name("getMediaSizeApp")
	.dwattr $C$DW$764, DW_AT_TI_symbol_name("_getMediaSizeApp")
	.dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$67

$C$DW$T$133	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscInitStructApp")
	.dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
$C$DW$T$134	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$T$134, DW_AT_address_class(0x17)
$C$DW$T$135	.dwtag  DW_TAG_typedef, DW_AT_name("pMscAppClassHandle")
	.dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)

$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_name("CSL_MscLogicalUnit")
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x3e)
$C$DW$765	.dwtag  DW_TAG_member
	.dwattr $C$DW$765, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$765, DW_AT_name("scsiInquiryData")
	.dwattr $C$DW$765, DW_AT_TI_symbol_name("_scsiInquiryData")
	.dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$766	.dwtag  DW_TAG_member
	.dwattr $C$DW$766, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$766, DW_AT_name("mediaSize")
	.dwattr $C$DW$766, DW_AT_TI_symbol_name("_mediaSize")
	.dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$767	.dwtag  DW_TAG_member
	.dwattr $C$DW$767, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$767, DW_AT_name("currLba")
	.dwattr $C$DW$767, DW_AT_TI_symbol_name("_currLba")
	.dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$768	.dwtag  DW_TAG_member
	.dwattr $C$DW$768, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$768, DW_AT_name("lbaSize")
	.dwattr $C$DW$768, DW_AT_TI_symbol_name("_lbaSize")
	.dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$769	.dwtag  DW_TAG_member
	.dwattr $C$DW$769, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$769, DW_AT_name("removeable")
	.dwattr $C$DW$769, DW_AT_TI_symbol_name("_removeable")
	.dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$770	.dwtag  DW_TAG_member
	.dwattr $C$DW$770, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$770, DW_AT_name("mediaState")
	.dwattr $C$DW$770, DW_AT_TI_symbol_name("_mediaState")
	.dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$771	.dwtag  DW_TAG_member
	.dwattr $C$DW$771, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$771, DW_AT_name("readwrite")
	.dwattr $C$DW$771, DW_AT_TI_symbol_name("_readwrite")
	.dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$772	.dwtag  DW_TAG_member
	.dwattr $C$DW$772, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$772, DW_AT_name("lbaCnt")
	.dwattr $C$DW$772, DW_AT_TI_symbol_name("_lbaCnt")
	.dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
	.dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$773	.dwtag  DW_TAG_member
	.dwattr $C$DW$773, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$773, DW_AT_name("verifyFlag")
	.dwattr $C$DW$773, DW_AT_TI_symbol_name("_verifyFlag")
	.dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$69

$C$DW$T$72	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscLogicalUnit")
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)

$C$DW$T$73	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$73, DW_AT_byte_size(0xf8)
$C$DW$774	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$774, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$73


$C$DW$T$71	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$71, DW_AT_name("CSL_MscLunAttribApp")
	.dwattr $C$DW$T$71, DW_AT_byte_size(0x20)
$C$DW$775	.dwtag  DW_TAG_member
	.dwattr $C$DW$775, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$775, DW_AT_name("lbaSizeApp")
	.dwattr $C$DW$775, DW_AT_TI_symbol_name("_lbaSizeApp")
	.dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$776	.dwtag  DW_TAG_member
	.dwattr $C$DW$776, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$776, DW_AT_name("mediaSizeApp")
	.dwattr $C$DW$776, DW_AT_TI_symbol_name("_mediaSizeApp")
	.dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$777	.dwtag  DW_TAG_member
	.dwattr $C$DW$777, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$777, DW_AT_name("removeableApp")
	.dwattr $C$DW$777, DW_AT_TI_symbol_name("_removeableApp")
	.dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$778	.dwtag  DW_TAG_member
	.dwattr $C$DW$778, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$778, DW_AT_name("scsiInquiryConfData")
	.dwattr $C$DW$778, DW_AT_TI_symbol_name("_scsiInquiryConfData")
	.dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$779	.dwtag  DW_TAG_member
	.dwattr $C$DW$779, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$779, DW_AT_name("mediaStateApp")
	.dwattr $C$DW$779, DW_AT_TI_symbol_name("_mediaStateApp")
	.dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$780	.dwtag  DW_TAG_member
	.dwattr $C$DW$780, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$780, DW_AT_name("readwriteApp")
	.dwattr $C$DW$780, DW_AT_TI_symbol_name("_readwriteApp")
	.dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$71

$C$DW$T$138	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscLunAttribApp")
	.dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
$C$DW$T$139	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$T$139, DW_AT_address_class(0x17)

$C$DW$T$76	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$76, DW_AT_name("CSL_MscObject")
	.dwattr $C$DW$T$76, DW_AT_byte_size(0x146)
$C$DW$781	.dwtag  DW_TAG_member
	.dwattr $C$DW$781, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$781, DW_AT_name("readMedia")
	.dwattr $C$DW$781, DW_AT_TI_symbol_name("_readMedia")
	.dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$782	.dwtag  DW_TAG_member
	.dwattr $C$DW$782, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$782, DW_AT_name("writeMedia")
	.dwattr $C$DW$782, DW_AT_TI_symbol_name("_writeMedia")
	.dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$783	.dwtag  DW_TAG_member
	.dwattr $C$DW$783, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$783, DW_AT_name("mediaGetPresentState")
	.dwattr $C$DW$783, DW_AT_TI_symbol_name("_mediaGetPresentState")
	.dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$784	.dwtag  DW_TAG_member
	.dwattr $C$DW$784, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$784, DW_AT_name("mediaInit")
	.dwattr $C$DW$784, DW_AT_TI_symbol_name("_mediaInit")
	.dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$785	.dwtag  DW_TAG_member
	.dwattr $C$DW$785, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$785, DW_AT_name("mediaEject")
	.dwattr $C$DW$785, DW_AT_TI_symbol_name("_mediaEject")
	.dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$786	.dwtag  DW_TAG_member
	.dwattr $C$DW$786, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$786, DW_AT_name("mediaLockUnit")
	.dwattr $C$DW$786, DW_AT_TI_symbol_name("_mediaLockUnit")
	.dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$787	.dwtag  DW_TAG_member
	.dwattr $C$DW$787, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$787, DW_AT_name("getMediaSize")
	.dwattr $C$DW$787, DW_AT_TI_symbol_name("_getMediaSize")
	.dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$788	.dwtag  DW_TAG_member
	.dwattr $C$DW$788, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$788, DW_AT_name("lbaBuffer")
	.dwattr $C$DW$788, DW_AT_TI_symbol_name("_lbaBuffer")
	.dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$789	.dwtag  DW_TAG_member
	.dwattr $C$DW$789, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$789, DW_AT_name("cbwDataTransferLength")
	.dwattr $C$DW$789, DW_AT_TI_symbol_name("_cbwDataTransferLength")
	.dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$790	.dwtag  DW_TAG_member
	.dwattr $C$DW$790, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$790, DW_AT_name("lun")
	.dwattr $C$DW$790, DW_AT_TI_symbol_name("_lun")
	.dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$791	.dwtag  DW_TAG_member
	.dwattr $C$DW$791, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$791, DW_AT_name("senseData")
	.dwattr $C$DW$791, DW_AT_TI_symbol_name("_senseData")
	.dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
	.dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$792	.dwtag  DW_TAG_member
	.dwattr $C$DW$792, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$792, DW_AT_name("activityPresentFlag")
	.dwattr $C$DW$792, DW_AT_TI_symbol_name("_activityPresentFlag")
	.dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x119]
	.dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$793	.dwtag  DW_TAG_member
	.dwattr $C$DW$793, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$793, DW_AT_name("csw")
	.dwattr $C$DW$793, DW_AT_TI_symbol_name("_csw")
	.dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x11a]
	.dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$794	.dwtag  DW_TAG_member
	.dwattr $C$DW$794, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$794, DW_AT_name("readCapacity")
	.dwattr $C$DW$794, DW_AT_TI_symbol_name("_readCapacity")
	.dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x122]
	.dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$795	.dwtag  DW_TAG_member
	.dwattr $C$DW$795, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$795, DW_AT_name("cbw")
	.dwattr $C$DW$795, DW_AT_TI_symbol_name("_cbw")
	.dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
	.dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$796	.dwtag  DW_TAG_member
	.dwattr $C$DW$796, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$796, DW_AT_name("bulkInEpHandle")
	.dwattr $C$DW$796, DW_AT_TI_symbol_name("_bulkInEpHandle")
	.dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x13a]
	.dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$797	.dwtag  DW_TAG_member
	.dwattr $C$DW$797, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$797, DW_AT_name("bulkOutEpHandle")
	.dwattr $C$DW$797, DW_AT_TI_symbol_name("_bulkOutEpHandle")
	.dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
	.dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$798	.dwtag  DW_TAG_member
	.dwattr $C$DW$798, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$798, DW_AT_name("noOfLun")
	.dwattr $C$DW$798, DW_AT_TI_symbol_name("_noOfLun")
	.dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x13e]
	.dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$799	.dwtag  DW_TAG_member
	.dwattr $C$DW$799, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$799, DW_AT_name("storageState")
	.dwattr $C$DW$799, DW_AT_TI_symbol_name("_storageState")
	.dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x13f]
	.dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$800	.dwtag  DW_TAG_member
	.dwattr $C$DW$800, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$800, DW_AT_name("modeSenseData")
	.dwattr $C$DW$800, DW_AT_TI_symbol_name("_modeSenseData")
	.dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
	.dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$801	.dwtag  DW_TAG_member
	.dwattr $C$DW$801, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$801, DW_AT_name("writeToMedia")
	.dwattr $C$DW$801, DW_AT_TI_symbol_name("_writeToMedia")
	.dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x145]
	.dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$76

$C$DW$T$23	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscObject")
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
$C$DW$T$140	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$140, DW_AT_address_class(0x17)

$C$DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$78, DW_AT_name("CSL_MscRequestStruct")
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x04)
$C$DW$802	.dwtag  DW_TAG_member
	.dwattr $C$DW$802, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$802, DW_AT_name("request")
	.dwattr $C$DW$802, DW_AT_TI_symbol_name("_request")
	.dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$803	.dwtag  DW_TAG_member
	.dwattr $C$DW$803, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$803, DW_AT_name("fpRequestHandler")
	.dwattr $C$DW$803, DW_AT_TI_symbol_name("_fpRequestHandler")
	.dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$78

$C$DW$T$42	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscRequestStruct")
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
$C$DW$T$43	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$43, DW_AT_address_class(0x17)

$C$DW$T$90	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$90, DW_AT_name("CSL_UsbConfig")
	.dwattr $C$DW$T$90, DW_AT_byte_size(0x16)
$C$DW$804	.dwtag  DW_TAG_member
	.dwattr $C$DW$804, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$804, DW_AT_name("maxCurrent")
	.dwattr $C$DW$804, DW_AT_TI_symbol_name("_maxCurrent")
	.dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$805	.dwtag  DW_TAG_member
	.dwattr $C$DW$805, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$805, DW_AT_name("opMode")
	.dwattr $C$DW$805, DW_AT_TI_symbol_name("_opMode")
	.dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$806	.dwtag  DW_TAG_member
	.dwattr $C$DW$806, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$806, DW_AT_name("appSuspendCallBack")
	.dwattr $C$DW$806, DW_AT_TI_symbol_name("_appSuspendCallBack")
	.dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$807	.dwtag  DW_TAG_member
	.dwattr $C$DW$807, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$807, DW_AT_name("appWakeupCallBack")
	.dwattr $C$DW$807, DW_AT_TI_symbol_name("_appWakeupCallBack")
	.dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$808	.dwtag  DW_TAG_member
	.dwattr $C$DW$808, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$808, DW_AT_name("deviceDescPtr")
	.dwattr $C$DW$808, DW_AT_TI_symbol_name("_deviceDescPtr")
	.dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$809	.dwtag  DW_TAG_member
	.dwattr $C$DW$809, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$809, DW_AT_name("deviceQualDescPtr")
	.dwattr $C$DW$809, DW_AT_TI_symbol_name("_deviceQualDescPtr")
	.dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$810	.dwtag  DW_TAG_member
	.dwattr $C$DW$810, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$810, DW_AT_name("cfgDescPtr")
	.dwattr $C$DW$810, DW_AT_TI_symbol_name("_cfgDescPtr")
	.dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$811	.dwtag  DW_TAG_member
	.dwattr $C$DW$811, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$811, DW_AT_name("cfgDescFSPtr")
	.dwattr $C$DW$811, DW_AT_TI_symbol_name("_cfgDescFSPtr")
	.dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$812	.dwtag  DW_TAG_member
	.dwattr $C$DW$812, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$812, DW_AT_name("strDescPtr")
	.dwattr $C$DW$812, DW_AT_TI_symbol_name("_strDescPtr")
	.dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$813	.dwtag  DW_TAG_member
	.dwattr $C$DW$813, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$813, DW_AT_name("usbSpeedCfg")
	.dwattr $C$DW$813, DW_AT_TI_symbol_name("_usbSpeedCfg")
	.dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$814	.dwtag  DW_TAG_member
	.dwattr $C$DW$814, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$814, DW_AT_name("startTransferCallback")
	.dwattr $C$DW$814, DW_AT_TI_symbol_name("_startTransferCallback")
	.dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$815	.dwtag  DW_TAG_member
	.dwattr $C$DW$815, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$815, DW_AT_name("completeTransferCallback")
	.dwattr $C$DW$815, DW_AT_TI_symbol_name("_completeTransferCallback")
	.dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$90

$C$DW$T$141	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbConfig")
	.dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
$C$DW$T$142	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$141)
	.dwattr $C$DW$T$142, DW_AT_address_class(0x17)

$C$DW$T$106	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$106, DW_AT_name("CSL_UsbContext")
	.dwattr $C$DW$T$106, DW_AT_byte_size(0xda)
$C$DW$816	.dwtag  DW_TAG_member
	.dwattr $C$DW$816, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$816, DW_AT_name("devNum")
	.dwattr $C$DW$816, DW_AT_TI_symbol_name("_devNum")
	.dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$817	.dwtag  DW_TAG_member
	.dwattr $C$DW$817, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$817, DW_AT_name("opMode")
	.dwattr $C$DW$817, DW_AT_TI_symbol_name("_opMode")
	.dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$818	.dwtag  DW_TAG_member
	.dwattr $C$DW$818, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$818, DW_AT_name("maxCurrent")
	.dwattr $C$DW$818, DW_AT_TI_symbol_name("_maxCurrent")
	.dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$819	.dwtag  DW_TAG_member
	.dwattr $C$DW$819, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$819, DW_AT_name("fInitialized")
	.dwattr $C$DW$819, DW_AT_TI_symbol_name("_fInitialized")
	.dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$820	.dwtag  DW_TAG_member
	.dwattr $C$DW$820, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$820, DW_AT_name("fSetupPktCmd")
	.dwattr $C$DW$820, DW_AT_TI_symbol_name("_fSetupPktCmd")
	.dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$821	.dwtag  DW_TAG_member
	.dwattr $C$DW$821, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$821, DW_AT_name("fOutPhaseCmd")
	.dwattr $C$DW$821, DW_AT_TI_symbol_name("_fOutPhaseCmd")
	.dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$822	.dwtag  DW_TAG_member
	.dwattr $C$DW$822, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$822, DW_AT_name("fWaitingOnFlagA")
	.dwattr $C$DW$822, DW_AT_TI_symbol_name("_fWaitingOnFlagA")
	.dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$823	.dwtag  DW_TAG_member
	.dwattr $C$DW$823, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$823, DW_AT_name("fWaitingOnFlagB")
	.dwattr $C$DW$823, DW_AT_TI_symbol_name("_fWaitingOnFlagB")
	.dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$824	.dwtag  DW_TAG_member
	.dwattr $C$DW$824, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$824, DW_AT_name("fWaitingOnEP0BUFAvail")
	.dwattr $C$DW$824, DW_AT_TI_symbol_name("_fWaitingOnEP0BUFAvail")
	.dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$825	.dwtag  DW_TAG_member
	.dwattr $C$DW$825, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$825, DW_AT_name("fWaitingOnEP1InBUFAvail")
	.dwattr $C$DW$825, DW_AT_TI_symbol_name("_fWaitingOnEP1InBUFAvail")
	.dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$826	.dwtag  DW_TAG_member
	.dwattr $C$DW$826, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$826, DW_AT_name("pFIFOBaseAddress")
	.dwattr $C$DW$826, DW_AT_TI_symbol_name("_pFIFOBaseAddress")
	.dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$827	.dwtag  DW_TAG_member
	.dwattr $C$DW$827, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$827, DW_AT_name("pInterruptAddr")
	.dwattr $C$DW$827, DW_AT_TI_symbol_name("_pInterruptAddr")
	.dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$828	.dwtag  DW_TAG_member
	.dwattr $C$DW$828, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$828, DW_AT_name("fSendHandshake")
	.dwattr $C$DW$828, DW_AT_TI_symbol_name("_fSendHandshake")
	.dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$829	.dwtag  DW_TAG_member
	.dwattr $C$DW$829, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$829, DW_AT_name("fMUSBIsReady")
	.dwattr $C$DW$829, DW_AT_TI_symbol_name("_fMUSBIsReady")
	.dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$830	.dwtag  DW_TAG_member
	.dwattr $C$DW$830, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$830, DW_AT_name("cbOutEP0Buf")
	.dwattr $C$DW$830, DW_AT_TI_symbol_name("_cbOutEP0Buf")
	.dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$831	.dwtag  DW_TAG_member
	.dwattr $C$DW$831, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$831, DW_AT_name("cbOutEP0DataReceived")
	.dwattr $C$DW$831, DW_AT_TI_symbol_name("_cbOutEP0DataReceived")
	.dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$832	.dwtag  DW_TAG_member
	.dwattr $C$DW$832, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$832, DW_AT_name("dwOutEP0Buf")
	.dwattr $C$DW$832, DW_AT_TI_symbol_name("_dwOutEP0Buf")
	.dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$833	.dwtag  DW_TAG_member
	.dwattr $C$DW$833, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$833, DW_AT_name("fEP0BUFAvailable")
	.dwattr $C$DW$833, DW_AT_TI_symbol_name("_fEP0BUFAvailable")
	.dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$834	.dwtag  DW_TAG_member
	.dwattr $C$DW$834, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$834, DW_AT_name("fEP1InBUFAvailable")
	.dwattr $C$DW$834, DW_AT_TI_symbol_name("_fEP1InBUFAvailable")
	.dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x53]
	.dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$835	.dwtag  DW_TAG_member
	.dwattr $C$DW$835, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$835, DW_AT_name("dwIntSourceL")
	.dwattr $C$DW$835, DW_AT_TI_symbol_name("_dwIntSourceL")
	.dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$836	.dwtag  DW_TAG_member
	.dwattr $C$DW$836, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$836, DW_AT_name("dwIntSourceH")
	.dwattr $C$DW$836, DW_AT_TI_symbol_name("_dwIntSourceH")
	.dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x55]
	.dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$837	.dwtag  DW_TAG_member
	.dwattr $C$DW$837, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$837, DW_AT_name("remoteWkpStat")
	.dwattr $C$DW$837, DW_AT_TI_symbol_name("_remoteWkpStat")
	.dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
	.dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$838	.dwtag  DW_TAG_member
	.dwattr $C$DW$838, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$838, DW_AT_name("busSpeed")
	.dwattr $C$DW$838, DW_AT_TI_symbol_name("_busSpeed")
	.dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x57]
	.dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$839	.dwtag  DW_TAG_member
	.dwattr $C$DW$839, DW_AT_type(*$C$DW$T$99)
	.dwattr $C$DW$839, DW_AT_name("ep0State")
	.dwattr $C$DW$839, DW_AT_TI_symbol_name("_ep0State")
	.dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$840	.dwtag  DW_TAG_member
	.dwattr $C$DW$840, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$840, DW_AT_name("pEpStatus")
	.dwattr $C$DW$840, DW_AT_TI_symbol_name("_pEpStatus")
	.dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$841	.dwtag  DW_TAG_member
	.dwattr $C$DW$841, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$841, DW_AT_name("cableState")
	.dwattr $C$DW$841, DW_AT_TI_symbol_name("_cableState")
	.dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$842	.dwtag  DW_TAG_member
	.dwattr $C$DW$842, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$842, DW_AT_name("usbSetup")
	.dwattr $C$DW$842, DW_AT_TI_symbol_name("_usbSetup")
	.dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
	.dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$843	.dwtag  DW_TAG_member
	.dwattr $C$DW$843, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$843, DW_AT_name("suspendCallBackFxn")
	.dwattr $C$DW$843, DW_AT_TI_symbol_name("_suspendCallBackFxn")
	.dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$844	.dwtag  DW_TAG_member
	.dwattr $C$DW$844, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$844, DW_AT_name("wakeupCallBackFxn")
	.dwattr $C$DW$844, DW_AT_TI_symbol_name("_wakeupCallBackFxn")
	.dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
	.dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$845	.dwtag  DW_TAG_member
	.dwattr $C$DW$845, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$845, DW_AT_name("startTransferCallback")
	.dwattr $C$DW$845, DW_AT_TI_symbol_name("_startTransferCallback")
	.dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$846	.dwtag  DW_TAG_member
	.dwattr $C$DW$846, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$846, DW_AT_name("completeTransferCallback")
	.dwattr $C$DW$846, DW_AT_TI_symbol_name("_completeTransferCallback")
	.dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
	.dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$847	.dwtag  DW_TAG_member
	.dwattr $C$DW$847, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$847, DW_AT_name("dwFIFOStartAddr")
	.dwattr $C$DW$847, DW_AT_TI_symbol_name("_dwFIFOStartAddr")
	.dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$848	.dwtag  DW_TAG_member
	.dwattr $C$DW$848, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$848, DW_AT_name("deviceDescPtr")
	.dwattr $C$DW$848, DW_AT_TI_symbol_name("_deviceDescPtr")
	.dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
	.dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$849	.dwtag  DW_TAG_member
	.dwattr $C$DW$849, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$849, DW_AT_name("deviceQualDescPtr")
	.dwattr $C$DW$849, DW_AT_TI_symbol_name("_deviceQualDescPtr")
	.dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$850	.dwtag  DW_TAG_member
	.dwattr $C$DW$850, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$850, DW_AT_name("cfgDescPtr")
	.dwattr $C$DW$850, DW_AT_TI_symbol_name("_cfgDescPtr")
	.dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
	.dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$851	.dwtag  DW_TAG_member
	.dwattr $C$DW$851, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$851, DW_AT_name("cfgDescFSPtr")
	.dwattr $C$DW$851, DW_AT_TI_symbol_name("_cfgDescFSPtr")
	.dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$852	.dwtag  DW_TAG_member
	.dwattr $C$DW$852, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$852, DW_AT_name("strDescPtr")
	.dwattr $C$DW$852, DW_AT_TI_symbol_name("_strDescPtr")
	.dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
	.dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$853	.dwtag  DW_TAG_member
	.dwattr $C$DW$853, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$853, DW_AT_name("devAddr")
	.dwattr $C$DW$853, DW_AT_TI_symbol_name("_devAddr")
	.dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
	.dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$854	.dwtag  DW_TAG_member
	.dwattr $C$DW$854, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$854, DW_AT_name("ctrlOutEpObj")
	.dwattr $C$DW$854, DW_AT_TI_symbol_name("_ctrlOutEpObj")
	.dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$855	.dwtag  DW_TAG_member
	.dwattr $C$DW$855, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$855, DW_AT_name("ctrlInEpObj")
	.dwattr $C$DW$855, DW_AT_TI_symbol_name("_ctrlInEpObj")
	.dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
	.dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$856	.dwtag  DW_TAG_member
	.dwattr $C$DW$856, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$856, DW_AT_name("hEpHandleArray")
	.dwattr $C$DW$856, DW_AT_TI_symbol_name("_hEpHandleArray")
	.dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
	.dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$857	.dwtag  DW_TAG_member
	.dwattr $C$DW$857, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$857, DW_AT_name("curConfigStat")
	.dwattr $C$DW$857, DW_AT_TI_symbol_name("_curConfigStat")
	.dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
	.dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$858	.dwtag  DW_TAG_member
	.dwattr $C$DW$858, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$858, DW_AT_name("usbSpeedCfg")
	.dwattr $C$DW$858, DW_AT_TI_symbol_name("_usbSpeedCfg")
	.dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0xd9]
	.dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$106

$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbContext")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$106)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
$C$DW$T$20	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$20, DW_AT_address_class(0x17)
$C$DW$T$21	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDevHandle")
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)

$C$DW$T$108	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$108, DW_AT_name("CSL_UsbDataStruct")
	.dwattr $C$DW$T$108, DW_AT_byte_size(0x06)
$C$DW$859	.dwtag  DW_TAG_member
	.dwattr $C$DW$859, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$859, DW_AT_name("bytes")
	.dwattr $C$DW$859, DW_AT_TI_symbol_name("_bytes")
	.dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$860	.dwtag  DW_TAG_member
	.dwattr $C$DW$860, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$860, DW_AT_name("pBuffer")
	.dwattr $C$DW$860, DW_AT_TI_symbol_name("_pBuffer")
	.dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$861	.dwtag  DW_TAG_member
	.dwattr $C$DW$861, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$861, DW_AT_name("pNextBuffer")
	.dwattr $C$DW$861, DW_AT_TI_symbol_name("_pNextBuffer")
	.dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$108

$C$DW$T$37	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDataStruct")
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
$C$DW$T$107	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$T$107, DW_AT_address_class(0x17)

$C$DW$T$114	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$114, DW_AT_name("CSL_UsbEpConfig")
	.dwattr $C$DW$T$114, DW_AT_byte_size(0x0a)
$C$DW$862	.dwtag  DW_TAG_member
	.dwattr $C$DW$862, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$862, DW_AT_name("opMode")
	.dwattr $C$DW$862, DW_AT_TI_symbol_name("_opMode")
	.dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$863	.dwtag  DW_TAG_member
	.dwattr $C$DW$863, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$863, DW_AT_name("epNum")
	.dwattr $C$DW$863, DW_AT_TI_symbol_name("_epNum")
	.dwattr $C$DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$864	.dwtag  DW_TAG_member
	.dwattr $C$DW$864, DW_AT_type(*$C$DW$T$112)
	.dwattr $C$DW$864, DW_AT_name("xferType")
	.dwattr $C$DW$864, DW_AT_TI_symbol_name("_xferType")
	.dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$865	.dwtag  DW_TAG_member
	.dwattr $C$DW$865, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$865, DW_AT_name("maxPktSize")
	.dwattr $C$DW$865, DW_AT_TI_symbol_name("_maxPktSize")
	.dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$866	.dwtag  DW_TAG_member
	.dwattr $C$DW$866, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$866, DW_AT_name("eventMask")
	.dwattr $C$DW$866, DW_AT_TI_symbol_name("_eventMask")
	.dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$867	.dwtag  DW_TAG_member
	.dwattr $C$DW$867, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$867, DW_AT_name("dblPktBuf")
	.dwattr $C$DW$867, DW_AT_TI_symbol_name("_dblPktBuf")
	.dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$868	.dwtag  DW_TAG_member
	.dwattr $C$DW$868, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$868, DW_AT_name("asyncTxfer")
	.dwattr $C$DW$868, DW_AT_TI_symbol_name("_asyncTxfer")
	.dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$869	.dwtag  DW_TAG_member
	.dwattr $C$DW$869, DW_AT_type(*$C$DW$T$113)
	.dwattr $C$DW$869, DW_AT_name("fxn")
	.dwattr $C$DW$869, DW_AT_TI_symbol_name("_fxn")
	.dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$114

$C$DW$T$146	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpConfig")
	.dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$114)
	.dwattr $C$DW$T$146, DW_AT_language(DW_LANG_C)
$C$DW$T$147	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$146)
	.dwattr $C$DW$T$147, DW_AT_address_class(0x17)

$C$DW$T$117	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$117, DW_AT_name("CSL_UsbEpObj")
	.dwattr $C$DW$T$117, DW_AT_byte_size(0x22)
$C$DW$870	.dwtag  DW_TAG_member
	.dwattr $C$DW$870, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$870, DW_AT_name("epNum")
	.dwattr $C$DW$870, DW_AT_TI_symbol_name("_epNum")
	.dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$871	.dwtag  DW_TAG_member
	.dwattr $C$DW$871, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$871, DW_AT_name("dwEndpoint")
	.dwattr $C$DW$871, DW_AT_TI_symbol_name("_dwEndpoint")
	.dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$872	.dwtag  DW_TAG_member
	.dwattr $C$DW$872, DW_AT_type(*$C$DW$T$112)
	.dwattr $C$DW$872, DW_AT_name("xferType")
	.dwattr $C$DW$872, DW_AT_TI_symbol_name("_xferType")
	.dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$873	.dwtag  DW_TAG_member
	.dwattr $C$DW$873, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$873, DW_AT_name("maxPktSize")
	.dwattr $C$DW$873, DW_AT_TI_symbol_name("_maxPktSize")
	.dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$874	.dwtag  DW_TAG_member
	.dwattr $C$DW$874, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$874, DW_AT_name("eventMask")
	.dwattr $C$DW$874, DW_AT_TI_symbol_name("_eventMask")
	.dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$875	.dwtag  DW_TAG_member
	.dwattr $C$DW$875, DW_AT_type(*$C$DW$T$113)
	.dwattr $C$DW$875, DW_AT_name("fxn")
	.dwattr $C$DW$875, DW_AT_TI_symbol_name("_fxn")
	.dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$876	.dwtag  DW_TAG_member
	.dwattr $C$DW$876, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$876, DW_AT_name("dwPacketSizeAssigned")
	.dwattr $C$DW$876, DW_AT_TI_symbol_name("_dwPacketSizeAssigned")
	.dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$877	.dwtag  DW_TAG_member
	.dwattr $C$DW$877, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$877, DW_AT_name("fInitialized")
	.dwattr $C$DW$877, DW_AT_TI_symbol_name("_fInitialized")
	.dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$878	.dwtag  DW_TAG_member
	.dwattr $C$DW$878, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$878, DW_AT_name("pFifoAddr")
	.dwattr $C$DW$878, DW_AT_TI_symbol_name("_pFifoAddr")
	.dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$879	.dwtag  DW_TAG_member
	.dwattr $C$DW$879, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$879, DW_AT_name("wUSBEvents")
	.dwattr $C$DW$879, DW_AT_TI_symbol_name("_wUSBEvents")
	.dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$880	.dwtag  DW_TAG_member
	.dwattr $C$DW$880, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$880, DW_AT_name("dataReadFromFifo")
	.dwattr $C$DW$880, DW_AT_TI_symbol_name("_dataReadFromFifo")
	.dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$881	.dwtag  DW_TAG_member
	.dwattr $C$DW$881, DW_AT_type(*$C$DW$T$113)
	.dwattr $C$DW$881, DW_AT_name("hEventHandler")
	.dwattr $C$DW$881, DW_AT_TI_symbol_name("_hEventHandler")
	.dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$882	.dwtag  DW_TAG_member
	.dwattr $C$DW$882, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$882, DW_AT_name("fStalled")
	.dwattr $C$DW$882, DW_AT_TI_symbol_name("_fStalled")
	.dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$883	.dwtag  DW_TAG_member
	.dwattr $C$DW$883, DW_AT_type(*$C$DW$T$115)
	.dwattr $C$DW$883, DW_AT_name("pvBuffer")
	.dwattr $C$DW$883, DW_AT_TI_symbol_name("_pvBuffer")
	.dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$884	.dwtag  DW_TAG_member
	.dwattr $C$DW$884, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$884, DW_AT_name("cbBuffer")
	.dwattr $C$DW$884, DW_AT_TI_symbol_name("_cbBuffer")
	.dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$885	.dwtag  DW_TAG_member
	.dwattr $C$DW$885, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$885, DW_AT_name("cbTransferred")
	.dwattr $C$DW$885, DW_AT_TI_symbol_name("_cbTransferred")
	.dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$886	.dwtag  DW_TAG_member
	.dwattr $C$DW$886, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$886, DW_AT_name("prevTxferLen")
	.dwattr $C$DW$886, DW_AT_TI_symbol_name("_prevTxferLen")
	.dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$887	.dwtag  DW_TAG_member
	.dwattr $C$DW$887, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$887, DW_AT_name("fComplete")
	.dwattr $C$DW$887, DW_AT_TI_symbol_name("_fComplete")
	.dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$888	.dwtag  DW_TAG_member
	.dwattr $C$DW$888, DW_AT_type(*$C$DW$T$116)
	.dwattr $C$DW$888, DW_AT_name("ioFlags")
	.dwattr $C$DW$888, DW_AT_TI_symbol_name("_ioFlags")
	.dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$889	.dwtag  DW_TAG_member
	.dwattr $C$DW$889, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$889, DW_AT_name("hUsbDev")
	.dwattr $C$DW$889, DW_AT_TI_symbol_name("_hUsbDev")
	.dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$117

$C$DW$T$25	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpObj")
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$117)
	.dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
$C$DW$T$26	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$26, DW_AT_address_class(0x17)
$C$DW$T$27	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpHandle")
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)

$C$DW$T$31	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
$C$DW$890	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$890, DW_AT_upper_bound(0x04)
	.dwendtag $C$DW$T$31


$C$DW$T$105	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$105, DW_AT_byte_size(0x14)
$C$DW$891	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$891, DW_AT_upper_bound(0x09)
	.dwendtag $C$DW$T$105

$C$DW$T$151	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$151, DW_AT_address_class(0x17)

$C$DW$T$120	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$120, DW_AT_name("CSL_UsbEpStatus")
	.dwattr $C$DW$T$120, DW_AT_byte_size(0x12)
$C$DW$892	.dwtag  DW_TAG_member
	.dwattr $C$DW$892, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$892, DW_AT_name("dwEndpoint")
	.dwattr $C$DW$892, DW_AT_TI_symbol_name("_dwEndpoint")
	.dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$893	.dwtag  DW_TAG_member
	.dwattr $C$DW$893, DW_AT_type(*$C$DW$T$112)
	.dwattr $C$DW$893, DW_AT_name("xferType")
	.dwattr $C$DW$893, DW_AT_TI_symbol_name("_xferType")
	.dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$894	.dwtag  DW_TAG_member
	.dwattr $C$DW$894, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$894, DW_AT_name("dwPacketSizeAssigned")
	.dwattr $C$DW$894, DW_AT_TI_symbol_name("_dwPacketSizeAssigned")
	.dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$895	.dwtag  DW_TAG_member
	.dwattr $C$DW$895, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$895, DW_AT_name("fInitialized")
	.dwattr $C$DW$895, DW_AT_TI_symbol_name("_fInitialized")
	.dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$896	.dwtag  DW_TAG_member
	.dwattr $C$DW$896, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$896, DW_AT_name("pFifoAddr")
	.dwattr $C$DW$896, DW_AT_TI_symbol_name("_pFifoAddr")
	.dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$897	.dwtag  DW_TAG_member
	.dwattr $C$DW$897, DW_AT_type(*$C$DW$T$119)
	.dwattr $C$DW$897, DW_AT_name("pTransfer")
	.dwattr $C$DW$897, DW_AT_TI_symbol_name("_pTransfer")
	.dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$898	.dwtag  DW_TAG_member
	.dwattr $C$DW$898, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$898, DW_AT_name("wUSBEvents")
	.dwattr $C$DW$898, DW_AT_TI_symbol_name("_wUSBEvents")
	.dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$899	.dwtag  DW_TAG_member
	.dwattr $C$DW$899, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$899, DW_AT_name("dataReadFromFifo")
	.dwattr $C$DW$899, DW_AT_TI_symbol_name("_dataReadFromFifo")
	.dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$900	.dwtag  DW_TAG_member
	.dwattr $C$DW$900, DW_AT_type(*$C$DW$T$113)
	.dwattr $C$DW$900, DW_AT_name("hEventHandler")
	.dwattr $C$DW$900, DW_AT_TI_symbol_name("_hEventHandler")
	.dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$901	.dwtag  DW_TAG_member
	.dwattr $C$DW$901, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$901, DW_AT_name("fStalled")
	.dwattr $C$DW$901, DW_AT_TI_symbol_name("_fStalled")
	.dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$902	.dwtag  DW_TAG_member
	.dwattr $C$DW$902, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$902, DW_AT_name("fSelected")
	.dwattr $C$DW$902, DW_AT_TI_symbol_name("_fSelected")
	.dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$120

$C$DW$T$100	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpStatus")
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$120)
	.dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
$C$DW$T$101	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$T$101, DW_AT_address_class(0x17)

$C$DW$T$121	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$121, DW_AT_name("CSL_UsbSetupStruct")
	.dwattr $C$DW$T$121, DW_AT_byte_size(0x06)
$C$DW$903	.dwtag  DW_TAG_member
	.dwattr $C$DW$903, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$903, DW_AT_name("newPacket")
	.dwattr $C$DW$903, DW_AT_TI_symbol_name("_newPacket")
	.dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$904	.dwtag  DW_TAG_member
	.dwattr $C$DW$904, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$904, DW_AT_name("bmRequestType")
	.dwattr $C$DW$904, DW_AT_TI_symbol_name("_bmRequestType")
	.dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$905	.dwtag  DW_TAG_member
	.dwattr $C$DW$905, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$905, DW_AT_name("bRequest")
	.dwattr $C$DW$905, DW_AT_TI_symbol_name("_bRequest")
	.dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$906	.dwtag  DW_TAG_member
	.dwattr $C$DW$906, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$906, DW_AT_name("wValue")
	.dwattr $C$DW$906, DW_AT_TI_symbol_name("_wValue")
	.dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$907	.dwtag  DW_TAG_member
	.dwattr $C$DW$907, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$907, DW_AT_name("wIndex")
	.dwattr $C$DW$907, DW_AT_TI_symbol_name("_wIndex")
	.dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$908	.dwtag  DW_TAG_member
	.dwattr $C$DW$908, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$908, DW_AT_name("wLength")
	.dwattr $C$DW$908, DW_AT_TI_symbol_name("_wLength")
	.dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$121

$C$DW$T$32	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbSetupStruct")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$121)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
$C$DW$T$46	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$46, DW_AT_address_class(0x17)

$C$DW$T$122	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$122, DW_AT_name("CSL_UsbTransfer")
	.dwattr $C$DW$T$122, DW_AT_byte_size(0x0e)
$C$DW$909	.dwtag  DW_TAG_member
	.dwattr $C$DW$909, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$909, DW_AT_name("dwFlags")
	.dwattr $C$DW$909, DW_AT_TI_symbol_name("_dwFlags")
	.dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$910	.dwtag  DW_TAG_member
	.dwattr $C$DW$910, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$910, DW_AT_name("dwEndpoint")
	.dwattr $C$DW$910, DW_AT_TI_symbol_name("_dwEndpoint")
	.dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$911	.dwtag  DW_TAG_member
	.dwattr $C$DW$911, DW_AT_type(*$C$DW$T$115)
	.dwattr $C$DW$911, DW_AT_name("pvBuffer")
	.dwattr $C$DW$911, DW_AT_TI_symbol_name("_pvBuffer")
	.dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$912	.dwtag  DW_TAG_member
	.dwattr $C$DW$912, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$912, DW_AT_name("cbBuffer")
	.dwattr $C$DW$912, DW_AT_TI_symbol_name("_cbBuffer")
	.dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$913	.dwtag  DW_TAG_member
	.dwattr $C$DW$913, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$913, DW_AT_name("cbTransferred")
	.dwattr $C$DW$913, DW_AT_TI_symbol_name("_cbTransferred")
	.dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$914	.dwtag  DW_TAG_member
	.dwattr $C$DW$914, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$914, DW_AT_name("prevTxferLen")
	.dwattr $C$DW$914, DW_AT_TI_symbol_name("_prevTxferLen")
	.dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$915	.dwtag  DW_TAG_member
	.dwattr $C$DW$915, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$915, DW_AT_name("fComplete")
	.dwattr $C$DW$915, DW_AT_TI_symbol_name("_fComplete")
	.dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$916	.dwtag  DW_TAG_member
	.dwattr $C$DW$916, DW_AT_type(*$C$DW$T$116)
	.dwattr $C$DW$916, DW_AT_name("ioFlags")
	.dwattr $C$DW$916, DW_AT_TI_symbol_name("_ioFlags")
	.dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$122

$C$DW$T$118	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbTransfer")
	.dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$122)
	.dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
$C$DW$T$119	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
	.dwattr $C$DW$T$119, DW_AT_address_class(0x17)
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_address_class(0x17)
$C$DW$T$115	.dwtag  DW_TAG_typedef, DW_AT_name("PVOID")
	.dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)

$C$DW$T$52	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
$C$DW$T$53	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$53, DW_AT_address_class(0x20)
$C$DW$T$113	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_USB_EVENT_ISR")
	.dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)

$C$DW$T$81	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
$C$DW$917	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$917, DW_AT_type(*$C$DW$T$30)
	.dwendtag $C$DW$T$81

$C$DW$T$82	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$T$82, DW_AT_address_class(0x20)
$C$DW$T$83	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_USB_APP_CALLBACK")
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
$C$DW$918	.dwtag  DW_TAG_TI_far_type
$C$DW$T$153	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$153, DW_AT_type(*$C$DW$918)
$C$DW$T$154	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$153)
	.dwattr $C$DW$T$154, DW_AT_address_class(0x17)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
$C$DW$T$85	.dwtag  DW_TAG_typedef, DW_AT_name("Int16")
	.dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
$C$DW$T$86	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
	.dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)

$C$DW$T$87	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
$C$DW$919	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$919, DW_AT_type(*$C$DW$T$3)
$C$DW$920	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$920, DW_AT_type(*$C$DW$T$3)
	.dwendtag $C$DW$T$87

$C$DW$T$88	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$T$88, DW_AT_address_class(0x20)
$C$DW$T$89	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_USB_APP_TRANSFER_CALLBACK")
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
$C$DW$T$123	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$123, DW_AT_address_class(0x17)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
$C$DW$T$49	.dwtag  DW_TAG_typedef, DW_AT_name("Bool")
	.dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$9)
