;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
;* Date/Time created: Fri Jul 05 14:18:07 2013                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_2_1 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.model call=c55_std
	.model mem=large
	.noremark 5503  ; code avoids SE CPU_84 MMR write
	.noremark 5505  ; code avoids SE CPU_84 MMR read
	.noremark 5673  ; code avoids SE CPU_89
	.noremark 5684  ; code avoids SE CPU_116 indirect write
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Size                                                 *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Optimized TI Debug Information                       *

	.dwattr $C$DW$287, DW_AT_name("M:\TI_MAS_VOLIB_2_1_0_1_bldforge\dsps_gtmas\ti\mas\vpe\test\ccsProjects\test_rel_c55l_C55L_COFF\Debug\vpesim.asm:$C$L15:3:1373048287")
	.dwattr $C$DW$287, DW_AT_TI_begin_file("M:/TI_MAS_VOLIB_2_1_0_1_bldforge/dsps_gtmas/ti/mas/vpe/test/src/vpesim.c")
	.dwattr $C$DW$287, DW_AT_TI_begin_line(0xe7)
	.dwattr $C$DW$287, DW_AT_TI_end_line(0xe9)
$C$DW$288	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$288, DW_AT_low_pc($C$DW$L$_main$25$B)
	.dwattr $C$DW$288, DW_AT_high_pc($C$DW$L$_main$25$E)
	.dwendtag $C$DW$287


$C$DW$289	.dwtag  DW_TAG_TI_loop
	.dwattr $C$DW$289, DW_AT_name("M:\TI_MAS_VOLIB_2_1_0_1_bldforge\dsps_gtmas\ti\mas\vpe\test\ccsProjects\test_rel_c55l_C55L_COFF\Debug\vpesim.asm:$C$L22:3:1373048287")
	.dwattr $C$DW$289, DW_AT_TI_begin_file("M:/TI_MAS_VOLIB_2_1_0_1_bldforge/dsps_gtmas/ti/mas/vpe/test/src/vpesim.c")
	.dwattr $C$DW$289, DW_AT_TI_begin_line(0x113)
	.dwattr $C$DW$289, DW_AT_TI_end_line(0x115)
$C$DW$290	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$290, DW_AT_low_pc($C$DW$L$_main$39$B)
	.dwattr $C$DW$290, DW_AT_high_pc($C$DW$L$_main$39$E)
	.dwendtag $C$DW$289


$C$DW$291	.dwtag  DW_TAG_TI_loop
	.dwattr $C$DW$291, DW_AT_name("M:\TI_MAS_VOLIB_2_1_0_1_bldforge\dsps_gtmas\ti\mas\vpe\test\ccsProjects\test_rel_c55l_C55L_COFF\Debug\vpesim.asm:$C$L26:3:1373048287")
	.dwattr $C$DW$291, DW_AT_TI_begin_file("M:/TI_MAS_VOLIB_2_1_0_1_bldforge/dsps_gtmas/ti/mas/vpe/test/src/vpesim.c")
	.dwattr $C$DW$291, DW_AT_TI_begin_line(0x123)
	.dwattr $C$DW$291, DW_AT_TI_end_line(0x125)
$C$DW$292	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$292, DW_AT_low_pc($C$DW$L$_main$44$B)
	.dwattr $C$DW$292, DW_AT_high_pc($C$DW$L$_main$44$E)
	.dwendtag $C$DW$291


$C$DW$293	.dwtag  DW_TAG_TI_loop
	.dwattr $C$DW$293, DW_AT_name("M:\TI_MAS_VOLIB_2_1_0_1_bldforge\dsps_gtmas\ti\mas\vpe\test\ccsProjects\test_rel_c55l_C55L_COFF\Debug\vpesim.asm:$C$L30:3:1373048287")
	.dwattr $C$DW$293, DW_AT_TI_begin_file("M:/TI_MAS_VOLIB_2_1_0_1_bldforge/dsps_gtmas/ti/mas/vpe/test/src/vpesim.c")
	.dwattr $C$DW$293, DW_AT_TI_begin_line(0x144)
	.dwattr $C$DW$293, DW_AT_TI_end_line(0x146)
$C$DW$294	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$294, DW_AT_low_pc($C$DW$L$_main$50$B)
	.dwattr $C$DW$294, DW_AT_high_pc($C$DW$L$_main$50$E)
	.dwendtag $C$DW$293


$C$DW$295	.dwtag  DW_TAG_TI_loop
	.dwattr $C$DW$295, DW_AT_name("M:\TI_MAS_VOLIB_2_1_0_1_bldforge\dsps_gtmas\ti\mas\vpe\test\ccsProjects\test_rel_c55l_C55L_COFF\Debug\vpesim.asm:$C$L36:3:1373048287")
	.dwattr $C$DW$295, DW_AT_TI_begin_file("M:/TI_MAS_VOLIB_2_1_0_1_bldforge/dsps_gtmas/ti/mas/vpe/test/src/vpesim.c")
	.dwattr $C$DW$295, DW_AT_TI_begin_line(0x163)
	.dwattr $C$DW$295, DW_AT_TI_end_line(0x165)
$C$DW$296	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$296, DW_AT_low_pc($C$DW$L$_main$62$B)
	.dwattr $C$DW$296, DW_AT_high_pc($C$DW$L$_main$62$E)
	.dwendtag $C$DW$295

	.dwendtag $C$DW$217

	.dwendtag $C$DW$202

	.dwattr $C$DW$134, DW_AT_TI_end_file("M:/TI_MAS_VOLIB_2_1_0_1_bldforge/dsps_gtmas/ti/mas/vpe/test/src/vpesim.c")
	.dwattr $C$DW$134, DW_AT_TI_end_line(0x1ab)
	.dwattr $C$DW$134, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$134

;*******************************************************************************
;* FAR STRINGS                                                                 *
;*******************************************************************************
	.sect	".const:.string"
	.align	2
$C$FSL1:	.string	10,0
	.align	2
$C$FSL2:	.string	"------------------------------",10,0
	.align	2
$C$FSL3:	.string	"Simulation:  BEGIN",10,0
	.align	2
$C$FSL4:	.string	"Error returned by asnrProcessn() = %d!",10,0
	.align	2
$C$FSL5:	.string	" - Progress: %d seconds",10,0
	.align	2
$C$FSL6:	.string	" - Halting after %d samples",10,0
	.align	2
$C$FSL7:	.string	"Simulation:  END",10,0
	.align	2
$C$FSL8:	.string	"Simulation done.",10,0
;******************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                              *
;******************************************************************************
	.global	_exit
	.global	_printf
	.global	_hlcControl
	.global	_hlcProcess
	.global	_slmControl
	.global	_slmProcess
	.global	_snlProcess
	.global	_snlGetLevels
	.global	_svdProcess
	.global	_svdGetDecision
	.global	_svdGetLevels
	.global	_sfcDecimationBy2
	.global	_sfcInterpolationBy2
	.global	_pcmUlawEncoderP
	.global	_pcmAlawEncoderP
	.global	_pcmUlawDecoderP
	.global	_pcmAlawDecoderP
	.global	_asnrProcess
	.global	_vpe_sim_fileio_init
	.global	_vpe_sim_fileio_end
	.global	_vpe_sim_init
	.global	_vpe_init
	.global	_vpe_sim_fread
	.global	_vpe_sim_fwrite
	.global	_vpe_print
	.global	_vpe_iprint
	.global	_vpe_sim_set_sgn
	.global	_vpe_sim_gen_frame
	.global	_vpe_deinstantiate_nr
	.global	_vpe_halt
	.global	_vpe_sim_flush_cache
	.global	_vpe_sim_read_cfg

;*******************************************************************************
;* TYPE INFORMATION                                                            *
;*******************************************************************************

$C$DW$T$46	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
$C$DW$297	.dwtag  DW_TAG_enumerator, DW_AT_name("vpe_SIM_PCM_ALAW"), DW_AT_const_value(0x00)
$C$DW$298	.dwtag  DW_TAG_enumerator, DW_AT_name("vpe_SIM_PCM_ULAW"), DW_AT_const_value(0x01)
$C$DW$299	.dwtag  DW_TAG_enumerator, DW_AT_name("vpe_SIM_PCM_LIN"), DW_AT_const_value(0x02)
	.dwendtag $C$DW$T$46

$C$DW$T$47	.dwtag  DW_TAG_typedef, DW_AT_name("vpeSimPcm_e")
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$300, DW_AT_name("ctl_code")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("_ctl_code")
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$301, DW_AT_name("u")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("_u")
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$22

$C$DW$T$42	.dwtag  DW_TAG_typedef, DW_AT_name("hlcControl_t")
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
$C$DW$T$54	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$54, DW_AT_address_class(0x17)

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x0c)
$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$302, DW_AT_name("fd")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("_fd")
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$303, DW_AT_name("buf")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("_buf")
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$304, DW_AT_name("pos")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("_pos")
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$305, DW_AT_name("bufend")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("_bufend")
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$306, DW_AT_name("buff_stop")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("_buff_stop")
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$307, DW_AT_name("flags")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("_flags")
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$24

$C$DW$T$28	.dwtag  DW_TAG_typedef, DW_AT_name("FILE")
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
$C$DW$T$29	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$29, DW_AT_address_class(0x17)

$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x104)
$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$308, DW_AT_name("fio")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("_fio")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$309, DW_AT_name("eof")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("_eof")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$310, DW_AT_name("fptr")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("_fptr")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$311, DW_AT_name("fname")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("_fname")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$32

$C$DW$T$45	.dwtag  DW_TAG_typedef, DW_AT_name("vpeSimFileIo_t")
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
$C$DW$T$55	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$T$55, DW_AT_address_class(0x17)

$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x0e)
$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$312, DW_AT_name("state")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("_state")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$313, DW_AT_name("dcoffset")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("_dcoffset")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$314, DW_AT_name("wftype")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("_wftype")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$315, DW_AT_name("f1")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("_f1")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$316, DW_AT_name("f2")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("_f2")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$317, DW_AT_name("amp1")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("_amp1")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$318, DW_AT_name("amp2")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("_amp2")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$319, DW_AT_name("nlevel")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("_nlevel")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$320, DW_AT_name("nseed")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("_nseed")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$321, DW_AT_name("ntype")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("_ntype")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$322, DW_AT_name("pow_level")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("_pow_level")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$323, DW_AT_name("hoth_seed")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("_hoth_seed")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$37

$C$DW$T$44	.dwtag  DW_TAG_typedef, DW_AT_name("vpeSGNPars_t")
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
$C$DW$T$56	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$56, DW_AT_address_class(0x17)

$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x0b)
$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$324, DW_AT_name("samp_rate")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("_samp_rate")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$325, DW_AT_name("delay")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("_delay")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$326, DW_AT_name("band_bin1")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("_band_bin1")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$327, DW_AT_name("band_bin2")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("_band_bin2")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$328, DW_AT_name("band1_max_atten")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("_band1_max_atten")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$329, DW_AT_name("band2_max_atten")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("_band2_max_atten")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$330, DW_AT_name("band3_max_atten")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("_band3_max_atten")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$331, DW_AT_name("sig_upd_rate_max")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("_sig_upd_rate_max")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$332, DW_AT_name("sig_upd_rate_min")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("_sig_upd_rate_min")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$333, DW_AT_name("noise_thresh")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("_noise_thresh")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$334, DW_AT_name("noise_hangover")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("_noise_hangover")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$38

$C$DW$T$43	.dwtag  DW_TAG_typedef, DW_AT_name("vpeASNRPars_t")
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)

$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x444)
$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$335, DW_AT_name("exec")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("_exec")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$336, DW_AT_name("hlc_on")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("_hlc_on")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$337, DW_AT_name("slm_on")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("_slm_on")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$338, DW_AT_name("snl_on")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("_snl_on")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$339, DW_AT_name("svd_on")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("_svd_on")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$340, DW_AT_name("nr_on")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("_nr_on")
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$341, DW_AT_name("decim_on")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("_decim_on")
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$342, DW_AT_name("interp_on")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("_interp_on")
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$343, DW_AT_name("ulaw_enc_on")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("_ulaw_enc_on")
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$344, DW_AT_name("ulaw_dec_on")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("_ulaw_dec_on")
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$345, DW_AT_name("alaw_enc_on")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("_alaw_enc_on")
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$346, DW_AT_name("alaw_dec_on")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("_alaw_dec_on")
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$347, DW_AT_name("sample_cnt")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("_sample_cnt")
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$348, DW_AT_name("sample_bp")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("_sample_bp")
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$349	.dwtag  DW_TAG_member
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$349, DW_AT_name("sgn")
	.dwattr $C$DW$349, DW_AT_TI_symbol_name("_sgn")
	.dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$350, DW_AT_name("cfg_sgn")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("_cfg_sgn")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$351, DW_AT_name("cfg_hlc")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("_cfg_hlc")
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$352, DW_AT_name("cfg_slm")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("_cfg_slm")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$353, DW_AT_name("slm_mod")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("_slm_mod")
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$354, DW_AT_name("Fs")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("_Fs")
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$355, DW_AT_name("hlc_ctrl")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("_hlc_ctrl")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$356, DW_AT_name("asnrParam")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("_asnrParam")
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$357, DW_AT_name("sgnParam")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("_sgnParam")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$358, DW_AT_name("sigIn")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("_sigIn")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$359, DW_AT_name("sigOut")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("_sigOut")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x136]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$360, DW_AT_name("config")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("_config")
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x23a]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$361, DW_AT_name("pcmin_format")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("_pcmin_format")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x33e]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$362	.dwtag  DW_TAG_member
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$362, DW_AT_name("pcmout_format")
	.dwattr $C$DW$362, DW_AT_TI_symbol_name("_pcmout_format")
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x33f]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$363, DW_AT_name("data")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("_data")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x340]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$364, DW_AT_name("error_id")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("_error_id")
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x341]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$365, DW_AT_name("frame_size_in")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("_frame_size_in")
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x342]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$366, DW_AT_name("frame_size_out")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("_frame_size_out")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x343]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$367, DW_AT_name("baseDir")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("_baseDir")
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x344]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$51

$C$DW$T$57	.dwtag  DW_TAG_typedef, DW_AT_name("vpeSimConfig_t")
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
$C$DW$T$58	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$58, DW_AT_address_class(0x17)

$C$DW$T$53	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$368, DW_AT_name("thresh")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("_thresh")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$53

$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_address_class(0x17)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$23	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$23, DW_AT_address_class(0x17)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
$C$DW$T$20	.dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
$C$DW$T$21	.dwtag  DW_TAG_typedef, DW_AT_name("tint")
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
$C$DW$T$52	.dwtag  DW_TAG_typedef, DW_AT_name("Fract")
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
$C$DW$369	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$52)
$C$DW$T$62	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$369)
$C$DW$T$63	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$63, DW_AT_address_class(0x17)
$C$DW$T$97	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$97, DW_AT_address_class(0x17)
$C$DW$T$33	.dwtag  DW_TAG_typedef, DW_AT_name("linSample")
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
$C$DW$T$61	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$61, DW_AT_address_class(0x17)

$C$DW$T$119	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$119, DW_AT_byte_size(0x140)
$C$DW$370	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$370, DW_AT_upper_bound(0x13f)
	.dwendtag $C$DW$T$119


$C$DW$T$120	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$120, DW_AT_byte_size(0x280)
$C$DW$371	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$371, DW_AT_upper_bound(0x27f)
	.dwendtag $C$DW$T$120


$C$DW$T$121	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$121, DW_AT_byte_size(0xc0)
$C$DW$372	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$372, DW_AT_upper_bound(0xbf)
	.dwendtag $C$DW$T$121


$C$DW$T$122	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$122, DW_AT_byte_size(0xb0)
